[
  "obsidian-latex-suite",
  "settings-search",
  "obsidian-excel-to-markdown-table",
  "obsidian-table-generator",
  "obsidian-tikzjax",
  "solve",
  "file-tree-alternative",
  "better-word-count",
  "table-editor-obsidian",
  "languagetool"
]