-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07
> /PRONOSTICOS/GUIAS-EXAMENES/PARCIAL2023/datos/PF_Parcial_2023_Sol.log
  log type:  text
 opened on:  26 Apr 2024, 15:43:10

. 
. // Item "a"
. // ADF para inflacion en niveles
. gen inflacion = D.ipc / L.ipc
(1 missing value generated)

. gen crec_m = D.m / L.m
(1 missing value generated)

. dfgls inflacion
 
DF-GLS for inflacion                                     Number of obs =    63
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11           -1.210           -3.675            -2.718            -2.442
    10           -1.395           -3.675            -2.761            -2.485
    9            -1.872           -3.675            -2.805            -2.528
    8            -1.961           -3.675            -2.849            -2.571
    7            -2.378           -3.675            -2.892            -2.612
    6            -2.043           -3.675            -2.934            -2.652
    5            -1.594           -3.675            -2.975            -2.689
    4            -2.005           -3.675            -3.013            -2.725
    3            -2.510           -3.675            -3.048            -2.757
    2            -2.403           -3.675            -3.079            -2.786
    1            -3.089           -3.675            -3.107            -2.811
 
Opt Lag (Ng-Perron seq t) =  6 with RMSE  .0090402
Min SC   = -9.120969 at lag  1 with RMSE  .0097914
Min MAIC = -9.013693 at lag  5 with RMSE  .0093666

. dfuller inflacion, lags(6) trend regress

Augmented Dickey-Fuller test for unit root         Number of obs   =        68

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.086            -4.110            -3.482            -3.169
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.5540

------------------------------------------------------------------------------
D.inflacion  |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   inflacion |
         L1. |   -.298217   .1429642    -2.09   0.041    -.5842877   -.0121463
         LD. |  -.0170195   .1690833    -0.10   0.920    -.3553544    .3213155
        L2D. |  -.1046521   .1610124    -0.65   0.518    -.4268371     .217533
        L3D. |   .0508179   .1511727     0.34   0.738    -.2516779    .3533137
        L4D. |  -.0973691   .1470428    -0.66   0.510     -.391601    .1968628
        L5D. |  -.0417896   .1380239    -0.30   0.763    -.3179748    .2343957
        L6D. |    .257071   .1294666     1.99   0.052    -.0019912    .5161331
      _trend |   .0001672    .000088     1.90   0.062    -8.78e-06    .0003432
       _cons |   .0049809   .0035627     1.40   0.167     -.002148    .0121097
------------------------------------------------------------------------------

. dfgls inflacion, notrend
 
DF-GLS for inflacion                                     Number of obs =    63
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11            1.224           -2.610            -1.993            -1.695
    10            0.934           -2.610            -2.011            -1.714
    9             0.276           -2.610            -2.030            -1.734
    8             0.140           -2.610            -2.051            -1.755
    7            -0.393           -2.610            -2.072            -1.776
    6            -0.114           -2.610            -2.094            -1.797
    5             0.327           -2.610            -2.115            -1.818
    4            -0.106           -2.610            -2.136            -1.838
    3            -0.526           -2.610            -2.156            -1.856
    2            -0.497           -2.610            -2.174            -1.873
    1            -1.111           -2.610            -2.191            -1.888
 
Opt Lag (Ng-Perron seq t) = 10 with RMSE  .0088712
Min SC   = -8.989189 at lag  1 with RMSE  .0104583
Min MAIC = -9.132408 at lag  6 with RMSE  .0094492

. dfuller inflacion, lags(10) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =        64

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -0.277            -3.560            -2.919            -2.594
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9288

------------------------------------------------------------------------------
 D.inflacion |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   inflacion |
         L1. |  -.0373816   .1351737    -0.28   0.783    -.3086275    .2338643
         LD. |  -.2555089   .1752875    -1.46   0.151     -.607249    .0962313
        L2D. |  -.3001811   .1718384    -1.75   0.087    -.6450001    .0446379
        L3D. |  -.0933317    .162942    -0.57   0.569    -.4202987    .2336354
        L4D. |  -.2185027    .162977    -1.34   0.186    -.5455399    .1085346
        L5D. |  -.1809375   .1704935    -1.06   0.293    -.5230577    .1611828
        L6D. |   .1030532   .1688916     0.61   0.544    -.2358526     .441959
        L7D. |  -.0237649   .1694603    -0.14   0.889    -.3638119     .316282
        L8D. |  -.2573802    .168048    -1.53   0.132    -.5945931    .0798327
        L9D. |  -.1374092    .159146    -0.86   0.392    -.4567589    .1819406
       L10D. |  -.2548578   .1474931    -1.73   0.090    -.5508242    .0411087
             |
       _cons |   .0034617   .0047655     0.73   0.471     -.006101    .0130243
------------------------------------------------------------------------------

. // ADF para inflacion en primeras diferencias
. dfgls D.inflacion
 
DF-GLS for D.inflacion                                   Number of obs =    62
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11           -2.185           -3.679            -2.715            -2.439
    10           -2.706           -3.679            -2.758            -2.482
    9            -2.958           -3.679            -2.803            -2.526
    8            -2.632           -3.679            -2.848            -2.569
    7            -2.840           -3.679            -2.892            -2.611
    6            -2.481           -3.679            -2.935            -2.652
    5            -3.050           -3.679            -2.976            -2.690
    4            -4.904           -3.679            -3.015            -2.726
    3            -5.051           -3.679            -3.050            -2.759
    2            -5.070           -3.679            -3.083            -2.789
    1            -7.513           -3.679            -3.110            -2.814
 
Opt Lag (Ng-Perron seq t) =  5 with RMSE  .0095245
Min SC   = -9.022581 at lag  1 with RMSE  .0102769
Min MAIC = -5.354113 at lag  6 with RMSE  .0094585

. dfuller D.inflacion, lags(5) trend regress

Augmented Dickey-Fuller test for unit root         Number of obs   =        68

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -3.761            -4.110            -3.482            -3.169
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0186

------------------------------------------------------------------------------
D2.inflacion |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 D.inflacion |
         L1. |  -1.872807   .4978979    -3.76   0.000    -2.868751   -.8768632
         LD. |   .6168285   .4347701     1.42   0.161    -.2528412    1.486498
        L2D. |   .3083465   .3649929     0.84   0.402    -.4217479    1.038441
        L3D. |   .1993626   .2934005     0.68   0.499    -.3875257    .7862509
        L4D. |  -.0398399   .2100131    -0.19   0.850    -.4599285    .3802488
        L5D. |  -.1861755   .1283673    -1.45   0.152    -.4429484    .0705974
      _trend |   .0000323   .0000612     0.53   0.600    -.0000902    .0001548
       _cons |    .000104   .0026937     0.04   0.969    -.0052843    .0054923
------------------------------------------------------------------------------

. dfgls D.inflacion, notrend
 
DF-GLS for D.inflacion                                   Number of obs =    62
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11           -1.472           -2.610            -1.994            -1.696
    10           -1.851           -2.610            -2.012            -1.715
    9            -2.069           -2.610            -2.031            -1.735
    8            -1.919           -2.610            -2.052            -1.756
    7            -2.109           -2.610            -2.074            -1.778
    6            -1.897           -2.610            -2.096            -1.799
    5            -2.387           -2.610            -2.117            -1.820
    4            -3.903           -2.610            -2.139            -1.840
    3            -4.259           -2.610            -2.159            -1.859
    2            -4.496           -2.610            -2.178            -1.876
    1            -6.892           -2.610            -2.194            -1.892
 
Opt Lag (Ng-Perron seq t) =  5 with RMSE  .0097989
Min SC   = -8.942591 at lag  1 with RMSE  .0106962
Min MAIC = -7.845598 at lag 11 with RMSE  .0092366

. dfuller D.inflacion, lags(9) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =        64

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -3.917            -3.560            -2.919            -2.594
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0019

------------------------------------------------------------------------------
D2.inflacion |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   inflacion |
         LD. |  -2.844489   .7261711    -3.92   0.000    -4.301004   -1.387974
        LD2. |   1.558814   .6800058     2.29   0.026      .194895    2.922733
       L2D2. |   1.231939   .6280575     1.96   0.055    -.0277849    2.491663
       L3D2. |   1.116546   .5810775     1.92   0.060    -.0489477     2.28204
       L4D2. |   .8761088   .5296179     1.65   0.104    -.1861702    1.938388
       L5D2. |   .6710512   .4556507     1.47   0.147    -.2428685    1.584971
       L6D2. |   .7510377   .3778602     1.99   0.052    -.0068538    1.508929
       L7D2. |   .7027109   .3073276     2.29   0.026     .0862899    1.319132
       L8D2. |   .4213337   .2282076     1.85   0.070    -.0363927    .8790602
       L9D2. |   .2666708   .1399365     1.91   0.062    -.0140063    .5473479
             |
       _cons |   .0021968   .0013265     1.66   0.104    -.0004638    .0048575
------------------------------------------------------------------------------

. // Concluyo que inflacion es I(1) sin tendencia deterministica 
. // ADF para crec_m en niveles
. dfgls crec_m
 
DF-GLS for crec_m                                        Number of obs =    63
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11           -1.691           -3.675            -2.718            -2.442
    10           -2.721           -3.675            -2.761            -2.485
    9            -3.125           -3.675            -2.805            -2.528
    8            -2.277           -3.675            -2.849            -2.571
    7            -2.088           -3.675            -2.892            -2.612
    6            -1.989           -3.675            -2.934            -2.652
    5            -2.226           -3.675            -2.975            -2.689
    4            -2.927           -3.675            -3.013            -2.725
    3            -3.901           -3.675            -3.048            -2.757
    2            -3.992           -3.675            -3.079            -2.786
    1            -6.121           -3.675            -3.107            -2.811
 
Opt Lag (Ng-Perron seq t) = 11 with RMSE  .0323147
Min SC   = -6.316007 at lag  1 with RMSE  .0398048
Min MAIC = -5.543383 at lag  6 with RMSE  .0377345

. dfuller crec_m, lags(11) trend regress

Augmented Dickey-Fuller test for unit root         Number of obs   =        63

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.189            -4.121            -3.487            -3.172
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.4963

------------------------------------------------------------------------------
D.crec_m     |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      crec_m |
         L1. |  -.9031806   .4126911    -2.19   0.033    -1.732515   -.0738468
         LD. |   .0050277   .3763255     0.01   0.989    -.7512267    .7612821
        L2D. |  -.1166734   .3393568    -0.34   0.732    -.7986364    .5652896
        L3D. |   .1086208   .3191172     0.34   0.735    -.5326693     .749911
        L4D. |   .0942918   .3059648     0.31   0.759    -.5205676    .7091511
        L5D. |   .2156304    .295262     0.73   0.469    -.3777207    .8089816
        L6D. |   .2764313   .2863679     0.97   0.339    -.2990465    .8519092
        L7D. |   .3578061   .2725075     1.31   0.195    -.1898181    .9054304
        L8D. |   .1986717   .2557315     0.78   0.441    -.3152399    .7125834
        L9D. |   .0439522   .2342124     0.19   0.852    -.4267153    .5146197
       L10D. |  -.2524448   .1819106    -1.39   0.171    -.6180079    .1131183
       L11D. |  -.3463463   .1405406    -2.46   0.017    -.6287732   -.0639194
      _trend |    .000521   .0003183     1.64   0.108    -.0001187    .0011607
       _cons |   .0085574   .0126565     0.68   0.502    -.0168767    .0339915
------------------------------------------------------------------------------

. dfgls crec_m, notrend
 
DF-GLS for crec_m                                        Number of obs =    63
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11           -1.505           -2.610            -1.993            -1.695
    10           -2.400           -2.610            -2.011            -1.714
    9            -2.790           -2.610            -2.030            -1.734
    8            -2.070           -2.610            -2.051            -1.755
    7            -1.913           -2.610            -2.072            -1.776
    6            -1.833           -2.610            -2.094            -1.797
    5            -2.063           -2.610            -2.115            -1.818
    4            -2.735           -2.610            -2.136            -1.838
    3            -3.678           -2.610            -2.156            -1.856
    2            -3.806           -2.610            -2.174            -1.873
    1            -5.897           -2.610            -2.191            -1.888
 
Opt Lag (Ng-Perron seq t) = 11 with RMSE  .0325146
Min SC   = -6.288493 at lag  1 with RMSE  .0403562
Min MAIC =  -5.77321 at lag 11 with RMSE  .0325146

. dfuller crec_m, lags(11) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =        63

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -1.471            -3.562            -2.920            -2.595
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.5480

------------------------------------------------------------------------------
    D.crec_m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      crec_m |
         L1. |  -.4835231   .3287696    -1.47   0.148    -1.143876    .1768301
         LD. |   -.352458   .3115657    -1.13   0.263    -.9782561    .2733401
        L2D. |   -.422156   .2881455    -1.47   0.149    -1.000913    .1566013
        L3D. |  -.1461255   .2832295    -0.52   0.608    -.7150087    .4227577
        L4D. |  -.1407303   .2746788    -0.51   0.611     -.692439    .4109784
        L5D. |   .0034435   .2696986     0.01   0.990    -.5382621     .545149
        L6D. |   .0748294   .2628314     0.28   0.777     -.453083    .6027417
        L7D. |   .1681258   .2507461     0.67   0.506    -.3355125    .6717641
        L8D. |    .024668   .2364611     0.10   0.917     -.450278     .499614
        L9D. |  -.1092466   .2182727    -0.50   0.619    -.5476602    .3291669
       L10D. |  -.3653726   .1711221    -2.14   0.038    -.7090814   -.0216637
       L11D. |  -.4085538   .1375572    -2.97   0.005    -.6848456   -.1322619
             |
       _cons |   .0171944   .0116955     1.47   0.148    -.0062967    .0406855
------------------------------------------------------------------------------

. // ADF para crec_m en primeras diferencias
. dfgls D.crec_m
 
DF-GLS for D.crec_m                                      Number of obs =    62
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11           -1.766           -3.679            -2.715            -2.439
    10           -1.730           -3.679            -2.758            -2.482
    9            -1.915           -3.679            -2.803            -2.526
    8            -2.007           -3.679            -2.848            -2.569
    7            -1.862           -3.679            -2.892            -2.611
    6            -1.958           -3.679            -2.935            -2.652
    5            -2.352           -3.679            -2.976            -2.690
    4            -3.102           -3.679            -3.015            -2.726
    3            -3.928           -3.679            -3.050            -2.759
    2            -4.566           -3.679            -3.083            -2.789
    1            -8.294           -3.679            -3.110            -2.814
 
Opt Lag (Ng-Perron seq t) = 10 with RMSE  .0388018
Min SC   = -5.805911 at lag  8 with RMSE  .0406602
Min MAIC =  -4.90472 at lag 10 with RMSE  .0388018

. dfuller D.crec_m, lags(10) trend regress

Augmented Dickey-Fuller test for unit root         Number of obs   =        63

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.381            -4.121            -3.487            -3.172
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0023

------------------------------------------------------------------------------
D2.crec_m    |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    D.crec_m |
         L1. |  -5.415087   1.236001    -4.38   0.000    -7.897667   -2.932506
         LD. |   3.639714   1.195627     3.04   0.004     1.238227    6.041201
        L2D. |   2.849922   1.142064     2.50   0.016     .5560189    5.143826
        L3D. |     2.3765   1.062849     2.24   0.030     .2417051    4.511295
        L4D. |   1.940024   .9647419     2.01   0.050      .002283    3.877765
        L5D. |   1.670314   .8442605     1.98   0.053    -.0254336    3.366061
        L6D. |   1.492289   .7030913     2.12   0.039     .0800884    2.904489
        L7D. |   1.432482   .5527082     2.59   0.012      .322335    2.542629
        L8D. |   1.249748   .4051292     3.08   0.003     .4360225    2.063474
        L9D. |   .9652721   .2482012     3.89   0.000     .4667454    1.463799
       L10D. |   .4765344   .1320673     3.61   0.001     .2112694    .7417993
      _trend |   .0000882   .0002587     0.34   0.735    -.0004314    .0006079
       _cons |  -.0022809   .0118254    -0.19   0.848    -.0260328     .021471
------------------------------------------------------------------------------

. dfgls D.crec_m, notrend
 
DF-GLS for D.crec_m                                      Number of obs =    62
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11           -0.442           -2.610            -1.994            -1.696
    10           -0.569           -2.610            -2.012            -1.715
    9            -0.492           -2.610            -2.031            -1.735
    8            -0.487           -2.610            -2.052            -1.756
    7            -0.586           -2.610            -2.074            -1.778
    6            -0.704           -2.610            -2.096            -1.799
    5            -1.016           -2.610            -2.117            -1.820
    4            -1.450           -2.610            -2.139            -1.840
    3            -1.902           -2.610            -2.159            -1.859
    2            -2.362           -2.610            -2.178            -1.876
    1            -4.558           -2.610            -2.194            -1.892
 
Opt Lag (Ng-Perron seq t) = 11 with RMSE   .037988
Min SC   = -5.810415 at lag  8 with RMSE  .0405687
Min MAIC = -6.163466 at lag 11 with RMSE   .037988

. dfuller D.crec_m, lags(11) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =        62

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -3.825            -3.563            -2.920            -2.595
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0027

------------------------------------------------------------------------------
   D2.crec_m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      crec_m |
         LD. |  -5.607384   1.466124    -3.82   0.000     -8.55367   -2.661098
        LD2. |   3.820532   1.397147     2.73   0.009     1.012859    6.628204
       L2D2. |     3.0163   1.314088     2.30   0.026     .3755426    5.657058
       L3D2. |    2.54115   1.225226     2.07   0.043     .0789675    5.003333
       L4D2. |   2.104204   1.127453     1.87   0.068    -.1614972    4.369906
       L5D2. |   1.837087    1.01587     1.81   0.077    -.2043802    3.878554
       L6D2. |   1.660025   .8884142     1.87   0.068    -.1253097    3.445361
       L7D2. |   1.591588   .7440229     2.14   0.037      .096418    3.086758
       L8D2. |    1.39527   .5985365     2.33   0.024     .1924658    2.598074
       L9D2. |   1.088524   .4487345     2.43   0.019     .1867581     1.99029
      L10D2. |   .5632509   .2880371     1.96   0.056    -.0155814    1.142083
      L11D2. |   .0481559   .1499954     0.32   0.750    -.2532712    .3495829
             |
       _cons |   .0016689   .0048247     0.35   0.731    -.0080266    .0113644
------------------------------------------------------------------------------

. // Concluyo que crec_m es I(1) sin tendencia deterministica  
. 
. // Item "b"
. regress D.inflacion D.crec_m LD.crec_m L2D.crec_m L3D.crec_m L4D.crec_m L5D.crec_m L6D.cr
> ec_m

      Source |       SS           df       MS      Number of obs   =        68
-------------+----------------------------------   F(7, 60)        =      1.32
       Model |  .001010239         7   .00014432   Prob > F        =    0.2583
    Residual |  .006576519        60  .000109609   R-squared       =    0.1332
-------------+----------------------------------   Adj R-squared   =    0.0320
       Total |  .007586758        67  .000113235   Root MSE        =    .01047

------------------------------------------------------------------------------
 D.inflacion |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      crec_m |
         D1. |    .004713   .0328697     0.14   0.886    -.0610362    .0704623
         LD. |  -.0064249   .0406282    -0.16   0.875    -.0876934    .0748437
        L2D. |   .0307778   .0483811     0.64   0.527    -.0659988    .1275544
        L3D. |   .0784244     .04828     1.62   0.110      -.01815    .1749988
        L4D. |   .0188671   .0495168     0.38   0.705    -.0801814    .1179155
        L5D. |   .0073856   .0412684     0.18   0.859    -.0751635    .0899346
        L6D. |   .0199067   .0343702     0.58   0.565    -.0488439    .0886574
             |
       _cons |    .000671   .0012793     0.52   0.602    -.0018879    .0032299
------------------------------------------------------------------------------

. // El p-value asociado al estadistico F es mayor a 0.10. Por lo tanto, deberiamos descart
> ar esta estimacion.
. // Es decir, las diferencias de la tasa de crecimiento de la cantidad de dinero y sus 6 p
> rimeros rezagos no explican las diferencias en la tasa de inflacion 
. 
. // Item "c"
. estat dwatson

Durbin-Watson d-statistic(  8,    68) =  2.321174

. // El estadistico da 2.32 > 2. Por lo tanto, calculamos 4 - 2.32 = 1.68 para comparar 
. // con los valores criticos de la tabla. Como el dU es tambien 1.68, coincide con el esta
> dÃ­stico 
. // Tecnicamente, mirando con mas decimales, el estadistico cae en la region en donde el t
> est es inconcluso.
. 
. 
. log close
      name:  <unnamed>
       log:  /Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07
> /PRONOSTICOS/GUIAS-EXAMENES/PARCIAL2023/datos/PF_Parcial_2023_Sol.log
  log type:  text
 closed on:  26 Apr 2024, 15:43:11
-------------------------------------------------------------------------------------------
