--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANC
> IEROS/GUIAS-EXAMENES/TP2/tp2.log
  log type:  text
 opened on:   4 Jul 2024, 18:07:16

. 
. clear all

. set more off

. cd "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/G
> UIAS-EXAMENES/TP2"
/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/GUIAS-E
> XAMENES/TP2

. use TP2_Ejer_1, clear

. gen obs=_n

. tsmktim dia, start(01jan1986)
        time variable:  dia, 01jan1986 to 30dec2021
                delta:  1 day

. ************************************************************
. // r3m
. dfgls r3m
 
DF-GLS for r3m                                           Number of obs = 13107
Maxlag = 40 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    40           -1.864           -3.480            -2.836            -2.548
    39           -1.858           -3.480            -2.836            -2.548
    38           -1.838           -3.480            -2.836            -2.548
    37           -1.826           -3.480            -2.836            -2.548
    36           -1.845           -3.480            -2.836            -2.548
    35           -1.824           -3.480            -2.836            -2.548
    34           -1.711           -3.480            -2.836            -2.549
    33           -1.681           -3.480            -2.836            -2.549
    32           -1.725           -3.480            -2.836            -2.549
    31           -1.727           -3.480            -2.836            -2.549
    30           -1.718           -3.480            -2.837            -2.549
    29           -1.781           -3.480            -2.837            -2.549
    28           -1.786           -3.480            -2.837            -2.549
    27           -1.634           -3.480            -2.837            -2.549
    26           -1.618           -3.480            -2.837            -2.549
    25           -1.651           -3.480            -2.837            -2.549
    24           -1.636           -3.480            -2.837            -2.549
    23           -1.621           -3.480            -2.837            -2.550
    22           -1.646           -3.480            -2.837            -2.550
    21           -1.645           -3.480            -2.837            -2.550
    20           -1.541           -3.480            -2.838            -2.550
    19           -1.572           -3.480            -2.838            -2.550
    18           -1.581           -3.480            -2.838            -2.550
    17           -1.592           -3.480            -2.838            -2.550
    16           -1.594           -3.480            -2.838            -2.550
    15           -1.617           -3.480            -2.838            -2.550
    14           -1.620           -3.480            -2.838            -2.550
    13           -1.505           -3.480            -2.838            -2.550
    12           -1.482           -3.480            -2.838            -2.550
    11           -1.550           -3.480            -2.838            -2.551
    10           -1.573           -3.480            -2.839            -2.551
    9            -1.636           -3.480            -2.839            -2.551
    8            -1.666           -3.480            -2.839            -2.551
    7            -1.669           -3.480            -2.839            -2.551
    6            -1.618           -3.480            -2.839            -2.551
    5            -1.555           -3.480            -2.839            -2.551
    4            -1.693           -3.480            -2.839            -2.551
    3            -1.733           -3.480            -2.839            -2.551
    2            -1.681           -3.480            -2.839            -2.551
    1            -1.796           -3.480            -2.839            -2.551
 
Opt Lag (Ng-Perron seq t) = 35 with RMSE  .0418976
Min SC   = -6.319014 at lag 35 with RMSE  .0418976
Min MAIC = -6.339201 at lag 35 with RMSE  .0418976

. dfuller r3m, trend lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =     13112

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -1.877            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.6667

------------------------------------------------------------------------------
D.r3m        |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         r3m |
         L1. |  -.0004778   .0002546    -1.88   0.061    -.0009769    .0000213
         LD. |   .0962657   .0087287    11.03   0.000     .0791561    .1133753
        L2D. |  -.0516775   .0087687    -5.89   0.000    -.0688654   -.0344897
        L3D. |   .0241266   .0087775     2.75   0.006     .0069214    .0413317
        L4D. |  -.0104803     .00878    -1.19   0.233    -.0276905    .0067298
        L5D. |  -.0746054   .0087804    -8.50   0.000    -.0918163   -.0573944
        L6D. |   .0323697   .0087998     3.68   0.000     .0151209    .0496185
        L7D. |   .0082084   .0088043     0.93   0.351    -.0090493    .0254662
        L8D. |  -.0024108    .008774    -0.27   0.783    -.0196091    .0147875
        L9D. |  -.0001974   .0087735    -0.02   0.982    -.0173948        .017
       L10D. |  -.0397184   .0087725    -4.53   0.000    -.0569138    -.022523
       L11D. |  -.0109885    .008779    -1.25   0.211    -.0281966    .0062197
       L12D. |  -.0349791   .0087791    -3.98   0.000    -.0521875   -.0177707
       L13D. |   .0069734   .0087842     0.79   0.427     -.010245    .0241917
       L14D. |   .0586766   .0087839     6.68   0.000     .0414589    .0758944
       L15D. |  -.0028249   .0087866    -0.32   0.748    -.0200479    .0143981
       L16D. |  -.0040792   .0087825    -0.46   0.642    -.0212942    .0131357
       L17D. |   .0020533   .0087825     0.23   0.815    -.0151618    .0192683
       L18D. |  -.0087672   .0087822    -1.00   0.318    -.0259815    .0084471
       L19D. |   .0028892   .0087825     0.33   0.742    -.0143258    .0201041
       L20D. |  -.0245001   .0087822    -2.79   0.005    -.0417145   -.0072858
       L21D. |   .0530354   .0087822     6.04   0.000     .0358211    .0702498
       L22D. |  -.0006571   .0087794    -0.07   0.940    -.0178659    .0165518
       L23D. |  -.0058242   .0087793    -0.66   0.507    -.0230329    .0113845
       L24D. |   .0097722   .0087738     1.11   0.265    -.0074256    .0269701
       L25D. |   .0093491   .0087736     1.07   0.287    -.0078484    .0265466
       L26D. |  -.0150493   .0087669    -1.72   0.086    -.0322338    .0021351
       L27D. |   .0033658   .0087676     0.38   0.701      -.01382    .0205516
       L28D. |   .0802055   .0087676     9.15   0.000     .0630197    .0973913
       L29D. |   .0009213   .0087919     0.10   0.917    -.0163121    .0181548
       L30D. |   -.029306   .0087874    -3.33   0.001    -.0465306   -.0120814
       L31D. |   .0040534    .008767     0.46   0.644    -.0131313    .0212381
       L32D. |   .0009331   .0087666     0.11   0.915    -.0162507    .0181168
       L33D. |  -.0229615   .0087642    -2.62   0.009    -.0401407   -.0057823
       L34D. |   .0111158   .0087545     1.27   0.204    -.0060442    .0282759
       L35D. |   .0615887   .0087147     7.07   0.000     .0445066    .0786707
      _trend |  -2.34e-07   1.73e-07    -1.35   0.176    -5.72e-07    1.05e-07
       _cons |     .00253   .0018764     1.35   0.178    -.0011481    .0062081
------------------------------------------------------------------------------

. dfgls r3m, notrend
 
DF-GLS for r3m                                           Number of obs = 13107
Maxlag = 40 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    40            0.379           -2.580            -1.947            -1.623
    39            0.384           -2.580            -1.947            -1.623
    38            0.400           -2.580            -1.947            -1.623
    37            0.410           -2.580            -1.947            -1.623
    36            0.394           -2.580            -1.947            -1.624
    35            0.411           -2.580            -1.947            -1.624
    34            0.506           -2.580            -1.947            -1.624
    33            0.533           -2.580            -1.947            -1.624
    32            0.494           -2.580            -1.947            -1.624
    31            0.492           -2.580            -1.947            -1.624
    30            0.500           -2.580            -1.947            -1.624
    29            0.446           -2.580            -1.948            -1.624
    28            0.443           -2.580            -1.948            -1.624
    27            0.576           -2.580            -1.948            -1.624
    26            0.592           -2.580            -1.948            -1.624
    25            0.560           -2.580            -1.948            -1.624
    24            0.575           -2.580            -1.948            -1.624
    23            0.589           -2.580            -1.948            -1.624
    22            0.566           -2.580            -1.948            -1.624
    21            0.567           -2.580            -1.948            -1.624
    20            0.667           -2.580            -1.948            -1.624
    19            0.636           -2.580            -1.948            -1.624
    18            0.628           -2.580            -1.948            -1.625
    17            0.617           -2.580            -1.948            -1.625
    16            0.615           -2.580            -1.948            -1.625
    15            0.594           -2.580            -1.948            -1.625
    14            0.591           -2.580            -1.948            -1.625
    13            0.705           -2.580            -1.949            -1.625
    12            0.729           -2.580            -1.949            -1.625
    11            0.660           -2.580            -1.949            -1.625
    10            0.637           -2.580            -1.949            -1.625
    9             0.577           -2.580            -1.949            -1.625
    8             0.550           -2.580            -1.949            -1.625
    7             0.548           -2.580            -1.949            -1.625
    6             0.594           -2.580            -1.949            -1.625
    5             0.654           -2.580            -1.949            -1.625
    4             0.527           -2.580            -1.949            -1.625
    3             0.492           -2.580            -1.949            -1.625
    2             0.537           -2.580            -1.949            -1.625
    1             0.438           -2.580            -1.949            -1.625
 
Opt Lag (Ng-Perron seq t) = 35 with RMSE  .0419055
Min SC   = -6.318634 at lag 35 with RMSE  .0419055
Min MAIC = -6.339308 at lag 35 with RMSE  .0419055

. dfuller r3m,  lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =     13112

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -1.346            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.6077

------------------------------------------------------------------------------
       D.r3m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         r3m |
         L1. |  -.0001924   .0001429    -1.35   0.178    -.0004726    .0000877
         LD. |   .0961098   .0087283    11.01   0.000     .0790011    .1132184
        L2D. |  -.0518493    .008768    -5.91   0.000    -.0690359   -.0346627
        L3D. |    .023967    .008777     2.73   0.006     .0067629    .0411712
        L4D. |  -.0106442   .0087795    -1.21   0.225    -.0278532    .0065649
        L5D. |  -.0747682   .0087799    -8.52   0.000    -.0919781   -.0575584
        L6D. |   .0322217   .0087994     3.66   0.000     .0149736    .0494697
        L7D. |   .0080559   .0088039     0.92   0.360     -.009201    .0253128
        L8D. |  -.0025774   .0087734    -0.29   0.769    -.0197745    .0146197
        L9D. |  -.0003647    .008773    -0.04   0.967    -.0175609    .0168316
       L10D. |  -.0398827   .0087719    -4.55   0.000     -.057077   -.0226884
       L11D. |  -.0111488   .0087785    -1.27   0.204    -.0283559    .0060583
       L12D. |  -.0351396   .0087786    -4.00   0.000     -.052347   -.0179322
       L13D. |   .0068192   .0087838     0.78   0.438    -.0103982    .0240367
       L14D. |   .0585211   .0087834     6.66   0.000     .0413043    .0757379
       L15D. |  -.0029989    .008786    -0.34   0.733    -.0202207    .0142228
       L16D. |  -.0042493   .0087819    -0.48   0.628    -.0214631    .0129644
       L17D. |    .001883   .0087819     0.21   0.830    -.0153309    .0190968
       L18D. |  -.0089359   .0087816    -1.02   0.309     -.026149    .0082772
       L19D. |   .0027214   .0087819     0.31   0.757    -.0144923    .0199352
       L20D. |   -.024667   .0087816    -2.81   0.005    -.0418803   -.0074538
       L21D. |   .0528709   .0087816     6.02   0.000     .0356577    .0700842
       L22D. |  -.0008407   .0087786    -0.10   0.924     -.018048    .0163667
       L23D. |  -.0060087   .0087785    -0.68   0.494    -.0232158    .0111985
       L24D. |   .0095962   .0087731     1.09   0.274    -.0076002    .0267927
       L25D. |   .0091737   .0087729     1.05   0.296    -.0080225    .0263699
       L26D. |  -.0152188   .0087663    -1.74   0.083    -.0324021    .0019644
       L27D. |    .003199    .008767     0.36   0.715    -.0139857    .0203837
       L28D. |   .0800389    .008767     9.13   0.000     .0628543    .0972236
       L29D. |   .0007441   .0087913     0.08   0.933     -.016488    .0179763
       L30D. |    -.02949   .0087866    -3.36   0.001    -.0467131   -.0122669
       L31D. |   .0038876   .0087665     0.44   0.657     -.013296    .0210712
       L32D. |   .0007685    .008766     0.09   0.930    -.0164142    .0179512
       L33D. |  -.0231304   .0087636    -2.64   0.008    -.0403084   -.0059524
       L34D. |   .0109594    .008754     1.25   0.211    -.0061997    .0281185
       L35D. |   .0614136    .008714     7.05   0.000     .0443328    .0784943
             |
       _cons |   .0001104   .0005733     0.19   0.847    -.0010133    .0012341
------------------------------------------------------------------------------

. dfgls D.r3m
 
DF-GLS for D.r3m                                         Number of obs = 13106
Maxlag = 40 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    40           -4.172           -3.480            -2.836            -2.548
    39           -4.354           -3.480            -2.836            -2.548
    38           -4.445           -3.480            -2.836            -2.548
    37           -4.573           -3.480            -2.836            -2.548
    36           -4.689           -3.480            -2.836            -2.548
    35           -4.738           -3.480            -2.836            -2.548
    34           -4.885           -3.480            -2.836            -2.549
    33           -5.296           -3.480            -2.836            -2.549
    32           -5.520           -3.480            -2.836            -2.549
    31           -5.532           -3.480            -2.836            -2.549
    30           -5.669           -3.480            -2.837            -2.549
    29           -5.849           -3.480            -2.837            -2.549
    28           -5.809           -3.480            -2.837            -2.549
    27           -5.949           -3.480            -2.837            -2.549
    26           -6.649           -3.480            -2.837            -2.549
    25           -6.943           -3.480            -2.837            -2.549
    24           -7.050           -3.480            -2.837            -2.549
    23           -7.374           -3.480            -2.837            -2.550
    22           -7.726           -3.480            -2.837            -2.550
    21           -7.921           -3.480            -2.837            -2.550
    20           -8.254           -3.480            -2.838            -2.550
    19           -9.189           -3.480            -2.838            -2.550
    18           -9.476           -3.480            -2.838            -2.550
    17           -9.922           -3.480            -2.838            -2.550
    16          -10.398           -3.480            -2.838            -2.550
    15          -10.987           -3.480            -2.838            -2.550
    14          -11.494           -3.480            -2.838            -2.550
    13          -12.207           -3.480            -2.838            -2.550
    12          -14.065           -3.480            -2.838            -2.550
    11          -15.524           -3.480            -2.838            -2.551
    10          -16.251           -3.480            -2.839            -2.551
    9           -17.561           -3.480            -2.839            -2.551
    8           -18.609           -3.480            -2.839            -2.551
    7           -20.224           -3.480            -2.839            -2.551
    6           -22.547           -3.480            -2.839            -2.551
    5           -26.442           -3.480            -2.839            -2.551
    4           -32.317           -3.480            -2.839            -2.551
    3           -35.766           -3.480            -2.839            -2.551
    2           -42.994           -3.480            -2.839            -2.551
    1           -58.673           -3.480            -2.839            -2.551
 
Opt Lag (Ng-Perron seq t) = 40 with RMSE  .0422349
Min SC   = -6.299357 at lag 40 with RMSE  .0422349
Min MAIC = -6.313335 at lag 40 with RMSE  .0422349

. dfuller D.r3m, trend lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =     13106

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -15.596            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D2.r3m       |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       D.r3m |
         L1. |  -.8393737   .0538202   -15.60   0.000    -.9448692   -.7338782
         LD. |  -.0658032    .053301    -1.23   0.217    -.1702809    .0386744
        L2D. |   -.117494   .0527608    -2.23   0.026    -.2209128   -.0140752
        L3D. |  -.0939168   .0522069    -1.80   0.072    -.1962499    .0084164
        L4D. |  -.1050838   .0516375    -2.04   0.042    -.2063008   -.0038668
        L5D. |  -.1801089   .0510771    -3.53   0.000    -.2802274   -.0799904
        L6D. |   -.148743   .0505079    -2.94   0.003    -.2477458   -.0497403
        L7D. |  -.1410856    .049841    -2.83   0.005    -.2387812     -.04339
        L8D. |  -.1441854   .0491452    -2.93   0.003    -.2405171   -.0478537
        L9D. |   -.143924    .048475    -2.97   0.003    -.2389422   -.0489059
       L10D. |  -.1839816   .0477957    -3.85   0.000    -.2776681   -.0902951
       L11D. |  -.1957094    .047108    -4.15   0.000     -.288048   -.1033709
       L12D. |  -.2309842   .0464588    -4.97   0.000    -.3220503   -.1399181
       L13D. |  -.2259094   .0458104    -4.93   0.000    -.3157044   -.1361143
       L14D. |  -.1677289   .0450195    -3.73   0.000    -.2559737   -.0794841
       L15D. |  -.1707872   .0441923    -3.86   0.000    -.2574104   -.0841639
       L16D. |  -.1741347    .043376    -4.01   0.000    -.2591579   -.0891115
       L17D. |  -.1727745   .0425307    -4.06   0.000    -.2561408   -.0894082
       L18D. |  -.1819086   .0416499    -4.37   0.000    -.2635485   -.1002687
       L19D. |  -.1794259   .0407635    -4.40   0.000    -.2593282   -.0995235
       L20D. |  -.2056951   .0398603    -5.16   0.000     -.283827   -.1275631
       L21D. |  -.1521258   .0388377    -3.92   0.000    -.2282533   -.0759983
       L22D. |   -.152957    .037823    -4.04   0.000    -.2270955   -.0788185
       L23D. |  -.1579426   .0367748    -4.29   0.000    -.2300266   -.0858587
       L24D. |   -.148478   .0357184    -4.16   0.000    -.2184914   -.0784647
       L25D. |  -.1402969   .0346244    -4.05   0.000    -.2081657   -.0724281
       L26D. |  -.1555217   .0334991    -4.64   0.000    -.2211848   -.0898586
       L27D. |  -.1542407   .0323473    -4.77   0.000    -.2176461   -.0908352
       L28D. |  -.0740772   .0310045    -2.39   0.017    -.1348505    -.013304
       L29D. |  -.0724664   .0295679    -2.45   0.014    -.1304238    -.014509
       L30D. |  -.1023393   .0281582    -3.63   0.000    -.1575334   -.0471452
       L31D. |  -.0962307   .0267155    -3.60   0.000    -.1485969   -.0438645
       L32D. |  -.0963887   .0253099    -3.81   0.000    -.1459999   -.0467775
       L33D. |  -.1196956    .023819    -5.03   0.000    -.1663843   -.0730069
       L34D. |  -.1069201   .0222495    -4.81   0.000    -.1505323   -.0633079
       L35D. |  -.0480647   .0205287    -2.34   0.019     -.088304   -.0078254
       L36D. |  -.0341857   .0185035    -1.85   0.065    -.0704553    .0020838
       L37D. |  -.0440929   .0165662    -2.66   0.008    -.0765651   -.0116207
       L38D. |  -.0395278   .0144281    -2.74   0.006     -.067809   -.0112465
       L39D. |  -.0279029   .0117694    -2.37   0.018    -.0509727   -.0048331
       L40D. |  -.0275877   .0087268    -3.16   0.002    -.0446935   -.0104819
      _trend |   3.66e-08   9.69e-08     0.38   0.705    -1.53e-07    2.26e-07
       _cons |  -.0007089   .0007375    -0.96   0.336    -.0021545    .0007368
------------------------------------------------------------------------------

. dfgls D.r3m, notrend
 
DF-GLS for D.r3m                                         Number of obs = 13106
Maxlag = 40 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    40           -2.065           -2.580            -1.947            -1.623
    39           -2.164           -2.580            -1.947            -1.623
    38           -2.214           -2.580            -1.947            -1.623
    37           -2.284           -2.580            -1.947            -1.623
    36           -2.348           -2.580            -1.947            -1.624
    35           -2.376           -2.580            -1.947            -1.624
    34           -2.456           -2.580            -1.947            -1.624
    33           -2.678           -2.580            -1.947            -1.624
    32           -2.800           -2.580            -1.947            -1.624
    31           -2.808           -2.580            -1.947            -1.624
    30           -2.884           -2.580            -1.947            -1.624
    29           -2.982           -2.580            -1.948            -1.624
    28           -2.963           -2.580            -1.948            -1.624
    27           -3.041           -2.580            -1.948            -1.624
    26           -3.416           -2.580            -1.948            -1.624
    25           -3.576           -2.580            -1.948            -1.624
    24           -3.638           -2.580            -1.948            -1.624
    23           -3.815           -2.580            -1.948            -1.624
    22           -4.008           -2.580            -1.948            -1.624
    21           -4.118           -2.580            -1.948            -1.624
    20           -4.303           -2.580            -1.948            -1.624
    19           -4.809           -2.580            -1.948            -1.624
    18           -4.973           -2.580            -1.948            -1.625
    17           -5.224           -2.580            -1.948            -1.625
    16           -5.493           -2.580            -1.948            -1.625
    15           -5.825           -2.580            -1.948            -1.625
    14           -6.117           -2.580            -1.948            -1.625
    13           -6.523           -2.580            -1.949            -1.625
    12           -7.554           -2.580            -1.949            -1.625
    11           -8.387           -2.580            -1.949            -1.625
    10           -8.838           -2.580            -1.949            -1.625
    9            -9.621           -2.580            -1.949            -1.625
    8           -10.280           -2.580            -1.949            -1.625
    7           -11.277           -2.580            -1.949            -1.625
    6           -12.709           -2.580            -1.949            -1.625
    5           -15.104           -2.580            -1.949            -1.625
    4           -18.789           -2.580            -1.949            -1.625
    3           -21.323           -2.580            -1.949            -1.625
    2           -26.402           -2.580            -1.949            -1.625
    1           -37.503           -2.580            -1.949            -1.625
 
Opt Lag (Ng-Perron seq t) = 40 with RMSE   .042256
Min SC   =  -6.29836 at lag 40 with RMSE   .042256
Min MAIC = -6.320807 at lag 40 with RMSE   .042256

. dfuller D.r3m, lags(`r(optlag)') regress 

Augmented Dickey-Fuller test for unit root         Number of obs   =     13106

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -15.592            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
      D2.r3m |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         r3m |
         LD. |  -.8389046   .0538042   -15.59   0.000    -.9443686   -.7334406
        LD2. |  -.0662604   .0532855    -1.24   0.214    -.1707077     .038187
       L2D2. |  -.1179402   .0527458    -2.24   0.025    -.2213297   -.0145506
       L3D2. |  -.0943513   .0521925    -1.81   0.071    -.1966563    .0079537
       L4D2. |  -.1055067   .0516237    -2.04   0.041    -.2066966   -.0043168
       L5D2. |  -.1805212   .0510637    -3.54   0.000    -.2806136   -.0804289
       L6D2. |  -.1491446    .050495    -2.95   0.003    -.2481222    -.050167
       L7D2. |  -.1414765   .0498286    -2.84   0.005    -.2391479   -.0438051
       L8D2. |  -.1445654   .0491333    -2.94   0.003    -.2408738    -.048257
       L9D2. |  -.1442939   .0484636    -2.98   0.003    -.2392895   -.0492982
      L10D2. |  -.1843412   .0477846    -3.86   0.000     -.278006   -.0906764
      L11D2. |  -.1960585   .0470974    -4.16   0.000    -.2883763   -.1037407
      L12D2. |  -.2313222   .0464487    -4.98   0.000    -.3223684   -.1402759
      L13D2. |  -.2262357   .0458008    -4.94   0.000    -.3160119   -.1364595
      L14D2. |  -.1680442   .0450103    -3.73   0.000     -.256271   -.0798174
      L15D2. |  -.1710916   .0441835    -3.87   0.000    -.2576977   -.0844856
      L16D2. |  -.1744284   .0433676    -4.02   0.000    -.2594352   -.0894216
      L17D2. |   -.173057   .0425227    -4.07   0.000    -.2564077   -.0897063
      L18D2. |    -.18218   .0416423    -4.37   0.000     -.263805   -.1005549
      L19D2. |  -.1796862   .0407563    -4.41   0.000    -.2595745   -.0997979
      L20D2. |  -.2059437   .0398536    -5.17   0.000    -.2840625    -.127825
      L21D2. |   -.152362   .0388314    -3.92   0.000    -.2284771   -.0762468
      L22D2. |  -.1531805   .0378171    -4.05   0.000    -.2273076   -.0790535
      L23D2. |  -.1581536   .0367693    -4.30   0.000    -.2302268   -.0860803
      L24D2. |  -.1486766   .0357134    -4.16   0.000    -.2186801   -.0786731
      L25D2. |  -.1404833   .0346197    -4.06   0.000     -.208343   -.0726236
      L26D2. |  -.1556963   .0334948    -4.65   0.000     -.221351   -.0900416
      L27D2. |  -.1544022   .0323434    -4.77   0.000       -.2178   -.0910044
      L28D2. |  -.0742245    .031001    -2.39   0.017    -.1349909    -.013458
      L29D2. |  -.0726004   .0295648    -2.46   0.014    -.1305517    -.014649
      L30D2. |  -.1024606   .0281554    -3.64   0.000    -.1576493   -.0472719
      L31D2. |  -.0963394    .026713    -3.61   0.000    -.1487008   -.0439779
      L32D2. |  -.0964849   .0253078    -3.81   0.000     -.146092   -.0468779
      L33D2. |  -.1197797   .0238172    -5.03   0.000    -.1664648   -.0730946
      L34D2. |  -.1069918   .0222479    -4.81   0.000     -.150601   -.0633827
      L35D2. |  -.0481254   .0205274    -2.34   0.019    -.0883622   -.0078887
      L36D2. |  -.0342355   .0185024    -1.85   0.064    -.0705029    .0020319
      L37D2. |  -.0441328   .0165653    -2.66   0.008    -.0766033   -.0116624
      L38D2. |  -.0395578   .0144275    -2.74   0.006    -.0678377   -.0112779
      L39D2. |  -.0279229   .0117689    -2.37   0.018    -.0509917    -.004854
      L40D2. |  -.0275979   .0087265    -3.16   0.002     -.044703   -.0104927
             |
       _cons |  -.0004672   .0003676    -1.27   0.204    -.0011877    .0002533
------------------------------------------------------------------------------

. // r1y
. dfgls r1y
 
DF-GLS for r1y                                           Number of obs = 13107
Maxlag = 40 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    40           -2.213           -3.480            -2.836            -2.548
    39           -2.191           -3.480            -2.836            -2.548
    38           -2.186           -3.480            -2.836            -2.548
    37           -2.159           -3.480            -2.836            -2.548
    36           -2.168           -3.480            -2.836            -2.548
    35           -2.186           -3.480            -2.836            -2.548
    34           -2.150           -3.480            -2.836            -2.549
    33           -2.124           -3.480            -2.836            -2.549
    32           -2.124           -3.480            -2.836            -2.549
    31           -2.115           -3.480            -2.836            -2.549
    30           -2.055           -3.480            -2.837            -2.549
    29           -2.032           -3.480            -2.837            -2.549
    28           -2.022           -3.480            -2.837            -2.549
    27           -1.952           -3.480            -2.837            -2.549
    26           -1.917           -3.480            -2.837            -2.549
    25           -1.918           -3.480            -2.837            -2.549
    24           -1.915           -3.480            -2.837            -2.549
    23           -1.896           -3.480            -2.837            -2.550
    22           -1.858           -3.480            -2.837            -2.550
    21           -1.867           -3.480            -2.837            -2.550
    20           -1.799           -3.480            -2.838            -2.550
    19           -1.777           -3.480            -2.838            -2.550
    18           -1.767           -3.480            -2.838            -2.550
    17           -1.781           -3.480            -2.838            -2.550
    16           -1.775           -3.480            -2.838            -2.550
    15           -1.775           -3.480            -2.838            -2.550
    14           -1.782           -3.480            -2.838            -2.550
    13           -1.694           -3.480            -2.838            -2.550
    12           -1.687           -3.480            -2.838            -2.550
    11           -1.705           -3.480            -2.838            -2.551
    10           -1.681           -3.480            -2.839            -2.551
    9            -1.711           -3.480            -2.839            -2.551
    8            -1.679           -3.480            -2.839            -2.551
    7            -1.652           -3.480            -2.839            -2.551
    6            -1.642           -3.480            -2.839            -2.551
    5            -1.613           -3.480            -2.839            -2.551
    4            -1.649           -3.480            -2.839            -2.551
    3            -1.683           -3.480            -2.839            -2.551
    2            -1.622           -3.480            -2.839            -2.551
    1            -1.635           -3.480            -2.839            -2.551
 
Opt Lag (Ng-Perron seq t) = 35 with RMSE  .0391849
Min SC   = -6.466743 at lag  1 with RMSE  .0393958
Min MAIC = -6.473081 at lag 31 with RMSE  .0391933

. dfuller r1y, trend lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =     13112

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.214            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.4818

------------------------------------------------------------------------------
D.r1y        |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         r1y |
         L1. |  -.0005422   .0002448    -2.21   0.027    -.0010221   -.0000622
         LD. |   .0615902   .0087432     7.04   0.000     .0444522    .0787281
        L2D. |  -.0092767    .008761    -1.06   0.290    -.0264496    .0078962
        L3D. |   .0319163   .0087613     3.64   0.000     .0147429    .0490898
        L4D. |  -.0176956   .0087657    -2.02   0.044    -.0348777   -.0005135
        L5D. |  -.0247476   .0087639    -2.82   0.005    -.0419262   -.0075691
        L6D. |   .0140888    .008765     1.61   0.108    -.0030919    .0312695
        L7D. |   .0005336   .0087658     0.06   0.951    -.0166486    .0177158
        L8D. |   .0118516   .0087605     1.35   0.176    -.0053203    .0290236
        L9D. |   .0206659     .00876     2.36   0.018     .0034951    .0378367
       L10D. |  -.0186645   .0087613    -2.13   0.033    -.0358379   -.0014911
       L11D. |   .0114804   .0087628     1.31   0.190     -.005696    .0286568
       L12D. |  -.0104886    .008763    -1.20   0.231    -.0276653    .0066881
       L13D. |  -.0000657    .008762    -0.01   0.994    -.0172405    .0171091
       L14D. |   .0449802   .0087611     5.13   0.000     .0278071    .0621532
       L15D. |  -.0040901   .0087648    -0.47   0.641    -.0212704    .0130902
       L16D. |  -7.99e-06   .0087645    -0.00   0.999    -.0171876    .0171717
       L17D. |   .0026371   .0087644     0.30   0.764    -.0145424    .0198166
       L18D. |  -.0082711   .0087641    -0.94   0.345    -.0254499    .0089077
       L19D. |   .0049163   .0087643     0.56   0.575    -.0122631    .0220957
       L20D. |   .0083857   .0087644     0.96   0.339    -.0087938    .0255652
       L21D. |   .0346986   .0087638     3.96   0.000     .0175202     .051877
       L22D. |  -.0065862   .0087596    -0.75   0.452    -.0237562    .0105839
       L23D. |   .0185991   .0087599     2.12   0.034     .0014284    .0357698
       L24D. |    .010032   .0087601     1.15   0.252    -.0071391    .0272032
       L25D. |   .0011756     .00876     0.13   0.893    -.0159954    .0183465
       L26D. |   -.000795   .0087584    -0.09   0.928    -.0179627    .0163728
       L27D. |   .0159216   .0087559     1.82   0.069    -.0012412    .0330843
       L28D. |   .0334218   .0087547     3.82   0.000     .0162614    .0505822
       L29D. |   .0054968   .0087553     0.63   0.530    -.0116649    .0226585
       L30D. |    .010747   .0087542     1.23   0.220    -.0064125    .0279065
       L31D. |   .0273954   .0087522     3.13   0.002     .0102398     .044551
       L32D. |   .0034739   .0087543     0.40   0.692    -.0136859    .0206337
       L33D. |  -.0009708   .0087501    -0.11   0.912    -.0181223    .0161806
       L34D. |   .0115151   .0087496     1.32   0.188    -.0056354    .0286656
       L35D. |   .0163331   .0087339     1.87   0.061    -.0007867    .0334529
      _trend |  -2.89e-07   1.71e-07    -1.69   0.090    -6.23e-07    4.54e-08
       _cons |   .0033401   .0019041     1.75   0.079    -.0003922    .0070725
------------------------------------------------------------------------------

. dfgls r1y, notrend
 
DF-GLS for r1y                                           Number of obs = 13107
Maxlag = 40 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    40            0.153           -2.580            -1.947            -1.623
    39            0.168           -2.580            -1.947            -1.623
    38            0.171           -2.580            -1.947            -1.623
    37            0.189           -2.580            -1.947            -1.623
    36            0.183           -2.580            -1.947            -1.624
    35            0.171           -2.580            -1.947            -1.624
    34            0.195           -2.580            -1.947            -1.624
    33            0.213           -2.580            -1.947            -1.624
    32            0.213           -2.580            -1.947            -1.624
    31            0.219           -2.580            -1.947            -1.624
    30            0.262           -2.580            -1.947            -1.624
    29            0.278           -2.580            -1.948            -1.624
    28            0.285           -2.580            -1.948            -1.624
    27            0.336           -2.580            -1.948            -1.624
    26            0.363           -2.580            -1.948            -1.624
    25            0.362           -2.580            -1.948            -1.624
    24            0.364           -2.580            -1.948            -1.624
    23            0.380           -2.580            -1.948            -1.624
    22            0.409           -2.580            -1.948            -1.624
    21            0.402           -2.580            -1.948            -1.624
    20            0.456           -2.580            -1.948            -1.624
    19            0.475           -2.580            -1.948            -1.624
    18            0.483           -2.580            -1.948            -1.625
    17            0.472           -2.580            -1.948            -1.625
    16            0.477           -2.580            -1.948            -1.625
    15            0.477           -2.580            -1.948            -1.625
    14            0.471           -2.580            -1.948            -1.625
    13            0.547           -2.580            -1.949            -1.625
    12            0.553           -2.580            -1.949            -1.625
    11            0.538           -2.580            -1.949            -1.625
    10            0.559           -2.580            -1.949            -1.625
    9             0.532           -2.580            -1.949            -1.625
    8             0.561           -2.580            -1.949            -1.625
    7             0.586           -2.580            -1.949            -1.625
    6             0.595           -2.580            -1.949            -1.625
    5             0.622           -2.580            -1.949            -1.625
    4             0.589           -2.580            -1.949            -1.625
    3             0.558           -2.580            -1.949            -1.625
    2             0.613           -2.580            -1.949            -1.625
    1             0.602           -2.580            -1.949            -1.625
 
Opt Lag (Ng-Perron seq t) = 35 with RMSE  .0391939
Min SC   = -6.466389 at lag  1 with RMSE  .0394028
Min MAIC = -6.473319 at lag 31 with RMSE   .039202

. dfuller r1y,  lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =     13112

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -1.467            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.5499

------------------------------------------------------------------------------
       D.r1y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         r1y |
         L1. |  -.0001908   .0001301    -1.47   0.142    -.0004458    .0000642
         LD. |   .0614538   .0087435     7.03   0.000     .0443153    .0785923
        L2D. |  -.0094264   .0087612    -1.08   0.282    -.0265996    .0077469
        L3D. |   .0317692   .0087615     3.63   0.000     .0145954     .048943
        L4D. |  -.0178502   .0087659    -2.04   0.042    -.0350326   -.0006678
        L5D. |  -.0249058   .0087641    -2.84   0.004    -.0420846   -.0077269
        L6D. |    .013932   .0087651     1.59   0.112     -.003249    .0311129
        L7D. |   .0003724   .0087659     0.04   0.966      -.01681    .0175548
        L8D. |   .0116832   .0087606     1.33   0.182    -.0054888    .0288553
        L9D. |   .0204901     .00876     2.34   0.019     .0033193    .0376609
       L10D. |  -.0188453   .0087613    -2.15   0.031    -.0360186   -.0016719
       L11D. |   .0113034   .0087628     1.29   0.197     -.005873    .0284798
       L12D. |  -.0106705    .008763    -1.22   0.223    -.0278471    .0065062
       L13D. |  -.0002507   .0087619    -0.03   0.977    -.0174253     .016924
       L14D. |   .0447965   .0087611     5.11   0.000     .0276235    .0619695
       L15D. |  -.0042935   .0087646    -0.49   0.624    -.0214734    .0128864
       L16D. |   -.000213   .0087643    -0.02   0.981    -.0173922    .0169663
       L17D. |    .002431   .0087642     0.28   0.781    -.0147481      .01961
       L18D. |  -.0084758   .0087639    -0.97   0.333    -.0256542    .0087027
       L19D. |    .004713   .0087641     0.54   0.591     -.012466     .021892
       L20D. |   .0081817   .0087642     0.93   0.351    -.0089974    .0253608
       L21D. |   .0344925   .0087636     3.94   0.000     .0173145    .0516705
       L22D. |  -.0068136   .0087592    -0.78   0.437    -.0239829    .0103557
       L23D. |   .0183721   .0087595     2.10   0.036     .0012022     .035542
       L24D. |   .0098066   .0087597     1.12   0.263    -.0073638     .026977
       L25D. |   .0009451   .0087596     0.11   0.914     -.016225    .0181152
       L26D. |  -.0010207    .008758    -0.12   0.907    -.0181877    .0161463
       L27D. |   .0156917   .0087554     1.79   0.073    -.0014703    .0328536
       L28D. |   .0331871   .0087542     3.79   0.000     .0160276    .0503466
       L29D. |   .0052581   .0087548     0.60   0.548    -.0119026    .0224189
       L30D. |   .0105031   .0087536     1.20   0.230    -.0066553    .0276615
       L31D. |   .0271571   .0087517     3.10   0.002     .0100025    .0443117
       L32D. |   .0032354   .0087538     0.37   0.712    -.0139234    .0203942
       L33D. |  -.0012187   .0087495    -0.14   0.889     -.018369    .0159316
       L34D. |   .0112707    .008749     1.29   0.198    -.0058787    .0284201
       L35D. |   .0160678   .0087332     1.84   0.066    -.0010504    .0331861
             |
       _cons |   .0002553   .0005557     0.46   0.646    -.0008339    .0013445
------------------------------------------------------------------------------

. dfgls D.r1y
 
DF-GLS for D.r1y                                         Number of obs = 13106
Maxlag = 40 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    40           -5.057           -3.480            -2.836            -2.548
    39           -5.244           -3.480            -2.836            -2.548
    38           -5.380           -3.480            -2.836            -2.548
    37           -5.480           -3.480            -2.836            -2.548
    36           -5.639           -3.480            -2.836            -2.548
    35           -5.715           -3.480            -2.836            -2.548
    34           -5.771           -3.480            -2.836            -2.549
    33           -5.967           -3.480            -2.836            -2.549
    32           -6.154           -3.480            -2.836            -2.549
    31           -6.275           -3.480            -2.836            -2.549
    30           -6.426           -3.480            -2.837            -2.549
    29           -6.744           -3.480            -2.837            -2.549
    28           -6.968           -3.480            -2.837            -2.549
    27           -7.165           -3.480            -2.837            -2.549
    26           -7.590           -3.480            -2.837            -2.549
    25           -7.933           -3.480            -2.837            -2.549
    24           -8.157           -3.480            -2.837            -2.549
    23           -8.410           -3.480            -2.837            -2.550
    22           -8.758           -3.480            -2.837            -2.550
    21           -9.221           -3.480            -2.837            -2.550
    20           -9.503           -3.480            -2.838            -2.550
    19          -10.212           -3.480            -2.838            -2.550
    18          -10.761           -3.480            -2.838            -2.550
    17          -11.291           -3.480            -2.838            -2.550
    16          -11.721           -3.480            -2.838            -2.550
    15          -12.329           -3.480            -2.838            -2.550
    14          -12.953           -3.480            -2.838            -2.550
    13          -13.599           -3.480            -2.838            -2.550
    12          -15.120           -3.480            -2.838            -2.550
    11          -16.200           -3.480            -2.838            -2.551
    10          -17.190           -3.480            -2.839            -2.551
    9           -18.774           -3.480            -2.839            -2.551
    8           -20.015           -3.480            -2.839            -2.551
    7           -22.281           -3.480            -2.839            -2.551
    6           -25.054           -3.480            -2.839            -2.551
    5           -28.310           -3.480            -2.839            -2.551
    4           -33.046           -3.480            -2.839            -2.551
    3           -37.959           -3.480            -2.839            -2.551
    2           -44.904           -3.480            -2.839            -2.551
    1           -59.973           -3.480            -2.839            -2.551
 
Opt Lag (Ng-Perron seq t) = 40 with RMSE  .0394574
Min SC   = -6.436393 at lag 34 with RMSE  .0395237
Min MAIC = -6.442457 at lag 40 with RMSE  .0394574

. dfuller D.r1y, trend lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =     13106

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -14.649            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D2.r1y       |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       D.r1y |
         L1. |  -.6854536   .0467906   -14.65   0.000    -.7771701   -.5937372
         LD. |  -.2537706   .0464612    -5.46   0.000    -.3448413   -.1626999
        L2D. |  -.2632367    .046089    -5.71   0.000    -.3535778   -.1728956
        L3D. |  -.2310461   .0457161    -5.05   0.000    -.3206563    -.141436
        L4D. |  -.2485725   .0453128    -5.49   0.000    -.3373923   -.1597528
        L5D. |  -.2730955   .0449208    -6.08   0.000    -.3611469   -.1850442
        L6D. |  -.2594511   .0445447    -5.82   0.000    -.3467652    -.172137
        L7D. |  -.2590107   .0441391    -5.87   0.000    -.3455297   -.1724918
        L8D. |   -.247325   .0437148    -5.66   0.000    -.3330123   -.1616378
        L9D. |  -.2273995   .0432823    -5.25   0.000     -.312239     -.14256
       L10D. |   -.247179    .042834    -5.77   0.000    -.3311399    -.163218
       L11D. |   -.236266   .0423523    -5.58   0.000    -.3192827   -.1532494
       L12D. |  -.2472845   .0418456    -5.91   0.000    -.3293079   -.1652611
       L13D. |  -.2482545   .0413307    -6.01   0.000    -.3292687   -.1672404
       L14D. |  -.2038635   .0407588    -5.00   0.000    -.2837568   -.1239703
       L15D. |  -.2078409   .0401369    -5.18   0.000     -.286515   -.1291668
       L16D. |  -.2078397   .0395085    -5.26   0.000    -.2852822   -.1303972
       L17D. |  -.2060831   .0388689    -5.30   0.000    -.2822718   -.1298944
       L18D. |  -.2154324   .0382023    -5.64   0.000    -.2903145   -.1405503
       L19D. |  -.2112278   .0374958    -5.63   0.000    -.2847249   -.1377306
       L20D. |  -.2039969   .0367864    -5.55   0.000    -.2761036   -.1318902
       L21D. |  -.1698528   .0359961    -4.72   0.000    -.2404104   -.0992952
       L22D. |  -.1757208   .0351592    -5.00   0.000    -.2446379   -.1068038
       L23D. |  -.1563857   .0342962    -4.56   0.000    -.2236112   -.0891601
       L24D. |  -.1473668   .0334233    -4.41   0.000    -.2128814   -.0818522
       L25D. |  -.1472468   .0325206    -4.53   0.000    -.2109918   -.0835017
       L26D. |  -.1489707   .0315912    -4.72   0.000    -.2108942   -.0870473
       L27D. |  -.1346107   .0306432    -4.39   0.000    -.1946758   -.0745455
       L28D. |  -.1015095   .0295543    -3.43   0.001    -.1594403   -.0435787
       L29D. |  -.0972484   .0284168    -3.42   0.001    -.1529496   -.0415473
       L30D. |  -.0880065   .0272622    -3.23   0.001    -.1414443   -.0345686
       L31D. |  -.0602194    .026024    -2.31   0.021    -.1112303   -.0092086
       L32D. |  -.0575697    .024774    -2.32   0.020    -.1061304   -.0090091
       L33D. |  -.0580515   .0233968    -2.48   0.013    -.1039126   -.0121904
       L34D. |  -.0466509   .0218971    -2.13   0.033    -.0895723   -.0037294
       L35D. |  -.0309985   .0202877    -1.53   0.127    -.0707654    .0087684
       L36D. |  -.0381125   .0184859    -2.06   0.039    -.0743476   -.0018775
       L37D. |  -.0429658   .0165962    -2.59   0.010    -.0754968   -.0104347
       L38D. |  -.0318204   .0145453    -2.19   0.029    -.0603314   -.0033094
       L39D. |  -.0301872   .0119657    -2.52   0.012    -.0536417   -.0067326
       L40D. |  -.0216506   .0087289    -2.48   0.013    -.0387605   -.0045406
      _trend |   3.33e-08   9.06e-08     0.37   0.714    -1.44e-07    2.11e-07
       _cons |  -.0005971   .0006899    -0.87   0.387    -.0019494    .0007551
------------------------------------------------------------------------------

. dfgls D.r1y, notrend
 
DF-GLS for D.r1y                                         Number of obs = 13106
Maxlag = 40 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    40           -2.632           -2.580            -1.947            -1.623
    39           -2.734           -2.580            -1.947            -1.623
    38           -2.808           -2.580            -1.947            -1.623
    37           -2.864           -2.580            -1.947            -1.623
    36           -2.951           -2.580            -1.947            -1.624
    35           -2.995           -2.580            -1.947            -1.624
    34           -3.028           -2.580            -1.947            -1.624
    33           -3.136           -2.580            -1.947            -1.624
    32           -3.238           -2.580            -1.947            -1.624
    31           -3.306           -2.580            -1.947            -1.624
    30           -3.390           -2.580            -1.947            -1.624
    29           -3.564           -2.580            -1.948            -1.624
    28           -3.689           -2.580            -1.948            -1.624
    27           -3.799           -2.580            -1.948            -1.624
    26           -4.034           -2.580            -1.948            -1.624
    25           -4.225           -2.580            -1.948            -1.624
    24           -4.352           -2.580            -1.948            -1.624
    23           -4.497           -2.580            -1.948            -1.624
    22           -4.694           -2.580            -1.948            -1.624
    21           -4.954           -2.580            -1.948            -1.624
    20           -5.119           -2.580            -1.948            -1.624
    19           -5.516           -2.580            -1.948            -1.624
    18           -5.830           -2.580            -1.948            -1.625
    17           -6.137           -2.580            -1.948            -1.625
    16           -6.394           -2.580            -1.948            -1.625
    15           -6.751           -2.580            -1.948            -1.625
    14           -7.121           -2.580            -1.948            -1.625
    13           -7.510           -2.580            -1.949            -1.625
    12           -8.391           -2.580            -1.949            -1.625
    11           -9.044           -2.580            -1.949            -1.625
    10           -9.662           -2.580            -1.949            -1.625
    9           -10.633           -2.580            -1.949            -1.625
    8           -11.437           -2.580            -1.949            -1.625
    7           -12.861           -2.580            -1.949            -1.625
    6           -14.640           -2.580            -1.949            -1.625
    5           -16.797           -2.580            -1.949            -1.625
    4           -19.982           -2.580            -1.949            -1.625
    3           -23.533           -2.580            -1.949            -1.625
    2           -28.723           -2.580            -1.949            -1.625
    1           -39.961           -2.580            -1.949            -1.625
 
Opt Lag (Ng-Perron seq t) = 40 with RMSE  .0394854
Min SC   = -6.434554 at lag 34 with RMSE    .03956
Min MAIC =  -6.45554 at lag 40 with RMSE  .0394854

. dfuller D.r1y, lags(`r(optlag)') regress 

Augmented Dickey-Fuller test for unit root         Number of obs   =     13106

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -14.645            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
      D2.r1y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         r1y |
         LD. |  -.6850708   .0467775   -14.65   0.000    -.7767614   -.5933801
        LD2. |  -.2541423   .0464486    -5.47   0.000    -.3451883   -.1630962
       L2D2. |  -.2635982   .0460769    -5.72   0.000    -.3539157   -.1732807
       L3D2. |  -.2313972   .0457046    -5.06   0.000    -.3209848   -.1418096
       L4D2. |  -.2489134   .0453018    -5.49   0.000    -.3377116   -.1601152
       L5D2. |  -.2734279   .0449102    -6.09   0.000    -.3614585   -.1853973
       L6D2. |  -.2597751   .0445345    -5.83   0.000    -.3470692   -.1724811
       L7D2. |  -.2593268   .0441292    -5.88   0.000    -.3458264   -.1728271
       L8D2. |  -.2476327   .0437053    -5.67   0.000    -.3333014   -.1619641
       L9D2. |  -.2276992   .0432731    -5.26   0.000    -.3125209   -.1428776
      L10D2. |   -.247471   .0428252    -5.78   0.000    -.3314147   -.1635273
      L11D2. |  -.2365499   .0423438    -5.59   0.000      -.31955   -.1535499
      L12D2. |  -.2475596   .0418375    -5.92   0.000    -.3295671   -.1655521
      L13D2. |  -.2485205   .0413229    -6.01   0.000    -.3295194   -.1675215
      L14D2. |  -.2041206   .0407515    -5.01   0.000    -.2839994   -.1242418
      L15D2. |  -.2080892   .0401298    -5.19   0.000    -.2867495   -.1294288
      L16D2. |  -.2080786   .0395019    -5.27   0.000     -.285508   -.1306492
      L17D2. |  -.2063127   .0388626    -5.31   0.000     -.282489   -.1301364
      L18D2. |  -.2156525   .0381963    -5.65   0.000    -.2905229   -.1407821
      L19D2. |  -.2114378   .0374902    -5.64   0.000     -.284924   -.1379516
      L20D2. |  -.2041965   .0367811    -5.55   0.000    -.2762929   -.1321001
      L21D2. |  -.1700415   .0359913    -4.72   0.000    -.2405896   -.0994934
      L22D2. |  -.1758987   .0351547    -5.00   0.000     -.244807   -.1069904
      L23D2. |  -.1565523   .0342921    -4.57   0.000    -.2237697   -.0893349
      L24D2. |  -.1475228   .0334195    -4.41   0.000    -.2130299   -.0820157
      L25D2. |  -.1473923   .0325171    -4.53   0.000    -.2111305   -.0836541
      L26D2. |  -.1491059   .0315881    -4.72   0.000    -.2110231   -.0871887
      L27D2. |  -.1347348   .0306403    -4.40   0.000    -.1947943   -.0746753
      L28D2. |  -.1016216   .0295518    -3.44   0.001    -.1595474   -.0436959
      L29D2. |  -.0973489   .0284146    -3.43   0.001    -.1530456   -.0416523
      L30D2. |  -.0880963   .0272602    -3.23   0.001    -.1415302   -.0346623
      L31D2. |  -.0602989   .0260223    -2.32   0.021    -.1113063   -.0092915
      L32D2. |  -.0576395   .0247725    -2.33   0.020    -.1061972   -.0090819
      L33D2. |   -.058112   .0233954    -2.48   0.013    -.1039705   -.0122536
      L34D2. |   -.046703   .0218959    -2.13   0.033    -.0896221   -.0037838
      L35D2. |  -.0310432   .0202867    -1.53   0.126    -.0708081    .0087216
      L36D2. |  -.0381493    .018485    -2.06   0.039    -.0743826    -.001916
      L37D2. |   -.042995   .0165955    -2.59   0.010    -.0755246   -.0104654
      L38D2. |   -.031842   .0145447    -2.19   0.029    -.0603518   -.0033321
      L39D2. |  -.0302015   .0119653    -2.52   0.012    -.0536551   -.0067478
      L40D2. |  -.0216576   .0087286    -2.48   0.013     -.038767   -.0045483
             |
       _cons |  -.0003776   .0003438    -1.10   0.272    -.0010515    .0002963
------------------------------------------------------------------------------

. //r3y
. dfgls r3y
 
DF-GLS for r3y                                           Number of obs = 13107
Maxlag = 40 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    40           -2.851           -3.480            -2.836            -2.548
    39           -2.803           -3.480            -2.836            -2.548
    38           -2.792           -3.480            -2.836            -2.548
    37           -2.773           -3.480            -2.836            -2.548
    36           -2.772           -3.480            -2.836            -2.548
    35           -2.786           -3.480            -2.836            -2.548
    34           -2.818           -3.480            -2.836            -2.549
    33           -2.783           -3.480            -2.836            -2.549
    32           -2.804           -3.480            -2.836            -2.549
    31           -2.810           -3.480            -2.836            -2.549
    30           -2.772           -3.480            -2.837            -2.549
    29           -2.739           -3.480            -2.837            -2.549
    28           -2.723           -3.480            -2.837            -2.549
    27           -2.689           -3.480            -2.837            -2.549
    26           -2.647           -3.480            -2.837            -2.549
    25           -2.646           -3.480            -2.837            -2.549
    24           -2.648           -3.480            -2.837            -2.549
    23           -2.609           -3.480            -2.837            -2.550
    22           -2.596           -3.480            -2.837            -2.550
    21           -2.625           -3.480            -2.837            -2.550
    20           -2.573           -3.480            -2.838            -2.550
    19           -2.522           -3.480            -2.838            -2.550
    18           -2.484           -3.480            -2.838            -2.550
    17           -2.467           -3.480            -2.838            -2.550
    16           -2.466           -3.480            -2.838            -2.550
    15           -2.449           -3.480            -2.838            -2.550
    14           -2.470           -3.480            -2.838            -2.550
    13           -2.392           -3.480            -2.838            -2.550
    12           -2.347           -3.480            -2.838            -2.550
    11           -2.358           -3.480            -2.838            -2.551
    10           -2.346           -3.480            -2.839            -2.551
    9            -2.367           -3.480            -2.839            -2.551
    8            -2.321           -3.480            -2.839            -2.551
    7            -2.330           -3.480            -2.839            -2.551
    6            -2.327           -3.480            -2.839            -2.551
    5            -2.322           -3.480            -2.839            -2.551
    4            -2.348           -3.480            -2.839            -2.551
    3            -2.418           -3.480            -2.839            -2.551
    2            -2.375           -3.480            -2.839            -2.551
    1            -2.372           -3.480            -2.839            -2.551
 
Opt Lag (Ng-Perron seq t) = 40 with RMSE  .0489098
Min SC   = -6.028382 at lag  1 with RMSE    .04905
Min MAIC = -6.029632 at lag 14 with RMSE  .0489795

. dfuller r3y, trend lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =     13107

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.878            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.1696

------------------------------------------------------------------------------
D.r3y        |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         r3y |
         L1. |  -.0010757   .0003737    -2.88   0.004    -.0018082   -.0003432
         LD. |    .026684   .0087456     3.05   0.002     .0095413    .0438267
        L2D. |   .0008743   .0087487     0.10   0.920    -.0162744    .0180231
        L3D. |   .0169057   .0087486     1.93   0.053    -.0002428    .0340543
        L4D. |  -.0275372   .0087482    -3.15   0.002    -.0446849   -.0103895
        L5D. |  -.0106455   .0087512    -1.22   0.224     -.027799    .0065081
        L6D. |   .0013822   .0087504     0.16   0.874    -.0157698    .0185343
        L7D. |  -.0003412    .008748    -0.04   0.969    -.0174887    .0168062
        L8D. |  -.0040115   .0087477    -0.46   0.647    -.0211583    .0131353
        L9D. |   .0193835   .0087477     2.22   0.027     .0022367    .0365303
       L10D. |  -.0092651   .0087489    -1.06   0.290    -.0264143    .0078841
       L11D. |   .0034645   .0087483     0.40   0.692    -.0136836    .0206125
       L12D. |  -.0048302   .0087483    -0.55   0.581    -.0219781    .0123178
       L13D. |   .0164366   .0087475     1.88   0.060    -.0007098    .0335831
       L14D. |   .0304258   .0087471     3.48   0.001     .0132802    .0475714
       L15D. |  -.0080352   .0087504    -0.92   0.358    -.0251873    .0091169
       L16D. |    .007276   .0087507     0.83   0.406    -.0098766    .0244286
       L17D. |   .0002283   .0087502     0.03   0.979    -.0169233    .0173799
       L18D. |   .0050406   .0087503     0.58   0.565    -.0121113    .0221925
       L19D. |   .0145457   .0087497     1.66   0.096    -.0026049    .0316963
       L20D. |   .0182708   .0087492     2.09   0.037      .001121    .0354206
       L21D. |   .0188088   .0087494     2.15   0.032     .0016587    .0359589
       L22D. |   -.009738   .0087503    -1.11   0.266    -.0268898    .0074138
       L23D. |   .0052696   .0087508     0.60   0.547    -.0118832    .0224225
       L24D. |   .0142528   .0087514     1.63   0.103    -.0029012    .0314068
       L25D. |  -.0007336    .008752    -0.08   0.933    -.0178889    .0164216
       L26D. |   .0004373   .0087516     0.05   0.960     -.016717    .0175917
       L27D. |   .0150864   .0087457     1.73   0.085    -.0020565    .0322293
       L28D. |   .0117906    .008746     1.35   0.178    -.0053528    .0289341
       L29D. |   .0057053   .0087466     0.65   0.514    -.0114394    .0228499
       L30D. |   .0116556   .0087469     1.33   0.183    -.0054895    .0288007
       L31D. |   .0126753   .0087474     1.45   0.147    -.0044709    .0298215
       L32D. |  -.0012164   .0087458    -0.14   0.889    -.0183594    .0159266
       L33D. |  -.0071436   .0087393    -0.82   0.414     -.024274    .0099867
       L34D. |   .0128943   .0087379     1.48   0.140    -.0042332    .0300218
       L35D. |  -.0102418   .0087406    -1.17   0.241    -.0273746    .0068911
       L36D. |  -.0040274   .0087403    -0.46   0.645    -.0211597    .0131048
       L37D. |   .0002989   .0087371     0.03   0.973    -.0168271     .017425
       L38D. |   .0068498   .0087361     0.78   0.433    -.0102742    .0239738
       L39D. |    .003716    .008737     0.43   0.671    -.0134098    .0208419
       L40D. |   .0166431   .0087337     1.91   0.057    -.0004761    .0337624
      _trend |  -6.27e-07   2.59e-07    -2.42   0.015    -1.13e-06   -1.20e-07
       _cons |   .0078452   .0031018     2.53   0.011     .0017652    .0139251
------------------------------------------------------------------------------

. dfgls D.r3y
 
DF-GLS for D.r3y                                         Number of obs = 13106
Maxlag = 40 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    40           -6.084           -3.480            -2.836            -2.548
    39           -6.331           -3.480            -2.836            -2.548
    38           -6.550           -3.480            -2.836            -2.548
    37           -6.700           -3.480            -2.836            -2.548
    36           -6.877           -3.480            -2.836            -2.548
    35           -7.019           -3.480            -2.836            -2.548
    34           -7.131           -3.480            -2.836            -2.549
    33           -7.202           -3.480            -2.836            -2.549
    32           -7.444           -3.480            -2.836            -2.549
    31           -7.554           -3.480            -2.836            -2.549
    30           -7.707           -3.480            -2.837            -2.549
    29           -7.983           -3.480            -2.837            -2.549
    28           -8.264           -3.480            -2.837            -2.549
    27           -8.519           -3.480            -2.837            -2.549
    26           -8.842           -3.480            -2.837            -2.549
    25           -9.223           -3.480            -2.837            -2.549
    24           -9.498           -3.480            -2.837            -2.549
    23           -9.779           -3.480            -2.837            -2.550
    22          -10.228           -3.480            -2.837            -2.550
    21          -10.621           -3.480            -2.837            -2.550
    20          -10.879           -3.480            -2.838            -2.550
    19          -11.485           -3.480            -2.838            -2.550
    18          -12.161           -3.480            -2.838            -2.550
    17          -12.861           -3.480            -2.838            -2.550
    16          -13.530           -3.480            -2.838            -2.550
    15          -14.191           -3.480            -2.838            -2.550
    14          -15.019           -3.480            -2.838            -2.550
    13          -15.702           -3.480            -2.838            -2.550
    12          -17.146           -3.480            -2.838            -2.550
    11          -18.617           -3.480            -2.838            -2.551
    10          -19.875           -3.480            -2.839            -2.551
    9           -21.541           -3.480            -2.839            -2.551
    8           -23.194           -3.480            -2.839            -2.551
    7           -25.893           -3.480            -2.839            -2.551
    6           -28.600           -3.480            -2.839            -2.551
    5           -32.149           -3.480            -2.839            -2.551
    4           -36.870           -3.480            -2.839            -2.551
    3           -42.714           -3.480            -2.839            -2.551
    2           -50.009           -3.480            -2.839            -2.551
    1           -65.155           -3.480            -2.839            -2.551
 
Opt Lag (Ng-Perron seq t) = 40 with RMSE  .0493032
Min SC   = -5.991101 at lag 30 with RMSE  .0494515
Min MAIC = -5.980714 at lag 40 with RMSE  .0493032

. dfuller D.r3y, trend lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =     13106

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -15.738            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D2.r3y       |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       D.r3y |
         L1. |  -.8037424   .0510693   -15.74   0.000    -.9038456   -.7036392
         LD. |  -.1705339   .0505832    -3.37   0.001    -.2696844   -.0713834
        L2D. |  -.1702001   .0500652    -3.40   0.001    -.2683352    -.072065
        L3D. |  -.1539279   .0495378    -3.11   0.002    -.2510293   -.0568265
        L4D. |  -.1817585   .0489929    -3.71   0.000    -.2777917   -.0857253
        L5D. |  -.1926959   .0484494    -3.98   0.000    -.2876637   -.0977281
        L6D. |  -.1913953   .0479087    -4.00   0.000    -.2853033   -.0974872
        L7D. |  -.1926733   .0473762    -4.07   0.000    -.2855374   -.0998091
        L8D. |  -.1970012   .0468205    -4.21   0.000    -.2887761   -.1052263
        L9D. |  -.1780081   .0462706    -3.85   0.000    -.2687052    -.087311
       L10D. |  -.1880023   .0457122    -4.11   0.000    -.2776049   -.0983997
       L11D. |  -.1853663   .0451335    -4.11   0.000    -.2738345   -.0968982
       L12D. |  -.1908027   .0445295    -4.28   0.000     -.278087   -.1035183
       L13D. |   -.175054   .0439106    -3.99   0.000    -.2611252   -.0889828
       L14D. |   -.145598   .0432597    -3.37   0.001    -.2303933   -.0608026
       L15D. |  -.1543084   .0425674    -3.63   0.000    -.2377466   -.0708702
       L16D. |  -.1474932   .0418652    -3.52   0.000     -.229555   -.0654313
       L17D. |  -.1481108   .0411524    -3.60   0.000    -.2287755   -.0674461
       L18D. |  -.1437137   .0404037    -3.56   0.000    -.2229108   -.0645166
       L19D. |  -.1294753   .0396324    -3.27   0.001    -.2071605   -.0517901
       L20D. |  -.1121792   .0388624    -2.89   0.004    -.1883552   -.0360032
       L21D. |  -.0943321   .0380409    -2.48   0.013    -.1688978   -.0197665
       L22D. |  -.1049642   .0371638    -2.82   0.005    -.1778106   -.0321179
       L23D. |  -.1003782   .0362406    -2.77   0.006    -.1714151   -.0293414
       L24D. |  -.0866887    .035284    -2.46   0.014    -.1558504   -.0175269
       L25D. |  -.0882675   .0343002    -2.57   0.010    -.1555008   -.0210341
       L26D. |  -.0882078   .0332704    -2.65   0.008    -.1534226    -.022993
       L27D. |   -.074617   .0322288    -2.32   0.021    -.1377901   -.0114438
       L28D. |  -.0638714   .0310772    -2.06   0.040    -.1247872   -.0029556
       L29D. |  -.0585489   .0298379    -1.96   0.050    -.1170356   -.0000623
       L30D. |  -.0476114   .0285605    -1.67   0.096    -.1035941    .0083714
       L31D. |  -.0353555   .0272129    -1.30   0.194    -.0886968    .0179857
       L32D. |  -.0375211   .0258221    -1.45   0.146    -.0881363    .0130941
       L33D. |  -.0448719   .0242972    -1.85   0.065    -.0924979     .002754
       L34D. |  -.0324253   .0226887    -1.43   0.153    -.0768983    .0120478
       L35D. |  -.0434977   .0209602    -2.08   0.038    -.0845828   -.0024125
       L36D. |  -.0478561   .0190747    -2.51   0.012    -.0852454   -.0104669
       L37D. |  -.0475567   .0170341    -2.79   0.005    -.0809459   -.0141674
       L38D. |  -.0416975   .0148469    -2.81   0.005    -.0707996   -.0125953
       L39D. |  -.0385656    .012178    -3.17   0.002    -.0624362    -.014695
       L40D. |  -.0231568   .0087322    -2.65   0.008    -.0402731   -.0060405
      _trend |   3.99e-08   1.13e-07     0.35   0.724    -1.82e-07    2.62e-07
       _cons |  -.0006999   .0008612    -0.81   0.416     -.002388    .0009881
------------------------------------------------------------------------------

. dfgls D.r3y, notrend
 
DF-GLS for D.r3y                                         Number of obs = 13106
Maxlag = 40 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    40           -3.214           -2.580            -1.947            -1.623
    39           -3.352           -2.580            -1.947            -1.623
    38           -3.475           -2.580            -1.947            -1.623
    37           -3.560           -2.580            -1.947            -1.623
    36           -3.661           -2.580            -1.947            -1.624
    35           -3.743           -2.580            -1.947            -1.624
    34           -3.809           -2.580            -1.947            -1.624
    33           -3.853           -2.580            -1.947            -1.624
    32           -3.990           -2.580            -1.947            -1.624
    31           -4.055           -2.580            -1.947            -1.624
    30           -4.144           -2.580            -1.947            -1.624
    29           -4.301           -2.580            -1.948            -1.624
    28           -4.461           -2.580            -1.948            -1.624
    27           -4.608           -2.580            -1.948            -1.624
    26           -4.794           -2.580            -1.948            -1.624
    25           -5.012           -2.580            -1.948            -1.624
    24           -5.174           -2.580            -1.948            -1.624
    23           -5.341           -2.580            -1.948            -1.624
    22           -5.602           -2.580            -1.948            -1.624
    21           -5.836           -2.580            -1.948            -1.624
    20           -5.996           -2.580            -1.948            -1.624
    19           -6.353           -2.580            -1.948            -1.624
    18           -6.753           -2.580            -1.948            -1.625
    17           -7.172           -2.580            -1.948            -1.625
    16           -7.580           -2.580            -1.948            -1.625
    15           -7.989           -2.580            -1.948            -1.625
    14           -8.501           -2.580            -1.948            -1.625
    13           -8.940           -2.580            -1.949            -1.625
    12           -9.825           -2.580            -1.949            -1.625
    11          -10.748           -2.580            -1.949            -1.625
    10          -11.574           -2.580            -1.949            -1.625
    9           -12.669           -2.580            -1.949            -1.625
    8           -13.796           -2.580            -1.949            -1.625
    7           -15.602           -2.580            -1.949            -1.625
    6           -17.508           -2.580            -1.949            -1.625
    5           -20.054           -2.580            -1.949            -1.625
    4           -23.531           -2.580            -1.949            -1.625
    3           -28.054           -2.580            -1.949            -1.625
    2           -34.048           -2.580            -1.949            -1.625
    1           -46.396           -2.580            -1.949            -1.625
 
Opt Lag (Ng-Perron seq t) = 40 with RMSE  .0493533
Min SC   = -5.987884 at lag 30 with RMSE  .0495311
Min MAIC = -6.007641 at lag 40 with RMSE  .0493533

. dfuller D.r3y, lags(`r(optlag)') 

Augmented Dickey-Fuller test for unit root         Number of obs   =     13106

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -15.735            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

. 
. ************************************************************
. varsoc r3m r1y r3y 

   Selection-order criteria
   Sample:  05jan1986 - 30dec2021               Number of obs      =     13144
  +---------------------------------------------------------------------------+
  |lag |    LL      LR      df    p      FPE       AIC      HQIC      SBIC    |
  |----+----------------------------------------------------------------------|
  |  0 | -36963.3                      .055642   5.62482   5.62539   5.62653  |
  |  1 |  78400.3  2.3e+05   9  0.000  1.3e-09  -11.9276  -11.9253  -11.9208  |
  |  2 |  78542.4  284.06    9  0.000  1.3e-09  -11.9479  -11.9439  -11.9359  |
  |  3 |  78600.2  115.67    9  0.000  1.3e-09  -11.9553  -11.9496* -11.9382* |
  |  4 |  78618.2  36.113*   9  0.000  1.3e-09* -11.9567* -11.9493  -11.9345  |
  +---------------------------------------------------------------------------+
   Endogenous:  r3m r1y r3y
    Exogenous:  _cons

. vecrank r3m r1y r3y , trend(rtrend) max levela lags(3)

                       Johansen tests for cointegration                        
Trend: rtrend                                           Number of obs =   13145
Sample:  04jan1986 - 30dec2021                                   Lags =       3
-------------------------------------------------------------------------------
maximum                                      trace     5% critical  1% critical
  rank    parms       LL       eigenvalue  statistic      value        value
    0      21      78544.897                157.9582      42.44        48.45
    1      27      78596.692     0.00785     54.3666      25.32        30.45
    2      31      78621.308     0.00374      5.1352*1*5  12.25        16.26
    3      33      78623.876     0.00039
-------------------------------------------------------------------------------
maximum                                       max      5% critical  1% critical
  rank    parms       LL       eigenvalue  statistic      value        value
    0      21      78544.897                103.5916      25.54        30.34
    1      27      78596.692     0.00785     49.2314      18.96        23.65
    2      31      78621.308     0.00374      5.1352      12.52        16.26
    3      33      78623.876     0.00039
-------------------------------------------------------------------------------

. vec r3m r1y r3y , trend(rtrend) rank(2) lags(3)

Vector error-correction model

Sample:  04jan1986 - 30dec2021                  Number of obs     =     13,145
                                                AIC               =  -11.95745
Log likelihood =  78621.31                      HQIC              =  -11.95155
Det(Sigma_ml)  =  1.28e-09                      SBIC              =   -11.9398

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
D_r3m                 9      .04245   0.0253   341.2302   0.0000
D_r1y                 9     .039325   0.0105   140.0474   0.0000
D_r3y                 9     .048966   0.0078   103.5921   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
D_r3m        |
        _ce1 |
         L1. |  -.0160941   .0018519    -8.69   0.000    -.0197236   -.0124645
             |
        _ce2 |
         L1. |   .0197605   .0029021     6.81   0.000     .0140726    .0254484
             |
         r3m |
         LD. |   .0504097   .0115084     4.38   0.000     .0278536    .0729657
        L2D. |  -.0987817   .0114908    -8.60   0.000    -.1213033   -.0762601
             |
         r1y |
         LD. |   .1376044   .0194906     7.06   0.000     .0994035    .1758053
        L2D. |   .0547214   .0195075     2.81   0.005     .0164875    .0929554
             |
         r3y |
         LD. |   -.078244   .0133114    -5.88   0.000    -.1043338   -.0521542
        L2D. |  -.0001896   .0133151    -0.01   0.989    -.0262867    .0259076
             |
       _cons |   .0001478   .0003868     0.38   0.702    -.0006104    .0009059
-------------+----------------------------------------------------------------
D_r1y        |
        _ce1 |
         L1. |  -.0042809   .0017155    -2.50   0.013    -.0076433   -.0009186
             |
        _ce2 |
         L1. |   .0040414   .0026884     1.50   0.133    -.0012277    .0093106
             |
         r3m |
         LD. |   .0819331    .010661     7.69   0.000     .0610379    .1028284
        L2D. |  -.0322938   .0106447    -3.03   0.002    -.0531571   -.0114305
             |
         r1y |
         LD. |   .0123039   .0180555     0.68   0.496    -.0230842    .0476921
        L2D. |   .0003658   .0180711     0.02   0.984     -.035053    .0357846
             |
         r3y |
         LD. |  -.0064474   .0123313    -0.52   0.601    -.0306162    .0177214
        L2D. |   .0080929   .0123347     0.66   0.512    -.0160827    .0322686
             |
       _cons |  -.0004041   .0003583    -1.13   0.259    -.0011064    .0002982
-------------+----------------------------------------------------------------
D_r3y        |
        _ce1 |
         L1. |  -.0047148   .0021361    -2.21   0.027    -.0089014   -.0005281
             |
        _ce2 |
         L1. |   .0093567   .0033475     2.80   0.005     .0027958    .0159176
             |
         r3m |
         LD. |   .0361427   .0132747     2.72   0.006     .0101248    .0621607
        L2D. |  -.0507624   .0132544    -3.83   0.000    -.0767406   -.0247842
             |
         r1y |
         LD. |   .1125625    .022482     5.01   0.000     .0684986    .1566265
        L2D. |   .0466687   .0225015     2.07   0.038     .0025666    .0907708
             |
         r3y |
         LD. |  -.0576472   .0153544    -3.75   0.000    -.0877413   -.0275531
        L2D. |  -.0128344   .0153587    -0.84   0.403     -.042937    .0172682
             |
       _cons |  -.0001376   .0004462    -0.31   0.758    -.0010121    .0007369
------------------------------------------------------------------------------

Cointegrating equations

Equation           Parms    chi2     P>chi2
-------------------------------------------
_ce1                  1    457.363   0.0000
_ce2                  1   872.6056   0.0000
-------------------------------------------

Identification:  beta is exactly identified

                 Johansen normalization restrictions imposed
------------------------------------------------------------------------------
        beta |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
_ce1         |
         r3m |          1          .        .       .            .           .
         r1y |          0  (omitted)
         r3y |   -1.32333   .0618782   -21.39   0.000    -1.444609   -1.202051
      _trend |  -.0002643   .0000429    -6.17   0.000    -.0003483   -.0001803
       _cons |    3.75365          .        .       .            .           .
-------------+----------------------------------------------------------------
_ce2         |
         r3m |          0  (omitted)
         r1y |          1          .        .       .            .           .
         r3y |  -1.286873   .0435639   -29.54   0.000    -1.372257    -1.20149
      _trend |  -.0002108   .0000302    -6.99   0.000      -.00027   -.0001517
       _cons |   2.954073          .        .       .            .           .
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANC
> IEROS/GUIAS-EXAMENES/TP2/tp2.log
  log type:  text
 closed on:   4 Jul 2024, 18:07:31
--------------------------------------------------------------------------------------------------------------
