[
  "obsidian-epub-plugin",
  "table-editor-obsidian",
  "obsidian-minimal-settings",
  "obsidian-style-settings",
  "markdown-table-editor",
  "obsidian-excel-to-markdown-table",
  "obsidian-table-generator",
  "meld-calc",
  "settings-search",
  "obsidian-latex-suite",
  "obsidian-tikzjax"
]