[
  "obsidian-latex-suite",
  "obsidian-tikzjax",
  "table-editor-obsidian",
  "obsidian-style-settings",
  "meld-calc",
  "cycle-through-panes",
  "omnisearch",
  "obsidian-desmos",
  "settings-search",
  "better-word-count",
  "obsidian-excel-to-markdown-table",
  "obsidian-kanban",
  "obsidian-annotator",
  "obsidian-epub-plugin"
]