---------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/GUIAS-E
> XAMENES/FINAL-2024/Lopez.log
  log type:  text
 opened on:  11 Jul 2024, 00:40:05

. ************************************************************
. *********** EJERCICIO 1 ************************************   
. ************************************************************
. use pbi_argen, clear

. ************************************************************ a)
. * Convertimos a logaritmos
. gen lpbi=ln(pbi)

. gen lc=ln(consumo)

. gen linv=ln(inversion)

. gen lgp = ln(gasto_pub)

. gen limpo = ln(importaciones)

. 
. 
. tsset trim
        time variable:  trim, 2004q1 to 2023q3
                delta:  1 quarter

. 
. tsfilter hp pbi_c = lpbi, smooth(400) trend(y_g) // tenemos pbi_c es el pbi ciclico, y_g la tendencia

. 
. tsfilter hp c_c = lc, smooth(400) trend(c_g) // consumo

. 
. tsfilter hp inv_c = linv, smooth(400) trend(inv_g) // inversion

. 
. tsfilter hp gp_c = lgp, smooth(400) trend(gp_g) //gasto pub

. 
. tsfilter hp impo_c = limpo, smooth(400) trend(impo_g) //imports

. 
. su pbi_c c_c  inv_c gp_c impo_c

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       pbi_c |         79   -4.13e-11    .0332725  -.1782351   .0443701
         c_c |         79    4.01e-11    .0399573  -.1841971   .0618959
       inv_c |         79   -2.31e-10    .0979422  -.4915575   .1800139
        gp_c |         79   -3.98e-11    .0191089  -.0561387   .0420824
      impo_c |         79    2.03e-10    .0936208  -.3248245   .1978818

. // vemos que la inversion es la que tiene mayor desvio estandar
. 
. ** Podemos ver la volatiliad con la regla de raiz cuadrada del tiempo que usa Alexander
. 
. su pbi_c 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       pbi_c |         79   -4.13e-11    .0332725  -.1782351   .0443701

. disp r(sd)* sqrt(4)
.06654496

. su c_c 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         c_c |         79    4.01e-11    .0399573  -.1841971   .0618959

. disp r(sd)* sqrt(4)
.07991456

. su inv_c 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       inv_c |         79   -2.31e-10    .0979422  -.4915575   .1800139

. disp r(sd)* sqrt(4)
.1958844

. su gp_c 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        gp_c |         79   -3.98e-11    .0191089  -.0561387   .0420824

. disp r(sd)* sqrt(4)
.03821784

. su impo_c

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      impo_c |         79    2.03e-10    .0936208  -.3248245   .1978818

. disp r(sd)* sqrt(4)
.18724153

. 
. 
. ************************************************************ b)
. *buscamos orden de integracion
. ** PBI
. dfgls pbi_c //elegimos 1 rezago
 
DF-GLS for pbi_c                                         Number of obs =    67
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11           -3.500           -3.660            -2.731            -2.456
    10           -3.984           -3.660            -2.772            -2.496
    9            -3.740           -3.660            -2.813            -2.536
    8            -4.335           -3.660            -2.854            -2.576
    7            -4.008           -3.660            -2.894            -2.614
    6            -3.881           -3.660            -2.933            -2.651
    5            -3.938           -3.660            -2.971            -2.686
    4            -4.156           -3.660            -3.006            -2.718
    3            -4.134           -3.660            -3.038            -2.748
    2            -4.502           -3.660            -3.067            -2.774
    1            -4.280           -3.660            -3.093            -2.797
 
Opt Lag (Ng-Perron seq t) =  1 with RMSE  .0260003
Min SC   = -7.173783 at lag  1 with RMSE  .0260003
Min MAIC = -6.587954 at lag  1 with RMSE  .0260003

. dfuller pbi_c, trend lags(`r(optlag)') regress // Trend no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =        77

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.529            -4.091            -3.473            -3.164
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0014

------------------------------------------------------------------------------
D.pbi_c      |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       pbi_c |
         L1. |  -.4284707   .0946007    -4.53   0.000    -.6170096   -.2399319
         LD. |   .2244611   .1133797     1.98   0.052    -.0015042    .4504265
      _trend |  -.0000276   .0001293    -0.21   0.832    -.0002852    .0002301
       _cons |   .0015266   .0059145     0.26   0.797     -.010261    .0133142
------------------------------------------------------------------------------

. dfgls pbi_c, notrend //elegimos 1 rezago
 
DF-GLS for pbi_c                                         Number of obs =    67
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11           -3.409           -2.608            -1.991            -1.693
    10           -3.899           -2.608            -2.009            -1.712
    9            -3.686           -2.608            -2.027            -1.731
    8            -4.285           -2.608            -2.047            -1.751
    7            -3.980           -2.608            -2.068            -1.771
    6            -3.866           -2.608            -2.088            -1.790
    5            -3.929           -2.608            -2.108            -1.809
    4            -4.151           -2.608            -2.127            -1.828
    3            -4.132           -2.608            -2.146            -1.845
    2            -4.500           -2.608            -2.163            -1.861
    1            -4.279           -2.608            -2.178            -1.875
 
Opt Lag (Ng-Perron seq t) =  1 with RMSE  .0260015
Min SC   = -7.173689 at lag  1 with RMSE  .0260015
Min MAIC = -6.587688 at lag  1 with RMSE  .0260015

. dfuller pbi_c, lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =        77

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.562            -3.542            -2.908            -2.589
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0002

------------------------------------------------------------------------------
     D.pbi_c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       pbi_c |
         L1. |  -.4287371   .0939804    -4.56   0.000    -.6159971    -.241477
         LD. |   .2249917    .112619     2.00   0.049     .0005935    .4493899
             |
       _cons |   .0004237   .0028542     0.15   0.882    -.0052634    .0061107
------------------------------------------------------------------------------

. // A nivel 5% podemos decir que es integrada de orden I(0) porque rechazamos HO: raiz unitaria
. 
. dfgls c_c //elegimos 6 rezago
 
DF-GLS for c_c                                           Number of obs =    67
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11           -3.774           -3.660            -2.731            -2.456
    10           -4.096           -3.660            -2.772            -2.496
    9            -3.983           -3.660            -2.813            -2.536
    8            -3.824           -3.660            -2.854            -2.576
    7            -4.101           -3.660            -2.894            -2.614
    6            -4.138           -3.660            -2.933            -2.651
    5            -3.494           -3.660            -2.971            -2.686
    4            -3.482           -3.660            -3.006            -2.718
    3            -3.788           -3.660            -3.038            -2.748
    2            -3.928           -3.660            -3.067            -2.774
    1            -3.863           -3.660            -3.093            -2.797
 
Opt Lag (Ng-Perron seq t) =  6 with RMSE  .0280088
Min SC   = -6.920196 at lag  1 with RMSE  .0295151
Min MAIC = -6.474358 at lag  1 with RMSE  .0295151

. dfuller c_c, trend lags(`r(optlag)') regress // Trend no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =        72

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.233            -4.102            -3.478            -3.167
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0040

------------------------------------------------------------------------------
D.c_c        |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         c_c |
         L1. |   -.640969   .1514152    -4.23   0.000     -.943548   -.3383899
         LD. |   .4117794   .1494249     2.76   0.008     .1131777    .7103812
        L2D. |   .3182525   .1439161     2.21   0.031     .0306591    .6058459
        L3D. |   .1977503   .1341744     1.47   0.146    -.0703758    .4658764
        L4D. |   .1501326   .1261974     1.19   0.239    -.1020528    .4023179
        L5D. |    .174609   .1207136     1.45   0.153     -.066618     .415836
        L6D. |   .2299807   .1160242     1.98   0.052    -.0018752    .4618365
      _trend |  -.0000961   .0001667    -0.58   0.566    -.0004294    .0002371
       _cons |   .0041861   .0078618     0.53   0.596    -.0115244    .0198966
------------------------------------------------------------------------------

. dfgls c_c, notrend //elegimos 6 rezago
 
DF-GLS for c_c                                           Number of obs =    67
Maxlag = 11 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    11           -3.694           -2.608            -1.991            -1.693
    10           -4.026           -2.608            -2.009            -1.712
    9            -3.931           -2.608            -2.027            -1.731
    8            -3.787           -2.608            -2.047            -1.751
    7            -4.070           -2.608            -2.068            -1.771
    6            -4.116           -2.608            -2.088            -1.790
    5            -3.485           -2.608            -2.108            -1.809
    4            -3.476           -2.608            -2.127            -1.828
    3            -3.783           -2.608            -2.146            -1.845
    2            -3.925           -2.608            -2.163            -1.861
    1            -3.861           -2.608            -2.178            -1.875
 
Opt Lag (Ng-Perron seq t) =  6 with RMSE  .0280415
Min SC   = -6.919981 at lag  1 with RMSE  .0295182
Min MAIC = -6.474836 at lag  1 with RMSE  .0295182

. dfuller c_c, lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =        72

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.220            -3.549            -2.912            -2.591
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0006

------------------------------------------------------------------------------
       D.c_c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         c_c |
         L1. |  -.6330385   .1500009    -4.22   0.000    -.9326997   -.3333773
         LD. |   .4040654   .1480467     2.73   0.008     .1083082    .6998226
        L2D. |   .3126712   .1428395     2.19   0.032     .0273165    .5980259
        L3D. |   .1912878   .1330064     1.44   0.155    -.0744231    .4569986
        L4D. |   .1434732   .1250108     1.15   0.255    -.1062645    .3932109
        L5D. |   .1692346    .119724     1.41   0.162    -.0699416    .4084108
        L6D. |   .2252084   .1151236     1.96   0.055    -.0047774    .4551941
             |
       _cons |   .0001123   .0034308     0.03   0.974    -.0067415     .006966
------------------------------------------------------------------------------

. // A nivel 5% es I(0)
. 
. ** las dos son I(0) si tendencia deterministica en niveles
. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =     92.35
       Model |  2.0048e+09         6   334138054   Prob > F        =    0.0000
    Residual |  9.6570e+09     2,669  3618227.65   R-squared       =    0.1719
-------------+----------------------------------   Adj R-squared   =    0.1701
       Total |  1.1662e+10     2,675  4359580.53   Root MSE        =    1902.2

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |   1824.908   137.5459    13.27   0.000       1555.2    2094.615
      Martes |   2338.842   137.5459    17.00   0.000     2069.135     2608.55
   Miercoles |   2492.462   137.6358    18.11   0.000     2222.578    2762.345
      Jueves |   2479.421   137.6358    18.01   0.000     2209.537    2749.304
     Viernes |    2325.24   137.6358    16.89   0.000     2055.357    2595.124
      Sabado |   1093.035   137.6358     7.94   0.000     823.1518    1362.919
       _cons |   13509.72   97.32317   138.81   0.000     13318.89    13700.56
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. 
. 
. foreach num of numlist 1/12 {
  2.     local mes = "`num'"
  3.     gen mes`mes' = month(fecha) == `num'
  4. }

. 
. regress dem_mw_d mes2-mes12

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(11, 2664)     =    118.17
       Model |  3.1669e+09        11   287897826   Prob > F        =    0.0000
    Residual |  6.4902e+09     2,664  2436251.31   R-squared       =    0.3279
-------------+----------------------------------   Adj R-squared   =    0.3252
       Total |  9.6570e+09     2,675  3610111.99   Root MSE        =    1560.8

------------------------------------------------------------------------------
    dem_mw_d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mes2 |  -353.4386   143.6776    -2.46   0.014    -635.1694   -71.70774
        mes3 |  -1476.838   140.3102   -10.53   0.000    -1751.966   -1201.711
        mes4 |  -3217.644   141.4723   -22.74   0.000    -3495.051   -2940.238
        mes5 |  -2448.114   145.2251   -16.86   0.000    -2732.879   -2163.349
        mes6 |  -604.3941   146.5079    -4.13   0.000    -891.6748   -317.1133
        mes7 |  -285.7034   145.2251    -1.97   0.049    -570.4687   -.9380439
        mes8 |  -1458.047   145.2251   -10.04   0.000    -1742.813   -1173.282
        mes9 |  -2543.354   146.5079   -17.36   0.000    -2830.635   -2256.074
       mes10 |  -3070.889   145.2251   -21.15   0.000    -3355.654   -2786.123
       mes11 |   -2184.91   146.5079   -14.91   0.000    -2472.191   -1897.629
       mes12 |  -958.0869   145.2251    -6.60   0.000    -1242.852   -673.3216
       _cons |   1540.414   99.31448    15.51   0.000     1345.673    1735.155
------------------------------------------------------------------------------

. predict dem_mw_dm , resid

. 
. *tsline dem_mw_dm
. 
. gen dia = ""
(2,676 missing values generated)

. replace dia = "Lunes" if Lunes == 1
variable dia was str1 now str5
(383 real changes made)

. replace dia = "Martes" if Martes == 1
variable dia was str5 now str6
(383 real changes made)

. replace dia = "Miercoles" if Miercoles == 1
variable dia was str6 now str9
(382 real changes made)

. replace dia = "Jueves" if Jueves == 1
(382 real changes made)

. replace dia = "Viernes" if Viernes == 1
(382 real changes made)

. replace dia = "Sabado" if Sabado == 1
(382 real changes made)

. replace dia = "Domingo" if Domingo == 1
(382 real changes made)

. 
. *graph box dem_mw, over(dia, sort(1)) name(semanabox, replace)
. 
. 
. gen mes = ""
(2,676 missing values generated)

. replace mes = "Ene" if mes1 == 1
variable mes was str1 now str3
(247 real changes made)

. replace mes = "Feb" if mes2 == 1
(226 real changes made)

. replace mes = "Mar" if mes3 == 1
(248 real changes made)

. replace mes = "Abr" if mes4 == 1
(240 real changes made)

. replace mes = "May" if mes5 == 1
(217 real changes made)

. replace mes = "Jun" if mes6 == 1
(210 real changes made)

. replace mes = "Jul" if mes7 == 1
(217 real changes made)

. replace mes = "Ago" if mes8 == 1
(217 real changes made)

. replace mes = "Sep" if mes9 == 1
(210 real changes made)

. replace mes = "Oct" if mes10 == 1
(217 real changes made)

. replace mes = "Nov" if mes11 == 1
(210 real changes made)

. replace mes = "Dic" if mes12 == 1
(217 real changes made)

. 
. *graph box dem_mw, over(mes, sort(1)) name(mesbox, replace)
. 
. 
. dfgls dem_mw_dm
 
DF-GLS for dem_mw_dm                                     Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -5.615           -3.480            -2.832            -2.545
    26           -5.784           -3.480            -2.832            -2.546
    25           -5.832           -3.480            -2.833            -2.546
    24           -6.380           -3.480            -2.833            -2.547
    23           -6.437           -3.480            -2.834            -2.547
    22           -6.737           -3.480            -2.834            -2.548
    21           -7.074           -3.480            -2.835            -2.548
    20           -7.498           -3.480            -2.835            -2.548
    19           -7.909           -3.480            -2.836            -2.549
    18           -8.017           -3.480            -2.837            -2.549
    17           -8.515           -3.480            -2.837            -2.550
    16           -8.344           -3.480            -2.838            -2.550
    15           -8.498           -3.480            -2.838            -2.551
    14           -8.566           -3.480            -2.839            -2.551
    13           -8.874           -3.480            -2.839            -2.552
    12           -9.250           -3.480            -2.840            -2.552
    11           -9.233           -3.480            -2.840            -2.553
    10           -9.311           -3.480            -2.841            -2.553
    9           -10.023           -3.480            -2.841            -2.554
    8           -10.339           -3.480            -2.842            -2.554
    7           -11.386           -3.480            -2.842            -2.555
    6           -11.802           -3.480            -2.843            -2.555
    5           -12.551           -3.480            -2.843            -2.555
    4           -13.941           -3.480            -2.844            -2.556
    3           -15.163           -3.480            -2.844            -2.556
    2           -15.944           -3.480            -2.845            -2.557
    1           -19.341           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  835.6328
Min SC   =  13.49988 at lag  2 with RMSE  850.2031
Min MAIC =  13.54814 at lag 27 with RMSE  835.4045

. dfuller dem_mw_dm, trend lags(`r(optlag)') regress // Trend es siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -6.909            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D.dem_mw_dm  |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dem_mw_dm |
         L1. |  -.1426468   .0206458    -6.91   0.000    -.1831306   -.1021631
         LD. |   .1956421   .0262349     7.46   0.000      .144199    .2470853
        L2D. |  -.1935323   .0263766    -7.34   0.000    -.2452533   -.1418112
        L3D. |  -.0659957   .0263429    -2.51   0.012    -.1176507   -.0143407
        L4D. |  -.0883438   .0261197    -3.38   0.001     -.139561   -.0371266
        L5D. |  -.1133413   .0258625    -4.38   0.000    -.1640542   -.0626283
        L6D. |  -.0786964   .0256374    -3.07   0.002     -.128968   -.0284249
        L7D. |  -.0360958   .0254487    -1.42   0.156    -.0859973    .0138058
        L8D. |  -.1050886   .0250661    -4.19   0.000      -.15424   -.0559373
        L9D. |  -.0238549   .0249899    -0.95   0.340     -.072857    .0251471
       L10D. |  -.0770318   .0247075    -3.12   0.002    -.1254799   -.0285837
       L11D. |  -.0229692   .0245315    -0.94   0.349    -.0710723    .0251338
       L12D. |   -.010476   .0242476    -0.43   0.666    -.0580224    .0370705
       L13D. |  -.0477013   .0239535    -1.99   0.047    -.0946709   -.0007316
       L14D. |  -.0489252    .023781    -2.06   0.040    -.0955565   -.0022938
       L15D. |  -.0253508   .0235786    -1.08   0.282    -.0715854    .0208837
       L16D. |  -.0512613   .0231981    -2.21   0.027    -.0967498   -.0057728
       L17D. |  -.0023473   .0229829    -0.10   0.919    -.0474138    .0427191
       L18D. |  -.0846707    .022445    -3.77   0.000    -.1286824    -.040659
       L19D. |  -.0344512   .0222158    -1.55   0.121    -.0780134    .0091109
       L20D. |  -.0658618   .0217934    -3.02   0.003    -.1085959   -.0231277
       L21D. |  -.0651609   .0212419    -3.07   0.002    -.1068136   -.0235083
       L22D. |  -.0443627   .0208118    -2.13   0.033     -.085172   -.0035535
       L23D. |  -.0563949   .0204113    -2.76   0.006    -.0964188   -.0163709
       L24D. |   .0086481   .0193671     0.45   0.655    -.0293283    .0466245
       L25D. |  -.0763109   .0193411    -3.95   0.000    -.1142364   -.0383855
      _trend |   .0727663    .023686     3.07   0.002     .0263212    .1192115
       _cons |  -97.41909   35.89906    -2.71   0.007    -167.8124   -27.02573
------------------------------------------------------------------------------

. // Re
. 
. 
. 
. /*
> tssmooth ma y_ma = dem_mw, window(7) replace
> 
> dfgls dem_mw
> dfuller dem_mw, trend lags(`r(optlag)') regress // Trend no siginificativo
> 
> tssmooth shwinters dem_mw_w = dem_mw, iterate(10) additive period(365)
> twoway (line dem_mw_w fecha)
> */
. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. graph box dem_mw_dm, over(dia, sort(1)) name(semanabox, replace)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. graph box dem_mw_dm, over(mes, sort(1)) name(mesbox, replace)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls ln(dem_mw_dm)
ln:  operator invalid
r(198);

end of do-file

r(198);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. gen l_dem_mw_dm = ln(dem_mw_dm)
(1,404 missing values generated)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. gen l_dem_mw_dm = log(dem_mw_dm)
variable l_dem_mw_dm already defined
r(110);

end of do-file

r(110);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =     92.35
       Model |  2.0048e+09         6   334138054   Prob > F        =    0.0000
    Residual |  9.6570e+09     2,669  3618227.65   R-squared       =    0.1719
-------------+----------------------------------   Adj R-squared   =    0.1701
       Total |  1.1662e+10     2,675  4359580.53   Root MSE        =    1902.2

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |   1824.908   137.5459    13.27   0.000       1555.2    2094.615
      Martes |   2338.842   137.5459    17.00   0.000     2069.135     2608.55
   Miercoles |   2492.462   137.6358    18.11   0.000     2222.578    2762.345
      Jueves |   2479.421   137.6358    18.01   0.000     2209.537    2749.304
     Viernes |    2325.24   137.6358    16.89   0.000     2055.357    2595.124
      Sabado |   1093.035   137.6358     7.94   0.000     823.1518    1362.919
       _cons |   13509.72   97.32317   138.81   0.000     13318.89    13700.56
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado Domingo, noconstant

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(7, 2669)      =  24822.90
       Model |  6.2870e+11         7  8.9815e+10   Prob > F        =    0.0000
    Residual |  9.6570e+09     2,669  3618227.65   R-squared       =    0.9849
-------------+----------------------------------   Adj R-squared   =    0.9848
       Total |  6.3836e+11     2,676   238550567   Root MSE        =    1902.2

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |   15334.63   97.19604   157.77   0.000     15144.04    15525.22
      Martes |   15848.56   97.19604   163.06   0.000     15657.98    16039.15
   Miercoles |   16002.18   97.32317   164.42   0.000     15811.35    16193.02
      Jueves |   15989.14   97.32317   164.29   0.000     15798.31    16179.98
     Viernes |   15834.96   97.32317   162.70   0.000     15644.13     16025.8
      Sabado |   14602.76   97.32317   150.04   0.000     14411.92    14793.59
     Domingo |   13509.72   97.32317   138.81   0.000     13318.89    13700.56
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. predict dem_mw_d , resid
variable dem_mw_d already defined
r(110);

end of do-file

r(110);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado Domingo, noconstant

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(7, 2669)      =  24822.90
       Model |  6.2870e+11         7  8.9815e+10   Prob > F        =    0.0000
    Residual |  9.6570e+09     2,669  3618227.65   R-squared       =    0.9849
-------------+----------------------------------   Adj R-squared   =    0.9848
       Total |  6.3836e+11     2,676   238550567   Root MSE        =    1902.2

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |   15334.63   97.19604   157.77   0.000     15144.04    15525.22
      Martes |   15848.56   97.19604   163.06   0.000     15657.98    16039.15
   Miercoles |   16002.18   97.32317   164.42   0.000     15811.35    16193.02
      Jueves |   15989.14   97.32317   164.29   0.000     15798.31    16179.98
     Viernes |   15834.96   97.32317   162.70   0.000     15644.13     16025.8
      Sabado |   14602.76   97.32317   150.04   0.000     14411.92    14793.59
     Domingo |   13509.72   97.32317   138.81   0.000     13318.89    13700.56
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. gen dem_mw_d = dem_mw - dem_mw_r_d
variable dem_mw_d already defined
r(110);

end of do-file

r(110);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =     92.35
       Model |  2.0048e+09         6   334138054   Prob > F        =    0.0000
    Residual |  9.6570e+09     2,669  3618227.65   R-squared       =    0.1719
-------------+----------------------------------   Adj R-squared   =    0.1701
       Total |  1.1662e+10     2,675  4359580.53   Root MSE        =    1902.2

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |   1824.908   137.5459    13.27   0.000       1555.2    2094.615
      Martes |   2338.842   137.5459    17.00   0.000     2069.135     2608.55
   Miercoles |   2492.462   137.6358    18.11   0.000     2222.578    2762.345
      Jueves |   2479.421   137.6358    18.01   0.000     2209.537    2749.304
     Viernes |    2325.24   137.6358    16.89   0.000     2055.357    2595.124
      Sabado |   1093.035   137.6358     7.94   0.000     823.1518    1362.919
       _cons |   13509.72   97.32317   138.81   0.000     13318.89    13700.56
------------------------------------------------------------------------------

. predict dem_mw_r_d , xb

. gen dem_mw_d = dem_mw - dem_mw_r_d

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. gen dem_mw_d_ = dem_mw_d + mean(dem_mw)
unknown function mean()
r(133);

end of do-file

r(133);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. predict dem_mw_d , resid
variable dem_mw_d already defined
r(110);

end of do-file

r(110);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =     92.35
       Model |  2.0048e+09         6   334138054   Prob > F        =    0.0000
    Residual |  9.6570e+09     2,669  3618227.65   R-squared       =    0.1719
-------------+----------------------------------   Adj R-squared   =    0.1701
       Total |  1.1662e+10     2,675  4359580.53   Root MSE        =    1902.2

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |   1824.908   137.5459    13.27   0.000       1555.2    2094.615
      Martes |   2338.842   137.5459    17.00   0.000     2069.135     2608.55
   Miercoles |   2492.462   137.6358    18.11   0.000     2222.578    2762.345
      Jueves |   2479.421   137.6358    18.01   0.000     2209.537    2749.304
     Viernes |    2325.24   137.6358    16.89   0.000     2055.357    2595.124
      Sabado |   1093.035   137.6358     7.94   0.000     823.1518    1362.919
       _cons |   13509.72   97.32317   138.81   0.000     13318.89    13700.56
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. su dem_mw

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      dem_mw |      2,676    15303.35    2087.961   9594.113   23123.97

. gen dem_mw_d_ = dem_mw_d + r(mean)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsline dem_mw_d_

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsline dem_mw_d_ dem_mw_
dem_mw_ ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsline dem_mw_d_ dem_mw

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =     92.35
       Model |  2.0048e+09         6   334138054   Prob > F        =    0.0000
    Residual |  9.6570e+09     2,669  3618227.65   R-squared       =    0.1719
-------------+----------------------------------   Adj R-squared   =    0.1701
       Total |  1.1662e+10     2,675  4359580.53   Root MSE        =    1902.2

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |   1824.908   137.5459    13.27   0.000       1555.2    2094.615
      Martes |   2338.842   137.5459    17.00   0.000     2069.135     2608.55
   Miercoles |   2492.462   137.6358    18.11   0.000     2222.578    2762.345
      Jueves |   2479.421   137.6358    18.01   0.000     2209.537    2749.304
     Viernes |    2325.24   137.6358    16.89   0.000     2055.357    2595.124
      Sabado |   1093.035   137.6358     7.94   0.000     823.1518    1362.919
       _cons |   13509.72   97.32317   138.81   0.000     13318.89    13700.56
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. su dem_mw

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      dem_mw |      2,676    15303.35    2087.961   9594.113   23123.97

. gen dem_mw_d_ = dem_mw_d + r(mean)

. 
. 
. foreach num of numlist 1/12 {
  2.     local mes = "`num'"
  3.     gen mes`mes' = month(fecha) == `num'
  4. }

. 
. regress dem_mw_d mes2-mes12

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(11, 2664)     =    118.17
       Model |  3.1669e+09        11   287897826   Prob > F        =    0.0000
    Residual |  6.4902e+09     2,664  2436251.31   R-squared       =    0.3279
-------------+----------------------------------   Adj R-squared   =    0.3252
       Total |  9.6570e+09     2,675  3610111.99   Root MSE        =    1560.8

------------------------------------------------------------------------------
    dem_mw_d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mes2 |  -353.4386   143.6776    -2.46   0.014    -635.1694   -71.70774
        mes3 |  -1476.838   140.3102   -10.53   0.000    -1751.966   -1201.711
        mes4 |  -3217.644   141.4723   -22.74   0.000    -3495.051   -2940.238
        mes5 |  -2448.114   145.2251   -16.86   0.000    -2732.879   -2163.349
        mes6 |  -604.3941   146.5079    -4.13   0.000    -891.6748   -317.1133
        mes7 |  -285.7034   145.2251    -1.97   0.049    -570.4687   -.9380439
        mes8 |  -1458.047   145.2251   -10.04   0.000    -1742.813   -1173.282
        mes9 |  -2543.354   146.5079   -17.36   0.000    -2830.635   -2256.074
       mes10 |  -3070.889   145.2251   -21.15   0.000    -3355.654   -2786.123
       mes11 |   -2184.91   146.5079   -14.91   0.000    -2472.191   -1897.629
       mes12 |  -958.0869   145.2251    -6.60   0.000    -1242.852   -673.3216
       _cons |   1540.414   99.31448    15.51   0.000     1345.673    1735.155
------------------------------------------------------------------------------

. predict dem_mw_dm , resid

. su dem_mw

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      dem_mw |      2,676    15303.35    2087.961   9594.113   23123.97

. gen dem_mw_dm_ = dem_mw_dm + r(mean)

. 
. tsline dem_mw_dm_ dem_mw

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsline dem_mw_dm_ dem_mw if _n<100

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsline dem_mw_dm_ dem_mw if _n<365

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsline dem_mw_dm_ dem_mw if _n<235

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen ldem_mw = ln(dem_mw)

. drop dem_mw

. rename ldem_mw dem_mw

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen ldem_mw = ln(dem_mw)

. drop dem_mw

. rename ldem_mw dem_mw

. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =    106.05
       Model |  9.20258054         6  1.53376342   Prob > F        =    0.0000
    Residual |  38.6009442     2,669  .014462699   R-squared       =    0.1925
-------------+----------------------------------   Adj R-squared   =    0.1907
       Total |  47.8035248     2,675  .017870477   Root MSE        =    .12026

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |    .126301   .0086961    14.52   0.000     .1092492    .1433528
      Martes |    .159739   .0086961    18.37   0.000     .1426872    .1767907
   Miercoles |   .1698521   .0087018    19.52   0.000     .1527892     .186915
      Jueves |   .1691404   .0087018    19.44   0.000     .1520775    .1862033
     Viernes |   .1590311   .0087018    18.28   0.000     .1419682     .176094
      Sabado |    .078554   .0087018     9.03   0.000     .0614911    .0956169
       _cons |   9.503552   .0061531  1544.52   0.000     9.491486    9.515617
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. su dem_mw

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      dem_mw |      2,676    9.626797    .1336805   9.168905   10.04862

. gen dem_mw_d_ = dem_mw_d + r(mean)

. 
. 
. foreach num of numlist 1/12 {
  2.     local mes = "`num'"
  3.     gen mes`mes' = month(fecha) == `num'
  4. }

. 
. regress dem_mw_d mes2-mes12

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(11, 2664)     =    124.69
       Model |  13.1196073        11  1.19269157   Prob > F        =    0.0000
    Residual |  25.4813369     2,664  .009565066   R-squared       =    0.3399
-------------+----------------------------------   Adj R-squared   =    0.3372
       Total |  38.6009442     2,675   .01443026   Root MSE        =     .0978

------------------------------------------------------------------------------
    dem_mw_d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mes2 |  -.0248872   .0090027    -2.76   0.006    -.0425401   -.0072342
        mes3 |  -.0947837   .0087917   -10.78   0.000    -.1120229   -.0775445
        mes4 |  -.2083451   .0088645   -23.50   0.000    -.2257271   -.1909631
        mes5 |  -.1542219   .0090996   -16.95   0.000     -.172065   -.1363788
        mes6 |  -.0348721     .00918    -3.80   0.000    -.0528728   -.0168714
        mes7 |  -.0136055   .0090996    -1.50   0.135    -.0314486    .0042376
        mes8 |   -.086739   .0090996    -9.53   0.000     -.104582   -.0688959
        mes9 |  -.1592859     .00918   -17.35   0.000    -.1772866   -.1412852
       mes10 |  -.1965629   .0090996   -21.60   0.000    -.2144059   -.1787198
       mes11 |  -.1366569     .00918   -14.89   0.000    -.1546576   -.1186562
       mes12 |  -.0601598   .0090996    -6.61   0.000    -.0780029   -.0423167
       _cons |   .0969935   .0062229    15.59   0.000     .0847912    .1091958
------------------------------------------------------------------------------

. predict dem_mw_dm , resid

. su dem_mw

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      dem_mw |      2,676    9.626797    .1336805   9.168905   10.04862

. gen dem_mw_dm_ = dem_mw_dm + r(mean)

. 
. tsline dem_mw_dm_ dem_mw if _n<235

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen ldem_mw = ln(dem_mw)

. drop dem_mw

. rename ldem_mw dem_mw

. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =    106.05
       Model |  9.20258054         6  1.53376342   Prob > F        =    0.0000
    Residual |  38.6009442     2,669  .014462699   R-squared       =    0.1925
-------------+----------------------------------   Adj R-squared   =    0.1907
       Total |  47.8035248     2,675  .017870477   Root MSE        =    .12026

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |    .126301   .0086961    14.52   0.000     .1092492    .1433528
      Martes |    .159739   .0086961    18.37   0.000     .1426872    .1767907
   Miercoles |   .1698521   .0087018    19.52   0.000     .1527892     .186915
      Jueves |   .1691404   .0087018    19.44   0.000     .1520775    .1862033
     Viernes |   .1590311   .0087018    18.28   0.000     .1419682     .176094
      Sabado |    .078554   .0087018     9.03   0.000     .0614911    .0956169
       _cons |   9.503552   .0061531  1544.52   0.000     9.491486    9.515617
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. 
. 
. foreach num of numlist 1/12 {
  2.     local mes = "`num'"
  3.     gen mes`mes' = month(fecha) == `num'
  4. }

. 
. regress dem_mw_d mes2-mes12

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(11, 2664)     =    124.69
       Model |  13.1196073        11  1.19269157   Prob > F        =    0.0000
    Residual |  25.4813369     2,664  .009565066   R-squared       =    0.3399
-------------+----------------------------------   Adj R-squared   =    0.3372
       Total |  38.6009442     2,675   .01443026   Root MSE        =     .0978

------------------------------------------------------------------------------
    dem_mw_d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mes2 |  -.0248872   .0090027    -2.76   0.006    -.0425401   -.0072342
        mes3 |  -.0947837   .0087917   -10.78   0.000    -.1120229   -.0775445
        mes4 |  -.2083451   .0088645   -23.50   0.000    -.2257271   -.1909631
        mes5 |  -.1542219   .0090996   -16.95   0.000     -.172065   -.1363788
        mes6 |  -.0348721     .00918    -3.80   0.000    -.0528728   -.0168714
        mes7 |  -.0136055   .0090996    -1.50   0.135    -.0314486    .0042376
        mes8 |   -.086739   .0090996    -9.53   0.000     -.104582   -.0688959
        mes9 |  -.1592859     .00918   -17.35   0.000    -.1772866   -.1412852
       mes10 |  -.1965629   .0090996   -21.60   0.000    -.2144059   -.1787198
       mes11 |  -.1366569     .00918   -14.89   0.000    -.1546576   -.1186562
       mes12 |  -.0601598   .0090996    -6.61   0.000    -.0780029   -.0423167
       _cons |   .0969935   .0062229    15.59   0.000     .0847912    .1091958
------------------------------------------------------------------------------

. predict dem_mw_dm , resid

. 
. tsline dem_mw_dm_ dem_mw if _n<365
variable dem_mw_dm_ not found
r(111);

end of do-file

r(111);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen ldem_mw = ln(dem_mw)

. drop dem_mw

. rename ldem_mw dem_mw

. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =    106.05
       Model |  9.20258054         6  1.53376342   Prob > F        =    0.0000
    Residual |  38.6009442     2,669  .014462699   R-squared       =    0.1925
-------------+----------------------------------   Adj R-squared   =    0.1907
       Total |  47.8035248     2,675  .017870477   Root MSE        =    .12026

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |    .126301   .0086961    14.52   0.000     .1092492    .1433528
      Martes |    .159739   .0086961    18.37   0.000     .1426872    .1767907
   Miercoles |   .1698521   .0087018    19.52   0.000     .1527892     .186915
      Jueves |   .1691404   .0087018    19.44   0.000     .1520775    .1862033
     Viernes |   .1590311   .0087018    18.28   0.000     .1419682     .176094
      Sabado |    .078554   .0087018     9.03   0.000     .0614911    .0956169
       _cons |   9.503552   .0061531  1544.52   0.000     9.491486    9.515617
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. 
. 
. foreach num of numlist 1/12 {
  2.     local mes = "`num'"
  3.     gen mes`mes' = month(fecha) == `num'
  4. }

. 
. regress dem_mw_d mes2-mes12

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(11, 2664)     =    124.69
       Model |  13.1196073        11  1.19269157   Prob > F        =    0.0000
    Residual |  25.4813369     2,664  .009565066   R-squared       =    0.3399
-------------+----------------------------------   Adj R-squared   =    0.3372
       Total |  38.6009442     2,675   .01443026   Root MSE        =     .0978

------------------------------------------------------------------------------
    dem_mw_d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mes2 |  -.0248872   .0090027    -2.76   0.006    -.0425401   -.0072342
        mes3 |  -.0947837   .0087917   -10.78   0.000    -.1120229   -.0775445
        mes4 |  -.2083451   .0088645   -23.50   0.000    -.2257271   -.1909631
        mes5 |  -.1542219   .0090996   -16.95   0.000     -.172065   -.1363788
        mes6 |  -.0348721     .00918    -3.80   0.000    -.0528728   -.0168714
        mes7 |  -.0136055   .0090996    -1.50   0.135    -.0314486    .0042376
        mes8 |   -.086739   .0090996    -9.53   0.000     -.104582   -.0688959
        mes9 |  -.1592859     .00918   -17.35   0.000    -.1772866   -.1412852
       mes10 |  -.1965629   .0090996   -21.60   0.000    -.2144059   -.1787198
       mes11 |  -.1366569     .00918   -14.89   0.000    -.1546576   -.1186562
       mes12 |  -.0601598   .0090996    -6.61   0.000    -.0780029   -.0423167
       _cons |   .0969935   .0062229    15.59   0.000     .0847912    .1091958
------------------------------------------------------------------------------

. predict dem_mw_dm , resid

. 
. tsline dem_mw_dm dem_mw if _n<365

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen ldem_mw = ln(dem_mw)

. drop dem_mw

. rename ldem_mw dem_mw

. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =    106.05
       Model |  9.20258054         6  1.53376342   Prob > F        =    0.0000
    Residual |  38.6009442     2,669  .014462699   R-squared       =    0.1925
-------------+----------------------------------   Adj R-squared   =    0.1907
       Total |  47.8035248     2,675  .017870477   Root MSE        =    .12026

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |    .126301   .0086961    14.52   0.000     .1092492    .1433528
      Martes |    .159739   .0086961    18.37   0.000     .1426872    .1767907
   Miercoles |   .1698521   .0087018    19.52   0.000     .1527892     .186915
      Jueves |   .1691404   .0087018    19.44   0.000     .1520775    .1862033
     Viernes |   .1590311   .0087018    18.28   0.000     .1419682     .176094
      Sabado |    .078554   .0087018     9.03   0.000     .0614911    .0956169
       _cons |   9.503552   .0061531  1544.52   0.000     9.491486    9.515617
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. 
. 
. foreach num of numlist 1/12 {
  2.     local mes = "`num'"
  3.     gen mes`mes' = month(fecha) == `num'
  4. }

. 
. regress dem_mw mes2-mes12

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(11, 2664)     =     92.13
       Model |  13.1741121        11  1.19764656   Prob > F        =    0.0000
    Residual |  34.6294126     2,664  .012999029   R-squared       =    0.2756
-------------+----------------------------------   Adj R-squared   =    0.2726
       Total |  47.8035248     2,675  .017870477   Root MSE        =    .11401

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mes2 |   -.025241    .010495    -2.41   0.016    -.0458202   -.0046618
        mes3 |  -.0944935   .0102491    -9.22   0.000    -.1145904   -.0743966
        mes4 |  -.2095854   .0103339   -20.28   0.000    -.2298488   -.1893221
        mes5 |  -.1543546   .0106081   -14.55   0.000    -.1751554   -.1335537
        mes6 |  -.0342701   .0107018    -3.20   0.001    -.0552547   -.0132855
        mes7 |  -.0153191   .0106081    -1.44   0.149    -.0361199    .0054818
        mes8 |  -.0858948   .0106081    -8.10   0.000    -.1066957   -.0650939
        mes9 |  -.1598759   .0107018   -14.94   0.000    -.1808605   -.1388913
       mes10 |   -.197899   .0106081   -18.66   0.000    -.2186999   -.1770982
       mes11 |   -.135776   .0107018   -12.69   0.000    -.1567607   -.1147914
       mes12 |  -.0615251   .0106081    -5.80   0.000     -.082326   -.0407242
       _cons |   9.724135   .0072545  1340.43   0.000      9.70991     9.73836
------------------------------------------------------------------------------

. predict dem_mw_m , resid

. gen dem_mw_dm = dem_mw_m + dem_mw_d

. tsline dem_mw_dm dem_mw if _n<365

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen ldem_mw = ln(dem_mw)

. drop dem_mw

. rename ldem_mw dem_mw

. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =    106.05
       Model |  9.20258054         6  1.53376342   Prob > F        =    0.0000
    Residual |  38.6009442     2,669  .014462699   R-squared       =    0.1925
-------------+----------------------------------   Adj R-squared   =    0.1907
       Total |  47.8035248     2,675  .017870477   Root MSE        =    .12026

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |    .126301   .0086961    14.52   0.000     .1092492    .1433528
      Martes |    .159739   .0086961    18.37   0.000     .1426872    .1767907
   Miercoles |   .1698521   .0087018    19.52   0.000     .1527892     .186915
      Jueves |   .1691404   .0087018    19.44   0.000     .1520775    .1862033
     Viernes |   .1590311   .0087018    18.28   0.000     .1419682     .176094
      Sabado |    .078554   .0087018     9.03   0.000     .0614911    .0956169
       _cons |   9.503552   .0061531  1544.52   0.000     9.491486    9.515617
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. 
. 
. foreach num of numlist 1/12 {
  2.     local mes = "`num'"
  3.     gen mes`mes' = month(fecha) == `num'
  4. }

. 
. regress dem_mw_d mes2-mes12

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(11, 2664)     =    124.69
       Model |  13.1196073        11  1.19269157   Prob > F        =    0.0000
    Residual |  25.4813369     2,664  .009565066   R-squared       =    0.3399
-------------+----------------------------------   Adj R-squared   =    0.3372
       Total |  38.6009442     2,675   .01443026   Root MSE        =     .0978

------------------------------------------------------------------------------
    dem_mw_d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mes2 |  -.0248872   .0090027    -2.76   0.006    -.0425401   -.0072342
        mes3 |  -.0947837   .0087917   -10.78   0.000    -.1120229   -.0775445
        mes4 |  -.2083451   .0088645   -23.50   0.000    -.2257271   -.1909631
        mes5 |  -.1542219   .0090996   -16.95   0.000     -.172065   -.1363788
        mes6 |  -.0348721     .00918    -3.80   0.000    -.0528728   -.0168714
        mes7 |  -.0136055   .0090996    -1.50   0.135    -.0314486    .0042376
        mes8 |   -.086739   .0090996    -9.53   0.000     -.104582   -.0688959
        mes9 |  -.1592859     .00918   -17.35   0.000    -.1772866   -.1412852
       mes10 |  -.1965629   .0090996   -21.60   0.000    -.2144059   -.1787198
       mes11 |  -.1366569     .00918   -14.89   0.000    -.1546576   -.1186562
       mes12 |  -.0601598   .0090996    -6.61   0.000    -.0780029   -.0423167
       _cons |   .0969935   .0062229    15.59   0.000     .0847912    .1091958
------------------------------------------------------------------------------

. predict dem_mw_dm , resid

. 
. tsline dem_mw_dm dem_mw if _n<365

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsline dem_mw_dm if _n<365

. 
end of do-file

. ssc install x13as, replace
ssc install: "x13as" not found at SSC, type -findit x13as-
(To find all packages at SSC that start with x, type -ssc describe x-)
r(601);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate edn fecha, gen(edn_)
(1 missing value generated)

. drop edn

. rename edn_ edn

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            37
        from master                        36  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(37 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =     92.35
       Model |  2.0048e+09         6   334138054   Prob > F        =    0.0000
    Residual |  9.6570e+09     2,669  3618227.65   R-squared       =    0.1719
-------------+----------------------------------   Adj R-squared   =    0.1701
       Total |  1.1662e+10     2,675  4359580.53   Root MSE        =    1902.2

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |   1824.908   137.5459    13.27   0.000       1555.2    2094.615
      Martes |   2338.842   137.5459    17.00   0.000     2069.135     2608.55
   Miercoles |   2492.462   137.6358    18.11   0.000     2222.578    2762.345
      Jueves |   2479.421   137.6358    18.01   0.000     2209.537    2749.304
     Viernes |    2325.24   137.6358    16.89   0.000     2055.357    2595.124
      Sabado |   1093.035   137.6358     7.94   0.000     823.1518    1362.919
       _cons |   13509.72   97.32317   138.81   0.000     13318.89    13700.56
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. 
. 
. foreach num of numlist 1/12 {
  2.     local mes = "`num'"
  3.     gen mes`mes' = month(fecha) == `num'
  4. }

. 
. regress dem_mw_d mes2-mes12

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(11, 2664)     =    118.17
       Model |  3.1669e+09        11   287897826   Prob > F        =    0.0000
    Residual |  6.4902e+09     2,664  2436251.31   R-squared       =    0.3279
-------------+----------------------------------   Adj R-squared   =    0.3252
       Total |  9.6570e+09     2,675  3610111.99   Root MSE        =    1560.8

------------------------------------------------------------------------------
    dem_mw_d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mes2 |  -353.4386   143.6776    -2.46   0.014    -635.1694   -71.70774
        mes3 |  -1476.838   140.3102   -10.53   0.000    -1751.966   -1201.711
        mes4 |  -3217.644   141.4723   -22.74   0.000    -3495.051   -2940.238
        mes5 |  -2448.114   145.2251   -16.86   0.000    -2732.879   -2163.349
        mes6 |  -604.3941   146.5079    -4.13   0.000    -891.6748   -317.1133
        mes7 |  -285.7034   145.2251    -1.97   0.049    -570.4687   -.9380439
        mes8 |  -1458.047   145.2251   -10.04   0.000    -1742.813   -1173.282
        mes9 |  -2543.354   146.5079   -17.36   0.000    -2830.635   -2256.074
       mes10 |  -3070.889   145.2251   -21.15   0.000    -3355.654   -2786.123
       mes11 |   -2184.91   146.5079   -14.91   0.000    -2472.191   -1897.629
       mes12 |  -958.0869   145.2251    -6.60   0.000    -1242.852   -673.3216
       _cons |   1540.414   99.31448    15.51   0.000     1345.673    1735.155
------------------------------------------------------------------------------

. predict dem_mw_dm , resid

. 
. tsline dem_mw_dm if _n<365

. 
. *tsline dem_mw_dm
. 
. gen dia = ""
(2,676 missing values generated)

. replace dia = "Lunes" if Lunes == 1
variable dia was str1 now str5
(383 real changes made)

. replace dia = "Martes" if Martes == 1
variable dia was str5 now str6
(383 real changes made)

. replace dia = "Miercoles" if Miercoles == 1
variable dia was str6 now str9
(382 real changes made)

. replace dia = "Jueves" if Jueves == 1
(382 real changes made)

. replace dia = "Viernes" if Viernes == 1
(382 real changes made)

. replace dia = "Sabado" if Sabado == 1
(382 real changes made)

. replace dia = "Domingo" if Domingo == 1
(382 real changes made)

. 
. *graph box dem_mw, over(dia, sort(1)) name(semanabox, replace)
. 
. 
. gen mes = ""
(2,676 missing values generated)

. replace mes = "Ene" if mes1 == 1
variable mes was str1 now str3
(247 real changes made)

. replace mes = "Feb" if mes2 == 1
(226 real changes made)

. replace mes = "Mar" if mes3 == 1
(248 real changes made)

. replace mes = "Abr" if mes4 == 1
(240 real changes made)

. replace mes = "May" if mes5 == 1
(217 real changes made)

. replace mes = "Jun" if mes6 == 1
(210 real changes made)

. replace mes = "Jul" if mes7 == 1
(217 real changes made)

. replace mes = "Ago" if mes8 == 1
(217 real changes made)

. replace mes = "Sep" if mes9 == 1
(210 real changes made)

. replace mes = "Oct" if mes10 == 1
(217 real changes made)

. replace mes = "Nov" if mes11 == 1
(210 real changes made)

. replace mes = "Dic" if mes12 == 1
(217 real changes made)

. 
. *graph box dem_mw, over(mes, sort(1)) name(mesbox, replace)
. 
. gen l_dem_mw_dm = log(dem_mw_dm)
(1,404 missing values generated)

. dfgls ln(dem_mw_dm)
ln:  operator invalid
r(198);

end of do-file

r(198);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsline dem_mw_dm

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. 
. gen l_dem_mw_dm = log(dem_mw_dm)
variable l_dem_mw_dm already defined
r(110);

end of do-file

r(110);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls ln(dem_mw_dm)
ln:  operator invalid
r(198);

end of do-file

r(198);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls dem_mw_dm
 
DF-GLS for dem_mw_dm                                     Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -5.615           -3.480            -2.832            -2.545
    26           -5.784           -3.480            -2.832            -2.546
    25           -5.832           -3.480            -2.833            -2.546
    24           -6.380           -3.480            -2.833            -2.547
    23           -6.437           -3.480            -2.834            -2.547
    22           -6.737           -3.480            -2.834            -2.548
    21           -7.074           -3.480            -2.835            -2.548
    20           -7.498           -3.480            -2.835            -2.548
    19           -7.909           -3.480            -2.836            -2.549
    18           -8.017           -3.480            -2.837            -2.549
    17           -8.515           -3.480            -2.837            -2.550
    16           -8.344           -3.480            -2.838            -2.550
    15           -8.498           -3.480            -2.838            -2.551
    14           -8.566           -3.480            -2.839            -2.551
    13           -8.874           -3.480            -2.839            -2.552
    12           -9.250           -3.480            -2.840            -2.552
    11           -9.233           -3.480            -2.840            -2.553
    10           -9.311           -3.480            -2.841            -2.553
    9           -10.023           -3.480            -2.841            -2.554
    8           -10.339           -3.480            -2.842            -2.554
    7           -11.386           -3.480            -2.842            -2.555
    6           -11.802           -3.480            -2.843            -2.555
    5           -12.551           -3.480            -2.843            -2.555
    4           -13.941           -3.480            -2.844            -2.556
    3           -15.163           -3.480            -2.844            -2.556
    2           -15.944           -3.480            -2.845            -2.557
    1           -19.341           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  835.6328
Min SC   =  13.49988 at lag  2 with RMSE  850.2031
Min MAIC =  13.54814 at lag 27 with RMSE  835.4045

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller dem_mw_dm, trend lags(`r(optlag)') regress // Trend es siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -6.909            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D.dem_mw_dm  |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dem_mw_dm |
         L1. |  -.1426468   .0206458    -6.91   0.000    -.1831306   -.1021631
         LD. |   .1956421   .0262349     7.46   0.000      .144199    .2470853
        L2D. |  -.1935323   .0263766    -7.34   0.000    -.2452533   -.1418112
        L3D. |  -.0659957   .0263429    -2.51   0.012    -.1176507   -.0143407
        L4D. |  -.0883438   .0261197    -3.38   0.001     -.139561   -.0371266
        L5D. |  -.1133413   .0258625    -4.38   0.000    -.1640542   -.0626283
        L6D. |  -.0786964   .0256374    -3.07   0.002     -.128968   -.0284249
        L7D. |  -.0360958   .0254487    -1.42   0.156    -.0859973    .0138058
        L8D. |  -.1050886   .0250661    -4.19   0.000      -.15424   -.0559373
        L9D. |  -.0238549   .0249899    -0.95   0.340     -.072857    .0251471
       L10D. |  -.0770318   .0247075    -3.12   0.002    -.1254799   -.0285837
       L11D. |  -.0229692   .0245315    -0.94   0.349    -.0710723    .0251338
       L12D. |   -.010476   .0242476    -0.43   0.666    -.0580224    .0370705
       L13D. |  -.0477013   .0239535    -1.99   0.047    -.0946709   -.0007316
       L14D. |  -.0489252    .023781    -2.06   0.040    -.0955565   -.0022938
       L15D. |  -.0253508   .0235786    -1.08   0.282    -.0715854    .0208837
       L16D. |  -.0512613   .0231981    -2.21   0.027    -.0967498   -.0057728
       L17D. |  -.0023473   .0229829    -0.10   0.919    -.0474138    .0427191
       L18D. |  -.0846707    .022445    -3.77   0.000    -.1286824    -.040659
       L19D. |  -.0344512   .0222158    -1.55   0.121    -.0780134    .0091109
       L20D. |  -.0658618   .0217934    -3.02   0.003    -.1085959   -.0231277
       L21D. |  -.0651609   .0212419    -3.07   0.002    -.1068136   -.0235083
       L22D. |  -.0443627   .0208118    -2.13   0.033     -.085172   -.0035535
       L23D. |  -.0563949   .0204113    -2.76   0.006    -.0964188   -.0163709
       L24D. |   .0086481   .0193671     0.45   0.655    -.0293283    .0466245
       L25D. |  -.0763109   .0193411    -3.95   0.000    -.1142364   -.0383855
      _trend |   .0727663    .023686     3.07   0.002     .0263212    .1192115
       _cons |  -97.41909   35.89906    -2.71   0.007    -167.8124   -27.02573
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls dem_mw
 
DF-GLS for dem_mw                                        Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -3.496           -3.480            -2.832            -2.545
    26           -3.489           -3.480            -2.832            -2.546
    25           -3.747           -3.480            -2.833            -2.546
    24           -4.068           -3.480            -2.833            -2.547
    23           -4.239           -3.480            -2.834            -2.547
    22           -4.251           -3.480            -2.834            -2.548
    21           -4.633           -3.480            -2.835            -2.548
    20           -3.923           -3.480            -2.835            -2.548
    19           -4.066           -3.480            -2.836            -2.549
    18           -4.531           -3.480            -2.837            -2.549
    17           -5.077           -3.480            -2.837            -2.550
    16           -5.018           -3.480            -2.838            -2.550
    15           -4.918           -3.480            -2.838            -2.551
    14           -5.412           -3.480            -2.839            -2.551
    13           -4.183           -3.480            -2.839            -2.552
    12           -4.457           -3.480            -2.840            -2.552
    11           -5.101           -3.480            -2.840            -2.553
    10           -5.613           -3.480            -2.841            -2.553
    9            -6.273           -3.480            -2.841            -2.554
    8            -6.342           -3.480            -2.842            -2.554
    7            -8.038           -3.480            -2.842            -2.555
    6            -5.585           -3.480            -2.843            -2.555
    5            -6.326           -3.480            -2.843            -2.555
    4            -9.166           -3.480            -2.844            -2.556
    3           -11.649           -3.480            -2.844            -2.556
    2           -12.754           -3.480            -2.845            -2.557
    1           -17.340           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 26 with RMSE  899.6563
Min SC   =  13.68439 at lag 26 with RMSE  899.6563
Min MAIC =  13.63951 at lag 26 with RMSE  899.6563

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller dem_mw, trend lags(`r(optlag)') regress // Trend es siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2649

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.797            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0005

------------------------------------------------------------------------------
D.dem_mw     |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dem_mw |
         L1. |   -.062501   .0130295    -4.80   0.000    -.0880502   -.0369518
         LD. |   .1350103   .0223387     6.04   0.000     .0912071    .1788135
        L2D. |  -.3066953   .0223508   -13.72   0.000    -.3505222   -.2628684
        L3D. |  -.1497861    .023021    -6.51   0.000    -.1949274   -.1046449
        L4D. |  -.1706174   .0231144    -7.38   0.000    -.2159418    -.125293
        L5D. |  -.2135729   .0230911    -9.25   0.000    -.2588515   -.1682943
        L6D. |  -.1526867    .023415    -6.52   0.000    -.1986005    -.106773
        L7D. |   .0998682   .0233818     4.27   0.000     .0540194    .1457169
        L8D. |  -.2099374   .0233247    -9.00   0.000    -.2556741   -.1642006
        L9D. |  -.0370477   .0234699    -1.58   0.115    -.0830691    .0089737
       L10D. |  -.1332209    .023433    -5.69   0.000    -.1791699   -.0872719
       L11D. |  -.0426071   .0235073    -1.81   0.070    -.0887018    .0034876
       L12D. |  -.0430346   .0232859    -1.85   0.065    -.0886952    .0026261
       L13D. |  -.1050129    .023223    -4.52   0.000    -.1505502   -.0594757
       L14D. |   .1616777   .0230764     7.01   0.000     .1164278    .2069275
       L15D. |  -.1055163    .023188    -4.55   0.000     -.150985   -.0600476
       L16D. |  -.0304989    .023188    -1.32   0.189    -.0759676    .0149698
       L17D. |  -.0156181   .0228855    -0.68   0.495    -.0604935    .0292573
       L18D. |  -.0991689   .0227913    -4.35   0.000    -.1438596   -.0544781
       L19D. |  -.0671832   .0222151    -3.02   0.003    -.1107441   -.0236223
       L20D. |  -.1039265   .0222335    -4.67   0.000    -.1475234   -.0603295
       L21D. |   .1367729   .0219147     6.24   0.000     .0938011    .1797448
       L22D. |  -.1153511   .0213998    -5.39   0.000    -.1573133   -.0733889
       L23D. |  -.0315927   .0210459    -1.50   0.133    -.0728611    .0096756
       L24D. |  -.0497267   .0206215    -2.41   0.016    -.0901627   -.0092907
       L25D. |  -.0682745   .0193637    -3.53   0.000    -.1062442   -.0303049
       L26D. |  -.0633239   .0193597    -3.27   0.001    -.1012858   -.0253621
      _trend |   .0316756   .0238633     1.33   0.184    -.0151172    .0784684
       _cons |   910.4221   193.7916     4.70   0.000     530.4219    1290.422
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls edn
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -0.393           -3.480            -2.832            -2.545
    26           -0.393           -3.480            -2.832            -2.546
    25           -0.449           -3.480            -2.833            -2.546
    24           -0.537           -3.480            -2.833            -2.547
    23           -0.594           -3.480            -2.834            -2.547
    22           -0.703           -3.480            -2.834            -2.548
    21           -0.638           -3.480            -2.835            -2.548
    20           -0.577           -3.480            -2.835            -2.548
    19           -0.669           -3.480            -2.836            -2.549
    18           -0.587           -3.480            -2.837            -2.549
    17           -0.415           -3.480            -2.837            -2.550
    16           -0.490           -3.480            -2.838            -2.550
    15           -0.282           -3.480            -2.838            -2.551
    14           -0.413           -3.480            -2.839            -2.551
    13           -0.414           -3.480            -2.839            -2.552
    12           -0.604           -3.480            -2.840            -2.552
    11           -0.585           -3.480            -2.840            -2.553
    10           -0.302           -3.480            -2.841            -2.553
    9            -0.388           -3.480            -2.841            -2.554
    8            -0.605           -3.480            -2.842            -2.554
    7            -0.479           -3.480            -2.842            -2.555
    6            -0.509           -3.480            -2.843            -2.555
    5            -0.522           -3.480            -2.843            -2.555
    4            -0.487           -3.480            -2.844            -2.556
    3            -0.395           -3.480            -2.844            -2.556
    2            -0.589           -3.480            -2.845            -2.557
    1            -0.385           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.664239
Min SC   =  4.381299 at lag 18 with RMSE  8.691742
Min MAIC =  4.337452 at lag 25 with RMSE  8.664239

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller dem_mw, trend lags(`r(optlag)') regress // Trend es siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -5.151            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0001

------------------------------------------------------------------------------
D.dem_mw     |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dem_mw |
         L1. |  -.0668625    .012981    -5.15   0.000    -.0923165   -.0414084
         LD. |   .1440672   .0222047     6.49   0.000     .1005268    .1876077
        L2D. |  -.3005131   .0222998   -13.48   0.000    -.3442402    -.256786
        L3D. |  -.1440914    .022979    -6.27   0.000    -.1891502   -.0990327
        L4D. |  -.1597807   .0229158    -6.97   0.000    -.2047155   -.1148458
        L5D. |  -.2191954   .0230581    -9.51   0.000    -.2644093   -.1739815
        L6D. |  -.1425883   .0232509    -6.13   0.000    -.1881804   -.0969963
        L7D. |   .1086705   .0232666     4.67   0.000     .0630478    .1542933
        L8D. |  -.2002738   .0231772    -8.64   0.000    -.2457213   -.1548263
        L9D. |  -.0323567   .0234617    -1.38   0.168    -.0783621    .0136487
       L10D. |  -.1277646   .0234131    -5.46   0.000    -.1736747   -.0818545
       L11D. |  -.0322269   .0233155    -1.38   0.167    -.0779455    .0134917
       L12D. |  -.0494369   .0232413    -2.13   0.034    -.0950101   -.0038637
       L13D. |  -.0945634   .0230393    -4.10   0.000    -.1397404   -.0493864
       L14D. |   .1692873   .0229903     7.36   0.000     .1242062    .2143683
       L15D. |  -.0991866   .0231447    -4.29   0.000    -.1445703    -.053803
       L16D. |  -.0183716   .0229209    -0.80   0.423    -.0633164    .0265733
       L17D. |  -.0093964   .0228284    -0.41   0.681    -.0541599    .0353672
       L18D. |  -.0817922   .0221946    -3.69   0.000     -.125313   -.0382713
       L19D. |  -.0697838   .0222287    -3.14   0.002    -.1133714   -.0261962
       L20D. |  -.0904078   .0218799    -4.13   0.000    -.1333115   -.0475041
       L21D. |   .1547826   .0212205     7.29   0.000      .113172    .1963932
       L22D. |  -.1010589   .0209878    -4.82   0.000    -.1422132   -.0599046
       L23D. |  -.0177389   .0206527    -0.86   0.390    -.0582362    .0227584
       L24D. |  -.0264063   .0193891    -1.36   0.173    -.0644259    .0116133
       L25D. |  -.0731331   .0193394    -3.78   0.000    -.1110552   -.0352111
      _trend |   .0341029    .023875     1.43   0.153    -.0127129    .0809186
       _cons |   973.9894   193.1327     5.04   0.000     595.2814    1352.697
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls edn, notrend
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            1.574           -2.580            -1.946            -1.624
    26            1.569           -2.580            -1.946            -1.624
    25            1.476           -2.580            -1.947            -1.624
    24            1.333           -2.580            -1.947            -1.625
    23            1.239           -2.580            -1.947            -1.625
    22            1.069           -2.580            -1.948            -1.625
    21            1.165           -2.580            -1.948            -1.626
    20            1.257           -2.580            -1.948            -1.626
    19            1.112           -2.580            -1.949            -1.626
    18            1.237           -2.580            -1.949            -1.626
    17            1.509           -2.580            -1.949            -1.627
    16            1.385           -2.580            -1.950            -1.627
    15            1.726           -2.580            -1.950            -1.627
    14            1.506           -2.580            -1.950            -1.628
    13            1.503           -2.580            -1.951            -1.628
    12            1.202           -2.580            -1.951            -1.628
    11            1.229           -2.580            -1.951            -1.628
    10            1.683           -2.580            -1.952            -1.629
    9             1.539           -2.580            -1.952            -1.629
    8             1.196           -2.580            -1.952            -1.629
    7             1.389           -2.580            -1.953            -1.630
    6             1.340           -2.580            -1.953            -1.630
    5             1.318           -2.580            -1.953            -1.630
    4             1.373           -2.580            -1.953            -1.630
    3             1.516           -2.580            -1.954            -1.631
    2             1.211           -2.580            -1.954            -1.631
    1             1.530           -2.580            -1.954            -1.631
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.663523
Min SC   =  4.381377 at lag 18 with RMSE  8.692082
Min MAIC =  4.338654 at lag 23 with RMSE  8.670986

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls edn
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -0.393           -3.480            -2.832            -2.545
    26           -0.393           -3.480            -2.832            -2.546
    25           -0.449           -3.480            -2.833            -2.546
    24           -0.537           -3.480            -2.833            -2.547
    23           -0.594           -3.480            -2.834            -2.547
    22           -0.703           -3.480            -2.834            -2.548
    21           -0.638           -3.480            -2.835            -2.548
    20           -0.577           -3.480            -2.835            -2.548
    19           -0.669           -3.480            -2.836            -2.549
    18           -0.587           -3.480            -2.837            -2.549
    17           -0.415           -3.480            -2.837            -2.550
    16           -0.490           -3.480            -2.838            -2.550
    15           -0.282           -3.480            -2.838            -2.551
    14           -0.413           -3.480            -2.839            -2.551
    13           -0.414           -3.480            -2.839            -2.552
    12           -0.604           -3.480            -2.840            -2.552
    11           -0.585           -3.480            -2.840            -2.553
    10           -0.302           -3.480            -2.841            -2.553
    9            -0.388           -3.480            -2.841            -2.554
    8            -0.605           -3.480            -2.842            -2.554
    7            -0.479           -3.480            -2.842            -2.555
    6            -0.509           -3.480            -2.843            -2.555
    5            -0.522           -3.480            -2.843            -2.555
    4            -0.487           -3.480            -2.844            -2.556
    3            -0.395           -3.480            -2.844            -2.556
    2            -0.589           -3.480            -2.845            -2.557
    1            -0.385           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.664239
Min SC   =  4.381299 at lag 18 with RMSE  8.691742
Min MAIC =  4.337452 at lag 25 with RMSE  8.664239

. dfuller dem_mw, trend lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -5.151            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0001

------------------------------------------------------------------------------
D.dem_mw     |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dem_mw |
         L1. |  -.0668625    .012981    -5.15   0.000    -.0923165   -.0414084
         LD. |   .1440672   .0222047     6.49   0.000     .1005268    .1876077
        L2D. |  -.3005131   .0222998   -13.48   0.000    -.3442402    -.256786
        L3D. |  -.1440914    .022979    -6.27   0.000    -.1891502   -.0990327
        L4D. |  -.1597807   .0229158    -6.97   0.000    -.2047155   -.1148458
        L5D. |  -.2191954   .0230581    -9.51   0.000    -.2644093   -.1739815
        L6D. |  -.1425883   .0232509    -6.13   0.000    -.1881804   -.0969963
        L7D. |   .1086705   .0232666     4.67   0.000     .0630478    .1542933
        L8D. |  -.2002738   .0231772    -8.64   0.000    -.2457213   -.1548263
        L9D. |  -.0323567   .0234617    -1.38   0.168    -.0783621    .0136487
       L10D. |  -.1277646   .0234131    -5.46   0.000    -.1736747   -.0818545
       L11D. |  -.0322269   .0233155    -1.38   0.167    -.0779455    .0134917
       L12D. |  -.0494369   .0232413    -2.13   0.034    -.0950101   -.0038637
       L13D. |  -.0945634   .0230393    -4.10   0.000    -.1397404   -.0493864
       L14D. |   .1692873   .0229903     7.36   0.000     .1242062    .2143683
       L15D. |  -.0991866   .0231447    -4.29   0.000    -.1445703    -.053803
       L16D. |  -.0183716   .0229209    -0.80   0.423    -.0633164    .0265733
       L17D. |  -.0093964   .0228284    -0.41   0.681    -.0541599    .0353672
       L18D. |  -.0817922   .0221946    -3.69   0.000     -.125313   -.0382713
       L19D. |  -.0697838   .0222287    -3.14   0.002    -.1133714   -.0261962
       L20D. |  -.0904078   .0218799    -4.13   0.000    -.1333115   -.0475041
       L21D. |   .1547826   .0212205     7.29   0.000      .113172    .1963932
       L22D. |  -.1010589   .0209878    -4.82   0.000    -.1422132   -.0599046
       L23D. |  -.0177389   .0206527    -0.86   0.390    -.0582362    .0227584
       L24D. |  -.0264063   .0193891    -1.36   0.173    -.0644259    .0116133
       L25D. |  -.0731331   .0193394    -3.78   0.000    -.1110552   -.0352111
      _trend |   .0341029    .023875     1.43   0.153    -.0127129    .0809186
       _cons |   973.9894   193.1327     5.04   0.000     595.2814    1352.697
------------------------------------------------------------------------------

. dfgls edn, notrend
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            1.574           -2.580            -1.946            -1.624
    26            1.569           -2.580            -1.946            -1.624
    25            1.476           -2.580            -1.947            -1.624
    24            1.333           -2.580            -1.947            -1.625
    23            1.239           -2.580            -1.947            -1.625
    22            1.069           -2.580            -1.948            -1.625
    21            1.165           -2.580            -1.948            -1.626
    20            1.257           -2.580            -1.948            -1.626
    19            1.112           -2.580            -1.949            -1.626
    18            1.237           -2.580            -1.949            -1.626
    17            1.509           -2.580            -1.949            -1.627
    16            1.385           -2.580            -1.950            -1.627
    15            1.726           -2.580            -1.950            -1.627
    14            1.506           -2.580            -1.950            -1.628
    13            1.503           -2.580            -1.951            -1.628
    12            1.202           -2.580            -1.951            -1.628
    11            1.229           -2.580            -1.951            -1.628
    10            1.683           -2.580            -1.952            -1.629
    9             1.539           -2.580            -1.952            -1.629
    8             1.196           -2.580            -1.952            -1.629
    7             1.389           -2.580            -1.953            -1.630
    6             1.340           -2.580            -1.953            -1.630
    5             1.318           -2.580            -1.953            -1.630
    4             1.373           -2.580            -1.953            -1.630
    3             1.516           -2.580            -1.954            -1.631
    2             1.211           -2.580            -1.954            -1.631
    1             1.530           -2.580            -1.954            -1.631
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.663523
Min SC   =  4.381377 at lag 18 with RMSE  8.692082
Min MAIC =  4.338654 at lag 23 with RMSE  8.670986

. dfuller dem_mw, lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.948            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
    D.dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dem_mw |
         L1. |  -.0617831   .0124869    -4.95   0.000    -.0862683   -.0372979
         LD. |   .1398253   .0220095     6.35   0.000     .0966675    .1829832
        L2D. |  -.3047795   .0221033   -13.79   0.000    -.3481211   -.2614378
        L3D. |  -.1480104   .0228191    -6.49   0.000    -.1927557   -.1032651
        L4D. |  -.1634544   .0227755    -7.18   0.000    -.2081142   -.1187945
        L5D. |  -.2228073   .0229236    -9.72   0.000    -.2677574   -.1778572
        L6D. |  -.1459059   .0231392    -6.31   0.000    -.1912789   -.1005328
        L7D. |   .1055617   .0231692     4.56   0.000       .06013    .1509934
        L8D. |  -.2033476   .0230817    -8.81   0.000    -.2486077   -.1580875
        L9D. |  -.0352598   .0233782    -1.51   0.132    -.0811013    .0105817
       L10D. |  -.1305876   .0233342    -5.60   0.000     -.176343   -.0848323
       L11D. |  -.0348704   .0232465    -1.50   0.134    -.0804538    .0107129
       L12D. |  -.0521386   .0231688    -2.25   0.025    -.0975696   -.0067075
       L13D. |  -.0971151   .0229745    -4.23   0.000     -.142165   -.0520652
       L14D. |   .1669275   .0229354     7.28   0.000     .1219541    .2119009
       L15D. |   -.101611   .0230869    -4.40   0.000    -.1468814   -.0563406
       L16D. |  -.0206046    .022872    -0.90   0.368    -.0654537    .0242444
       L17D. |  -.0115817   .0227816    -0.51   0.611    -.0562534    .0330901
       L18D. |  -.0837041   .0221586    -3.78   0.000    -.1271543   -.0402539
       L19D. |  -.0717079   .0221923    -3.23   0.001     -.115224   -.0281918
       L20D. |   -.092074   .0218531    -4.21   0.000    -.1349252   -.0492229
       L21D. |   .1533737   .0212018     7.23   0.000     .1117998    .1949476
       L22D. |  -.1024103   .0209706    -4.88   0.000    -.1435309   -.0612897
       L23D. |  -.0188255   .0206428    -0.91   0.362    -.0593034    .0216523
       L24D. |  -.0271786   .0193855    -1.40   0.161     -.065191    .0108337
       L25D. |  -.0739476   .0193348    -3.82   0.000    -.1118607   -.0360346
             |
       _cons |   942.3164   191.8936     4.91   0.000     566.0382    1318.595
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls ln(edn)
ln:  operator invalid
r(198);

end of do-file

r(198);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls edn
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -0.393           -3.480            -2.832            -2.545
    26           -0.393           -3.480            -2.832            -2.546
    25           -0.449           -3.480            -2.833            -2.546
    24           -0.537           -3.480            -2.833            -2.547
    23           -0.594           -3.480            -2.834            -2.547
    22           -0.703           -3.480            -2.834            -2.548
    21           -0.638           -3.480            -2.835            -2.548
    20           -0.577           -3.480            -2.835            -2.548
    19           -0.669           -3.480            -2.836            -2.549
    18           -0.587           -3.480            -2.837            -2.549
    17           -0.415           -3.480            -2.837            -2.550
    16           -0.490           -3.480            -2.838            -2.550
    15           -0.282           -3.480            -2.838            -2.551
    14           -0.413           -3.480            -2.839            -2.551
    13           -0.414           -3.480            -2.839            -2.552
    12           -0.604           -3.480            -2.840            -2.552
    11           -0.585           -3.480            -2.840            -2.553
    10           -0.302           -3.480            -2.841            -2.553
    9            -0.388           -3.480            -2.841            -2.554
    8            -0.605           -3.480            -2.842            -2.554
    7            -0.479           -3.480            -2.842            -2.555
    6            -0.509           -3.480            -2.843            -2.555
    5            -0.522           -3.480            -2.843            -2.555
    4            -0.487           -3.480            -2.844            -2.556
    3            -0.395           -3.480            -2.844            -2.556
    2            -0.589           -3.480            -2.845            -2.557
    1            -0.385           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.664239
Min SC   =  4.381299 at lag 18 with RMSE  8.691742
Min MAIC =  4.337452 at lag 25 with RMSE  8.664239

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller edn, trend lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -0.252            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9906

------------------------------------------------------------------------------
D.edn        |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edn |
         L1. |  -.0002267   .0009011    -0.25   0.801    -.0019936    .0015402
         LD. |   .2280837    .019541    11.67   0.000     .1897663     .266401
        L2D. |   .1167084   .0200392     5.82   0.000     .0774141    .1560026
        L3D. |  -.1077534   .0201617    -5.34   0.000    -.1472879   -.0682188
        L4D. |   .0395291   .0202693     1.95   0.051    -.0002163    .0792745
        L5D. |   .0230895   .0202838     1.14   0.255    -.0166844    .0628634
        L6D. |  -.0170466   .0202828    -0.84   0.401    -.0568185    .0227253
        L7D. |  -.0196436   .0202747    -0.97   0.333    -.0593996    .0201124
        L8D. |   .0812646   .0203402     4.00   0.000     .0413801    .1211491
        L9D. |  -.0813058   .0203827    -3.99   0.000    -.1212735    -.041338
       L10D. |  -.0904287   .0203609    -4.44   0.000    -.1303538   -.0505036
       L11D. |    .132713   .0203859     6.51   0.000      .092739    .1726871
       L12D. |   .0303239   .0205475     1.48   0.140     -.009967    .0706149
       L13D. |  -.0715693   .0205111    -3.49   0.000     -.111789   -.0313497
       L14D. |  -.0091326   .0206144    -0.44   0.658    -.0495546    .0312895
       L15D. |  -.0757307   .0205211    -3.69   0.000      -.11597   -.0354914
       L16D. |    .097564   .0205044     4.76   0.000     .0573576    .1377703
       L17D. |  -.0579898   .0205405    -2.82   0.005     -.098267   -.0177126
       L18D. |   .0703455   .0205176     3.43   0.001     .0301131    .1105779
       L19D. |   .0402566   .0206773     1.95   0.052    -.0002889    .0808021
       L20D. |  -.0489392   .0207012    -2.36   0.018    -.0895315   -.0083468
       L21D. |   .0199657   .0207306     0.96   0.336    -.0206843    .0606157
       L22D. |   .0305804   .0207379     1.47   0.140    -.0100838    .0712446
       L23D. |  -.0322705   .0206221    -1.56   0.118    -.0727078    .0081668
       L24D. |  -.0153722   .0205154    -0.75   0.454    -.0556002    .0248558
       L25D. |  -.0352116   .0200052    -1.76   0.079    -.0744392     .004016
      _trend |   .0004949   .0002772     1.79   0.074    -.0000487    .0010386
       _cons |  -.3752705   .3596804    -1.04   0.297    -1.080557    .3300157
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls edn, notrend
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            1.574           -2.580            -1.946            -1.624
    26            1.569           -2.580            -1.946            -1.624
    25            1.476           -2.580            -1.947            -1.624
    24            1.333           -2.580            -1.947            -1.625
    23            1.239           -2.580            -1.947            -1.625
    22            1.069           -2.580            -1.948            -1.625
    21            1.165           -2.580            -1.948            -1.626
    20            1.257           -2.580            -1.948            -1.626
    19            1.112           -2.580            -1.949            -1.626
    18            1.237           -2.580            -1.949            -1.626
    17            1.509           -2.580            -1.949            -1.627
    16            1.385           -2.580            -1.950            -1.627
    15            1.726           -2.580            -1.950            -1.627
    14            1.506           -2.580            -1.950            -1.628
    13            1.503           -2.580            -1.951            -1.628
    12            1.202           -2.580            -1.951            -1.628
    11            1.229           -2.580            -1.951            -1.628
    10            1.683           -2.580            -1.952            -1.629
    9             1.539           -2.580            -1.952            -1.629
    8             1.196           -2.580            -1.952            -1.629
    7             1.389           -2.580            -1.953            -1.630
    6             1.340           -2.580            -1.953            -1.630
    5             1.318           -2.580            -1.953            -1.630
    4             1.373           -2.580            -1.953            -1.630
    3             1.516           -2.580            -1.954            -1.631
    2             1.211           -2.580            -1.954            -1.631
    1             1.530           -2.580            -1.954            -1.631
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.663523
Min SC   =  4.381377 at lag 18 with RMSE  8.692082
Min MAIC =  4.338654 at lag 23 with RMSE  8.670986

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller dem_mw, lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.948            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
    D.dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      dem_mw |
         L1. |  -.0617831   .0124869    -4.95   0.000    -.0862683   -.0372979
         LD. |   .1398253   .0220095     6.35   0.000     .0966675    .1829832
        L2D. |  -.3047795   .0221033   -13.79   0.000    -.3481211   -.2614378
        L3D. |  -.1480104   .0228191    -6.49   0.000    -.1927557   -.1032651
        L4D. |  -.1634544   .0227755    -7.18   0.000    -.2081142   -.1187945
        L5D. |  -.2228073   .0229236    -9.72   0.000    -.2677574   -.1778572
        L6D. |  -.1459059   .0231392    -6.31   0.000    -.1912789   -.1005328
        L7D. |   .1055617   .0231692     4.56   0.000       .06013    .1509934
        L8D. |  -.2033476   .0230817    -8.81   0.000    -.2486077   -.1580875
        L9D. |  -.0352598   .0233782    -1.51   0.132    -.0811013    .0105817
       L10D. |  -.1305876   .0233342    -5.60   0.000     -.176343   -.0848323
       L11D. |  -.0348704   .0232465    -1.50   0.134    -.0804538    .0107129
       L12D. |  -.0521386   .0231688    -2.25   0.025    -.0975696   -.0067075
       L13D. |  -.0971151   .0229745    -4.23   0.000     -.142165   -.0520652
       L14D. |   .1669275   .0229354     7.28   0.000     .1219541    .2119009
       L15D. |   -.101611   .0230869    -4.40   0.000    -.1468814   -.0563406
       L16D. |  -.0206046    .022872    -0.90   0.368    -.0654537    .0242444
       L17D. |  -.0115817   .0227816    -0.51   0.611    -.0562534    .0330901
       L18D. |  -.0837041   .0221586    -3.78   0.000    -.1271543   -.0402539
       L19D. |  -.0717079   .0221923    -3.23   0.001     -.115224   -.0281918
       L20D. |   -.092074   .0218531    -4.21   0.000    -.1349252   -.0492229
       L21D. |   .1533737   .0212018     7.23   0.000     .1117998    .1949476
       L22D. |  -.1024103   .0209706    -4.88   0.000    -.1435309   -.0612897
       L23D. |  -.0188255   .0206428    -0.91   0.362    -.0593034    .0216523
       L24D. |  -.0271786   .0193855    -1.40   0.161     -.065191    .0108337
       L25D. |  -.0739476   .0193348    -3.82   0.000    -.1118607   -.0360346
             |
       _cons |   942.3164   191.8936     4.91   0.000     566.0382    1318.595
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls edn
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -0.393           -3.480            -2.832            -2.545
    26           -0.393           -3.480            -2.832            -2.546
    25           -0.449           -3.480            -2.833            -2.546
    24           -0.537           -3.480            -2.833            -2.547
    23           -0.594           -3.480            -2.834            -2.547
    22           -0.703           -3.480            -2.834            -2.548
    21           -0.638           -3.480            -2.835            -2.548
    20           -0.577           -3.480            -2.835            -2.548
    19           -0.669           -3.480            -2.836            -2.549
    18           -0.587           -3.480            -2.837            -2.549
    17           -0.415           -3.480            -2.837            -2.550
    16           -0.490           -3.480            -2.838            -2.550
    15           -0.282           -3.480            -2.838            -2.551
    14           -0.413           -3.480            -2.839            -2.551
    13           -0.414           -3.480            -2.839            -2.552
    12           -0.604           -3.480            -2.840            -2.552
    11           -0.585           -3.480            -2.840            -2.553
    10           -0.302           -3.480            -2.841            -2.553
    9            -0.388           -3.480            -2.841            -2.554
    8            -0.605           -3.480            -2.842            -2.554
    7            -0.479           -3.480            -2.842            -2.555
    6            -0.509           -3.480            -2.843            -2.555
    5            -0.522           -3.480            -2.843            -2.555
    4            -0.487           -3.480            -2.844            -2.556
    3            -0.395           -3.480            -2.844            -2.556
    2            -0.589           -3.480            -2.845            -2.557
    1            -0.385           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.664239
Min SC   =  4.381299 at lag 18 with RMSE  8.691742
Min MAIC =  4.337452 at lag 25 with RMSE  8.664239

. dfuller edn, trend lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -0.252            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9906

------------------------------------------------------------------------------
D.edn        |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edn |
         L1. |  -.0002267   .0009011    -0.25   0.801    -.0019936    .0015402
         LD. |   .2280837    .019541    11.67   0.000     .1897663     .266401
        L2D. |   .1167084   .0200392     5.82   0.000     .0774141    .1560026
        L3D. |  -.1077534   .0201617    -5.34   0.000    -.1472879   -.0682188
        L4D. |   .0395291   .0202693     1.95   0.051    -.0002163    .0792745
        L5D. |   .0230895   .0202838     1.14   0.255    -.0166844    .0628634
        L6D. |  -.0170466   .0202828    -0.84   0.401    -.0568185    .0227253
        L7D. |  -.0196436   .0202747    -0.97   0.333    -.0593996    .0201124
        L8D. |   .0812646   .0203402     4.00   0.000     .0413801    .1211491
        L9D. |  -.0813058   .0203827    -3.99   0.000    -.1212735    -.041338
       L10D. |  -.0904287   .0203609    -4.44   0.000    -.1303538   -.0505036
       L11D. |    .132713   .0203859     6.51   0.000      .092739    .1726871
       L12D. |   .0303239   .0205475     1.48   0.140     -.009967    .0706149
       L13D. |  -.0715693   .0205111    -3.49   0.000     -.111789   -.0313497
       L14D. |  -.0091326   .0206144    -0.44   0.658    -.0495546    .0312895
       L15D. |  -.0757307   .0205211    -3.69   0.000      -.11597   -.0354914
       L16D. |    .097564   .0205044     4.76   0.000     .0573576    .1377703
       L17D. |  -.0579898   .0205405    -2.82   0.005     -.098267   -.0177126
       L18D. |   .0703455   .0205176     3.43   0.001     .0301131    .1105779
       L19D. |   .0402566   .0206773     1.95   0.052    -.0002889    .0808021
       L20D. |  -.0489392   .0207012    -2.36   0.018    -.0895315   -.0083468
       L21D. |   .0199657   .0207306     0.96   0.336    -.0206843    .0606157
       L22D. |   .0305804   .0207379     1.47   0.140    -.0100838    .0712446
       L23D. |  -.0322705   .0206221    -1.56   0.118    -.0727078    .0081668
       L24D. |  -.0153722   .0205154    -0.75   0.454    -.0556002    .0248558
       L25D. |  -.0352116   .0200052    -1.76   0.079    -.0744392     .004016
      _trend |   .0004949   .0002772     1.79   0.074    -.0000487    .0010386
       _cons |  -.3752705   .3596804    -1.04   0.297    -1.080557    .3300157
------------------------------------------------------------------------------

. dfgls edn, notrend
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            1.574           -2.580            -1.946            -1.624
    26            1.569           -2.580            -1.946            -1.624
    25            1.476           -2.580            -1.947            -1.624
    24            1.333           -2.580            -1.947            -1.625
    23            1.239           -2.580            -1.947            -1.625
    22            1.069           -2.580            -1.948            -1.625
    21            1.165           -2.580            -1.948            -1.626
    20            1.257           -2.580            -1.948            -1.626
    19            1.112           -2.580            -1.949            -1.626
    18            1.237           -2.580            -1.949            -1.626
    17            1.509           -2.580            -1.949            -1.627
    16            1.385           -2.580            -1.950            -1.627
    15            1.726           -2.580            -1.950            -1.627
    14            1.506           -2.580            -1.950            -1.628
    13            1.503           -2.580            -1.951            -1.628
    12            1.202           -2.580            -1.951            -1.628
    11            1.229           -2.580            -1.951            -1.628
    10            1.683           -2.580            -1.952            -1.629
    9             1.539           -2.580            -1.952            -1.629
    8             1.196           -2.580            -1.952            -1.629
    7             1.389           -2.580            -1.953            -1.630
    6             1.340           -2.580            -1.953            -1.630
    5             1.318           -2.580            -1.953            -1.630
    4             1.373           -2.580            -1.953            -1.630
    3             1.516           -2.580            -1.954            -1.631
    2             1.211           -2.580            -1.954            -1.631
    1             1.530           -2.580            -1.954            -1.631
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.663523
Min SC   =  4.381377 at lag 18 with RMSE  8.692082
Min MAIC =  4.338654 at lag 23 with RMSE  8.670986

. dfuller edn, lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)              0.975            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9940

------------------------------------------------------------------------------
       D.edn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edn |
         L1. |   .0007134   .0007315     0.98   0.329    -.0007209    .0021478
         LD. |   .2283691   .0195485    11.68   0.000      .190037    .2667011
        L2D. |   .1167189   .0200476     5.82   0.000     .0774083    .1560295
        L3D. |  -.1078763     .02017    -5.35   0.000    -.1474271   -.0683256
        L4D. |   .0395301   .0202777     1.95   0.051    -.0002319    .0792921
        L5D. |   .0230446   .0202923     1.14   0.256    -.0167458    .0628351
        L6D. |  -.0171047   .0202912    -0.84   0.399    -.0568931    .0226837
        L7D. |  -.0196877   .0202831    -0.97   0.332    -.0594603    .0200848
        L8D. |   .0812117   .0203487     3.99   0.000     .0413106    .1211127
        L9D. |   -.081443    .020391    -3.99   0.000    -.1214271   -.0414589
       L10D. |  -.0904692   .0203694    -4.44   0.000     -.130411   -.0505275
       L11D. |   .1327952   .0203943     6.51   0.000     .0928046    .1727859
       L12D. |   .0302466    .020556     1.47   0.141     -.010061    .0705542
       L13D. |  -.0716749   .0205196    -3.49   0.000    -.1119111   -.0314386
       L14D. |  -.0091751   .0206229    -0.44   0.656    -.0496139    .0312638
       L15D. |  -.0757583   .0205297    -3.69   0.000    -.1160143   -.0355023
       L16D. |   .0976315   .0205129     4.76   0.000     .0574084    .1378545
       L17D. |  -.0580426    .020549    -2.82   0.005    -.0983366   -.0177487
       L18D. |   .0703527   .0205262     3.43   0.001     .0301036    .1106019
       L19D. |   .0401518   .0206858     1.94   0.052    -.0004104     .080714
       L20D. |  -.0490803   .0207097    -2.37   0.018    -.0896893   -.0084713
       L21D. |   .0198752   .0207392     0.96   0.338    -.0207916     .060542
       L22D. |   .0304511   .0207464     1.47   0.142    -.0102298     .071132
       L23D. |  -.0324267   .0206305    -1.57   0.116    -.0728805    .0080271
       L24D. |  -.0155032   .0205238    -0.76   0.450    -.0557478    .0247413
       L25D. |  -.0353469   .0200134    -1.77   0.077    -.0745905    .0038967
             |
       _cons |   .1662075   .1934285     0.86   0.390    -.2130803    .5454953
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls edn
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -0.393           -3.480            -2.832            -2.545
    26           -0.393           -3.480            -2.832            -2.546
    25           -0.449           -3.480            -2.833            -2.546
    24           -0.537           -3.480            -2.833            -2.547
    23           -0.594           -3.480            -2.834            -2.547
    22           -0.703           -3.480            -2.834            -2.548
    21           -0.638           -3.480            -2.835            -2.548
    20           -0.577           -3.480            -2.835            -2.548
    19           -0.669           -3.480            -2.836            -2.549
    18           -0.587           -3.480            -2.837            -2.549
    17           -0.415           -3.480            -2.837            -2.550
    16           -0.490           -3.480            -2.838            -2.550
    15           -0.282           -3.480            -2.838            -2.551
    14           -0.413           -3.480            -2.839            -2.551
    13           -0.414           -3.480            -2.839            -2.552
    12           -0.604           -3.480            -2.840            -2.552
    11           -0.585           -3.480            -2.840            -2.553
    10           -0.302           -3.480            -2.841            -2.553
    9            -0.388           -3.480            -2.841            -2.554
    8            -0.605           -3.480            -2.842            -2.554
    7            -0.479           -3.480            -2.842            -2.555
    6            -0.509           -3.480            -2.843            -2.555
    5            -0.522           -3.480            -2.843            -2.555
    4            -0.487           -3.480            -2.844            -2.556
    3            -0.395           -3.480            -2.844            -2.556
    2            -0.589           -3.480            -2.845            -2.557
    1            -0.385           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.664239
Min SC   =  4.381299 at lag 18 with RMSE  8.691742
Min MAIC =  4.337452 at lag 25 with RMSE  8.664239

. dfuller edn, trend lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -0.252            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9906

------------------------------------------------------------------------------
D.edn        |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edn |
         L1. |  -.0002267   .0009011    -0.25   0.801    -.0019936    .0015402
         LD. |   .2280837    .019541    11.67   0.000     .1897663     .266401
        L2D. |   .1167084   .0200392     5.82   0.000     .0774141    .1560026
        L3D. |  -.1077534   .0201617    -5.34   0.000    -.1472879   -.0682188
        L4D. |   .0395291   .0202693     1.95   0.051    -.0002163    .0792745
        L5D. |   .0230895   .0202838     1.14   0.255    -.0166844    .0628634
        L6D. |  -.0170466   .0202828    -0.84   0.401    -.0568185    .0227253
        L7D. |  -.0196436   .0202747    -0.97   0.333    -.0593996    .0201124
        L8D. |   .0812646   .0203402     4.00   0.000     .0413801    .1211491
        L9D. |  -.0813058   .0203827    -3.99   0.000    -.1212735    -.041338
       L10D. |  -.0904287   .0203609    -4.44   0.000    -.1303538   -.0505036
       L11D. |    .132713   .0203859     6.51   0.000      .092739    .1726871
       L12D. |   .0303239   .0205475     1.48   0.140     -.009967    .0706149
       L13D. |  -.0715693   .0205111    -3.49   0.000     -.111789   -.0313497
       L14D. |  -.0091326   .0206144    -0.44   0.658    -.0495546    .0312895
       L15D. |  -.0757307   .0205211    -3.69   0.000      -.11597   -.0354914
       L16D. |    .097564   .0205044     4.76   0.000     .0573576    .1377703
       L17D. |  -.0579898   .0205405    -2.82   0.005     -.098267   -.0177126
       L18D. |   .0703455   .0205176     3.43   0.001     .0301131    .1105779
       L19D. |   .0402566   .0206773     1.95   0.052    -.0002889    .0808021
       L20D. |  -.0489392   .0207012    -2.36   0.018    -.0895315   -.0083468
       L21D. |   .0199657   .0207306     0.96   0.336    -.0206843    .0606157
       L22D. |   .0305804   .0207379     1.47   0.140    -.0100838    .0712446
       L23D. |  -.0322705   .0206221    -1.56   0.118    -.0727078    .0081668
       L24D. |  -.0153722   .0205154    -0.75   0.454    -.0556002    .0248558
       L25D. |  -.0352116   .0200052    -1.76   0.079    -.0744392     .004016
      _trend |   .0004949   .0002772     1.79   0.074    -.0000487    .0010386
       _cons |  -.3752705   .3596804    -1.04   0.297    -1.080557    .3300157
------------------------------------------------------------------------------

. dfgls edn, notrend
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            1.574           -2.580            -1.946            -1.624
    26            1.569           -2.580            -1.946            -1.624
    25            1.476           -2.580            -1.947            -1.624
    24            1.333           -2.580            -1.947            -1.625
    23            1.239           -2.580            -1.947            -1.625
    22            1.069           -2.580            -1.948            -1.625
    21            1.165           -2.580            -1.948            -1.626
    20            1.257           -2.580            -1.948            -1.626
    19            1.112           -2.580            -1.949            -1.626
    18            1.237           -2.580            -1.949            -1.626
    17            1.509           -2.580            -1.949            -1.627
    16            1.385           -2.580            -1.950            -1.627
    15            1.726           -2.580            -1.950            -1.627
    14            1.506           -2.580            -1.950            -1.628
    13            1.503           -2.580            -1.951            -1.628
    12            1.202           -2.580            -1.951            -1.628
    11            1.229           -2.580            -1.951            -1.628
    10            1.683           -2.580            -1.952            -1.629
    9             1.539           -2.580            -1.952            -1.629
    8             1.196           -2.580            -1.952            -1.629
    7             1.389           -2.580            -1.953            -1.630
    6             1.340           -2.580            -1.953            -1.630
    5             1.318           -2.580            -1.953            -1.630
    4             1.373           -2.580            -1.953            -1.630
    3             1.516           -2.580            -1.954            -1.631
    2             1.211           -2.580            -1.954            -1.631
    1             1.530           -2.580            -1.954            -1.631
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.663523
Min SC   =  4.381377 at lag 18 with RMSE  8.692082
Min MAIC =  4.338654 at lag 23 with RMSE  8.670986

. dfuller edn, lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)              0.975            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9940

------------------------------------------------------------------------------
       D.edn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edn |
         L1. |   .0007134   .0007315     0.98   0.329    -.0007209    .0021478
         LD. |   .2283691   .0195485    11.68   0.000      .190037    .2667011
        L2D. |   .1167189   .0200476     5.82   0.000     .0774083    .1560295
        L3D. |  -.1078763     .02017    -5.35   0.000    -.1474271   -.0683256
        L4D. |   .0395301   .0202777     1.95   0.051    -.0002319    .0792921
        L5D. |   .0230446   .0202923     1.14   0.256    -.0167458    .0628351
        L6D. |  -.0171047   .0202912    -0.84   0.399    -.0568931    .0226837
        L7D. |  -.0196877   .0202831    -0.97   0.332    -.0594603    .0200848
        L8D. |   .0812117   .0203487     3.99   0.000     .0413106    .1211127
        L9D. |   -.081443    .020391    -3.99   0.000    -.1214271   -.0414589
       L10D. |  -.0904692   .0203694    -4.44   0.000     -.130411   -.0505275
       L11D. |   .1327952   .0203943     6.51   0.000     .0928046    .1727859
       L12D. |   .0302466    .020556     1.47   0.141     -.010061    .0705542
       L13D. |  -.0716749   .0205196    -3.49   0.000    -.1119111   -.0314386
       L14D. |  -.0091751   .0206229    -0.44   0.656    -.0496139    .0312638
       L15D. |  -.0757583   .0205297    -3.69   0.000    -.1160143   -.0355023
       L16D. |   .0976315   .0205129     4.76   0.000     .0574084    .1378545
       L17D. |  -.0580426    .020549    -2.82   0.005    -.0983366   -.0177487
       L18D. |   .0703527   .0205262     3.43   0.001     .0301036    .1106019
       L19D. |   .0401518   .0206858     1.94   0.052    -.0004104     .080714
       L20D. |  -.0490803   .0207097    -2.37   0.018    -.0896893   -.0084713
       L21D. |   .0198752   .0207392     0.96   0.338    -.0207916     .060542
       L22D. |   .0304511   .0207464     1.47   0.142    -.0102298     .071132
       L23D. |  -.0324267   .0206305    -1.57   0.116    -.0728805    .0080271
       L24D. |  -.0155032   .0205238    -0.76   0.450    -.0557478    .0247413
       L25D. |  -.0353469   .0200134    -1.77   0.077    -.0745905    .0038967
             |
       _cons |   .1662075   .1934285     0.86   0.390    -.2130803    .5454953
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls D.edn
 
DF-GLS for D.edn                                         Number of obs =  2647
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -7.250           -3.480            -2.832            -2.545
    26           -7.781           -3.480            -2.832            -2.546
    25           -8.001           -3.480            -2.833            -2.546
    24           -8.037           -3.480            -2.833            -2.547
    23           -7.986           -3.480            -2.834            -2.547
    22           -8.024           -3.480            -2.834            -2.548
    21           -7.906           -3.480            -2.835            -2.548
    20           -8.322           -3.480            -2.835            -2.548
    19           -8.769           -3.480            -2.836            -2.549
    18           -8.700           -3.480            -2.837            -2.549
    17           -9.260           -3.480            -2.837            -2.550
    16          -10.327           -3.480            -2.838            -2.550
    15          -10.372           -3.480            -2.838            -2.551
    14          -11.947           -3.480            -2.839            -2.551
    13          -11.744           -3.480            -2.839            -2.552
    12          -12.299           -3.480            -2.840            -2.552
    11          -11.736           -3.480            -2.840            -2.553
    10          -12.383           -3.480            -2.841            -2.553
    9           -15.072           -3.480            -2.841            -2.554
    8           -15.447           -3.480            -2.842            -2.554
    7           -14.882           -3.480            -2.842            -2.555
    6           -16.818           -3.480            -2.843            -2.555
    5           -17.921           -3.480            -2.843            -2.555
    4           -19.439           -3.480            -2.844            -2.556
    3           -21.952           -3.480            -2.844            -2.556
    2           -26.279           -3.480            -2.845            -2.557
    1           -28.070           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 27 with RMSE  8.716225
Min SC   =  4.393594 at lag 17 with RMSE  8.758287
Min MAIC =  4.772603 at lag 27 with RMSE  8.716225

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller D.edn, trend lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2647

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -9.716            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D2.edn       |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       D.edn |
         L1. |  -.7464061   .0768241    -9.72   0.000    -.8970484   -.5957639
         LD. |   -.026585   .0754548    -0.35   0.725    -.1745421     .121372
        L2D. |   .0902704    .073944     1.22   0.222    -.0547243     .235265
        L3D. |  -.0172357   .0725449    -0.24   0.812    -.1594869    .1250156
        L4D. |   .0231861   .0711845     0.33   0.745    -.1163975    .1627697
        L5D. |   .0482832    .069862     0.69   0.490    -.0887071    .1852736
        L6D. |    .028482   .0687372     0.41   0.679    -.1063028    .1632669
        L7D. |   .0085134   .0674219     0.13   0.900    -.1236922     .140719
        L8D. |   .0937839   .0658766     1.42   0.155    -.0353916    .2229595
        L9D. |   .0099568   .0645972     0.15   0.878      -.11671    .1366237
       L10D. |  -.0820011   .0631578    -1.30   0.194    -.2058454    .0418431
       L11D. |   .0513279    .061309     0.84   0.403    -.0688911    .1715469
       L12D. |   .0768292   .0597132     1.29   0.198    -.0402607     .193919
       L13D. |   .0063001   .0575753     0.11   0.913    -.1065976    .1191978
       L14D. |  -.0016829   .0556132    -0.03   0.976    -.1107332    .1073673
       L15D. |  -.0712388   .0537167    -1.33   0.185    -.1765703    .0340927
       L16D. |   .0222283   .0521845     0.43   0.670    -.0800987    .1245554
       L17D. |  -.0428538   .0502802    -0.85   0.394    -.1414469    .0557392
       L18D. |   .0326135   .0475355     0.69   0.493    -.0605975    .1258244
       L19D. |   .0762149   .0451812     1.69   0.092    -.0123795    .1648093
       L20D. |   .0237241   .0432729     0.55   0.584    -.0611285    .1085766
       L21D. |   .0433741   .0407717     1.06   0.288    -.0365741    .1233222
       L22D. |   .0760709   .0380354     2.00   0.046     .0014884    .1506535
       L23D. |   .0404425   .0353507     1.14   0.253    -.0288757    .1097608
       L24D. |   .0253964   .0323135     0.79   0.432    -.0379661     .088759
       L25D. |   .0006833   .0284508     0.02   0.981    -.0551051    .0564717
       L26D. |  -.0287333    .025356    -1.13   0.257    -.0784532    .0209865
       L27D. |  -.0415461   .0202308    -2.05   0.040     -.081216   -.0018762
      _trend |   .0004475    .000226     1.98   0.048     4.44e-06    .0008906
       _cons |  -.3447568   .3452518    -1.00   0.318    -1.021751    .3322374
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. var D.edn dem_mw_dm

Vector autoregression

Sample:  05jan2017 - 30apr2024                  Number of obs     =      2,673
Log likelihood =  -31491.33                     AIC               =   23.57002
FPE            =   5.91e+07                     HQIC              =   23.57799
Det(Sigma_ml)  =   5.86e+07                     SBIC              =   23.59206

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
D_edn                 5     8.96393   0.0571   161.7906   0.0000
dem_mw_dm             5     855.858   0.6988   6202.857   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
D_edn        |
         edn |
         LD. |   .2024212   .0192744    10.50   0.000     .1646441    .2401982
        L2D. |   .0897108   .0192951     4.65   0.000     .0518932    .1275284
             |
   dem_mw_dm |
         L1. |   -.000047   .0001957    -0.24   0.810    -.0004306    .0003365
         L2. |   .0000381   .0001956     0.19   0.846    -.0003453    .0004214
             |
       _cons |   .2448016   .1734068     1.41   0.158    -.0950694    .5846727
-------------+----------------------------------------------------------------
dem_mw_dm    |
         edn |
         LD. |  -3.896179   1.840278    -2.12   0.034    -7.503059   -.2893003
        L2D. |  -1.720977   1.842253    -0.93   0.350    -5.331725    1.889772
             |
   dem_mw_dm |
         L1. |   1.032938   .0186835    55.29   0.000      .996319    1.069557
         L2. |  -.2562617   .0186756   -13.72   0.000    -.2928652   -.2196582
             |
       _cons |   2.199598   16.55653     0.13   0.894     -30.2506     34.6498
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. 
. 
. ipolate edn fecha, gen(edn_)
(2 missing values generated)

. ipolate tran fecha, gen(tran_)
(2 missing values generated)

. 
. drop edn

. rename edn_ edn

. 
. drop tran

. rename tran_ tran

. 
. merge 1:1 fecha using tp_final.dta
variable fecha does not uniquely identify observations in the master data
r(459);

end of do-file

r(459);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. drop D

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. ipolate edn fecha, gen(edn_)
(2 missing values generated)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. ipolate tran fecha, gen(tran_)
(2 missing values generated)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. drop edn

. rename edn_ edn

. 
. drop tran

. rename tran_ tran

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. merge 1:1 fecha using tp_final.dta
variable fecha does not uniquely identify observations in the master data
r(459);

end of do-file

r(459);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. save tp_final.dta, replace
file tp_final.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop D

. 
. ipolate edn fecha, gen(edn_)
(2 missing values generated)

. ipolate tran fecha, gen(tran_)
(2 missing values generated)

. 
. drop edn

. rename edn_ edn

. 
. drop tran

. rename tran_ tran

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. keep in 1/2742
(2 observations deleted)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            36
        from master                        35  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. keep in 1/2707
(36 observations deleted)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. drop _merge

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop D

. 
. ipolate edn fecha, gen(edn_)
(2 missing values generated)

. ipolate tran fecha, gen(tran_)
(2 missing values generated)

. 
. drop edn

. rename edn_ edn

. 
. drop tran

. rename tran_ tran

. 
. keep in 1/2742
(2 observations deleted)

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            36
        from master                        35  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(36 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =     92.35
       Model |  2.0048e+09         6   334138054   Prob > F        =    0.0000
    Residual |  9.6570e+09     2,669  3618227.65   R-squared       =    0.1719
-------------+----------------------------------   Adj R-squared   =    0.1701
       Total |  1.1662e+10     2,675  4359580.53   Root MSE        =    1902.2

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |   1824.908   137.5459    13.27   0.000       1555.2    2094.615
      Martes |   2338.842   137.5459    17.00   0.000     2069.135     2608.55
   Miercoles |   2492.462   137.6358    18.11   0.000     2222.578    2762.345
      Jueves |   2479.421   137.6358    18.01   0.000     2209.537    2749.304
     Viernes |    2325.24   137.6358    16.89   0.000     2055.357    2595.124
      Sabado |   1093.035   137.6358     7.94   0.000     823.1518    1362.919
       _cons |   13509.72   97.32317   138.81   0.000     13318.89    13700.56
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. 
. 
. foreach num of numlist 1/12 {
  2.     local mes = "`num'"
  3.     gen mes`mes' = month(fecha) == `num'
  4. }

. 
. regress dem_mw_d mes2-mes12

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(11, 2664)     =    118.17
       Model |  3.1669e+09        11   287897826   Prob > F        =    0.0000
    Residual |  6.4902e+09     2,664  2436251.31   R-squared       =    0.3279
-------------+----------------------------------   Adj R-squared   =    0.3252
       Total |  9.6570e+09     2,675  3610111.99   Root MSE        =    1560.8

------------------------------------------------------------------------------
    dem_mw_d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mes2 |  -353.4386   143.6776    -2.46   0.014    -635.1694   -71.70774
        mes3 |  -1476.838   140.3102   -10.53   0.000    -1751.966   -1201.711
        mes4 |  -3217.644   141.4723   -22.74   0.000    -3495.051   -2940.238
        mes5 |  -2448.114   145.2251   -16.86   0.000    -2732.879   -2163.349
        mes6 |  -604.3941   146.5079    -4.13   0.000    -891.6748   -317.1133
        mes7 |  -285.7034   145.2251    -1.97   0.049    -570.4687   -.9380439
        mes8 |  -1458.047   145.2251   -10.04   0.000    -1742.813   -1173.282
        mes9 |  -2543.354   146.5079   -17.36   0.000    -2830.635   -2256.074
       mes10 |  -3070.889   145.2251   -21.15   0.000    -3355.654   -2786.123
       mes11 |   -2184.91   146.5079   -14.91   0.000    -2472.191   -1897.629
       mes12 |  -958.0869   145.2251    -6.60   0.000    -1242.852   -673.3216
       _cons |   1540.414   99.31448    15.51   0.000     1345.673    1735.155
------------------------------------------------------------------------------

. predict dem_mw_dm , resid

. 
. tsline dem_mw_dm

. 
. *tsline dem_mw_dm
. 
. gen dia = ""
(2,676 missing values generated)

. replace dia = "Lunes" if Lunes == 1
variable dia was str1 now str5
(383 real changes made)

. replace dia = "Martes" if Martes == 1
variable dia was str5 now str6
(383 real changes made)

. replace dia = "Miercoles" if Miercoles == 1
variable dia was str6 now str9
(382 real changes made)

. replace dia = "Jueves" if Jueves == 1
(382 real changes made)

. replace dia = "Viernes" if Viernes == 1
(382 real changes made)

. replace dia = "Sabado" if Sabado == 1
(382 real changes made)

. replace dia = "Domingo" if Domingo == 1
(382 real changes made)

. 
. *graph box dem_mw, over(dia, sort(1)) name(semanabox, replace)
. 
. 
. gen mes = ""
(2,676 missing values generated)

. replace mes = "Ene" if mes1 == 1
variable mes was str1 now str3
(247 real changes made)

. replace mes = "Feb" if mes2 == 1
(226 real changes made)

. replace mes = "Mar" if mes3 == 1
(248 real changes made)

. replace mes = "Abr" if mes4 == 1
(240 real changes made)

. replace mes = "May" if mes5 == 1
(217 real changes made)

. replace mes = "Jun" if mes6 == 1
(210 real changes made)

. replace mes = "Jul" if mes7 == 1
(217 real changes made)

. replace mes = "Ago" if mes8 == 1
(217 real changes made)

. replace mes = "Sep" if mes9 == 1
(210 real changes made)

. replace mes = "Oct" if mes10 == 1
(217 real changes made)

. replace mes = "Nov" if mes11 == 1
(210 real changes made)

. replace mes = "Dic" if mes12 == 1
(217 real changes made)

. 
. *graph box dem_mw, over(mes, sort(1)) name(mesbox, replace)
. 
. 
. 
. dfgls dem_mw_dm
 
DF-GLS for dem_mw_dm                                     Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -5.615           -3.480            -2.832            -2.545
    26           -5.784           -3.480            -2.832            -2.546
    25           -5.832           -3.480            -2.833            -2.546
    24           -6.380           -3.480            -2.833            -2.547
    23           -6.437           -3.480            -2.834            -2.547
    22           -6.737           -3.480            -2.834            -2.548
    21           -7.074           -3.480            -2.835            -2.548
    20           -7.498           -3.480            -2.835            -2.548
    19           -7.909           -3.480            -2.836            -2.549
    18           -8.017           -3.480            -2.837            -2.549
    17           -8.515           -3.480            -2.837            -2.550
    16           -8.344           -3.480            -2.838            -2.550
    15           -8.498           -3.480            -2.838            -2.551
    14           -8.566           -3.480            -2.839            -2.551
    13           -8.874           -3.480            -2.839            -2.552
    12           -9.250           -3.480            -2.840            -2.552
    11           -9.233           -3.480            -2.840            -2.553
    10           -9.311           -3.480            -2.841            -2.553
    9           -10.023           -3.480            -2.841            -2.554
    8           -10.339           -3.480            -2.842            -2.554
    7           -11.386           -3.480            -2.842            -2.555
    6           -11.802           -3.480            -2.843            -2.555
    5           -12.551           -3.480            -2.843            -2.555
    4           -13.941           -3.480            -2.844            -2.556
    3           -15.163           -3.480            -2.844            -2.556
    2           -15.944           -3.480            -2.845            -2.557
    1           -19.341           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  835.6328
Min SC   =  13.49988 at lag  2 with RMSE  850.2031
Min MAIC =  13.54814 at lag 27 with RMSE  835.4045

. dfuller dem_mw_dm, trend lags(`r(optlag)') regress // Trend es siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -6.909            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D.dem_mw_dm  |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dem_mw_dm |
         L1. |  -.1426468   .0206458    -6.91   0.000    -.1831306   -.1021631
         LD. |   .1956421   .0262349     7.46   0.000      .144199    .2470853
        L2D. |  -.1935323   .0263766    -7.34   0.000    -.2452533   -.1418112
        L3D. |  -.0659957   .0263429    -2.51   0.012    -.1176507   -.0143407
        L4D. |  -.0883438   .0261197    -3.38   0.001     -.139561   -.0371266
        L5D. |  -.1133413   .0258625    -4.38   0.000    -.1640542   -.0626283
        L6D. |  -.0786964   .0256374    -3.07   0.002     -.128968   -.0284249
        L7D. |  -.0360958   .0254487    -1.42   0.156    -.0859973    .0138058
        L8D. |  -.1050886   .0250661    -4.19   0.000      -.15424   -.0559373
        L9D. |  -.0238549   .0249899    -0.95   0.340     -.072857    .0251471
       L10D. |  -.0770318   .0247075    -3.12   0.002    -.1254799   -.0285837
       L11D. |  -.0229692   .0245315    -0.94   0.349    -.0710723    .0251338
       L12D. |   -.010476   .0242476    -0.43   0.666    -.0580224    .0370705
       L13D. |  -.0477013   .0239535    -1.99   0.047    -.0946709   -.0007316
       L14D. |  -.0489252    .023781    -2.06   0.040    -.0955565   -.0022938
       L15D. |  -.0253508   .0235786    -1.08   0.282    -.0715854    .0208837
       L16D. |  -.0512613   .0231981    -2.21   0.027    -.0967498   -.0057728
       L17D. |  -.0023473   .0229829    -0.10   0.919    -.0474138    .0427191
       L18D. |  -.0846707    .022445    -3.77   0.000    -.1286824    -.040659
       L19D. |  -.0344512   .0222158    -1.55   0.121    -.0780134    .0091109
       L20D. |  -.0658618   .0217934    -3.02   0.003    -.1085959   -.0231277
       L21D. |  -.0651609   .0212419    -3.07   0.002    -.1068136   -.0235083
       L22D. |  -.0443627   .0208118    -2.13   0.033     -.085172   -.0035535
       L23D. |  -.0563949   .0204113    -2.76   0.006    -.0964188   -.0163709
       L24D. |   .0086481   .0193671     0.45   0.655    -.0293283    .0466245
       L25D. |  -.0763109   .0193411    -3.95   0.000    -.1142364   -.0383855
      _trend |   .0727663    .023686     3.07   0.002     .0263212    .1192115
       _cons |  -97.41909   35.89906    -2.71   0.007    -167.8124   -27.02573
------------------------------------------------------------------------------

. // Rechazamos H0; no hay raiz unitaria. Integrada de orden I(0)
. 
. 
. dfgls edn
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -0.393           -3.480            -2.832            -2.545
    26           -0.393           -3.480            -2.832            -2.546
    25           -0.449           -3.480            -2.833            -2.546
    24           -0.537           -3.480            -2.833            -2.547
    23           -0.594           -3.480            -2.834            -2.547
    22           -0.703           -3.480            -2.834            -2.548
    21           -0.638           -3.480            -2.835            -2.548
    20           -0.577           -3.480            -2.835            -2.548
    19           -0.669           -3.480            -2.836            -2.549
    18           -0.587           -3.480            -2.837            -2.549
    17           -0.415           -3.480            -2.837            -2.550
    16           -0.490           -3.480            -2.838            -2.550
    15           -0.282           -3.480            -2.838            -2.551
    14           -0.413           -3.480            -2.839            -2.551
    13           -0.414           -3.480            -2.839            -2.552
    12           -0.604           -3.480            -2.840            -2.552
    11           -0.585           -3.480            -2.840            -2.553
    10           -0.302           -3.480            -2.841            -2.553
    9            -0.388           -3.480            -2.841            -2.554
    8            -0.605           -3.480            -2.842            -2.554
    7            -0.479           -3.480            -2.842            -2.555
    6            -0.509           -3.480            -2.843            -2.555
    5            -0.522           -3.480            -2.843            -2.555
    4            -0.487           -3.480            -2.844            -2.556
    3            -0.395           -3.480            -2.844            -2.556
    2            -0.589           -3.480            -2.845            -2.557
    1            -0.385           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.664239
Min SC   =  4.381299 at lag 18 with RMSE  8.691742
Min MAIC =  4.337452 at lag 25 with RMSE  8.664239

. dfuller edn, trend lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -0.252            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9906

------------------------------------------------------------------------------
D.edn        |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edn |
         L1. |  -.0002267   .0009011    -0.25   0.801    -.0019936    .0015402
         LD. |   .2280837    .019541    11.67   0.000     .1897663     .266401
        L2D. |   .1167084   .0200392     5.82   0.000     .0774141    .1560026
        L3D. |  -.1077534   .0201617    -5.34   0.000    -.1472879   -.0682188
        L4D. |   .0395291   .0202693     1.95   0.051    -.0002163    .0792745
        L5D. |   .0230895   .0202838     1.14   0.255    -.0166844    .0628634
        L6D. |  -.0170466   .0202828    -0.84   0.401    -.0568185    .0227253
        L7D. |  -.0196436   .0202747    -0.97   0.333    -.0593996    .0201124
        L8D. |   .0812646   .0203402     4.00   0.000     .0413801    .1211491
        L9D. |  -.0813058   .0203827    -3.99   0.000    -.1212735    -.041338
       L10D. |  -.0904287   .0203609    -4.44   0.000    -.1303538   -.0505036
       L11D. |    .132713   .0203859     6.51   0.000      .092739    .1726871
       L12D. |   .0303239   .0205475     1.48   0.140     -.009967    .0706149
       L13D. |  -.0715693   .0205111    -3.49   0.000     -.111789   -.0313497
       L14D. |  -.0091326   .0206144    -0.44   0.658    -.0495546    .0312895
       L15D. |  -.0757307   .0205211    -3.69   0.000      -.11597   -.0354914
       L16D. |    .097564   .0205044     4.76   0.000     .0573576    .1377703
       L17D. |  -.0579898   .0205405    -2.82   0.005     -.098267   -.0177126
       L18D. |   .0703455   .0205176     3.43   0.001     .0301131    .1105779
       L19D. |   .0402566   .0206773     1.95   0.052    -.0002889    .0808021
       L20D. |  -.0489392   .0207012    -2.36   0.018    -.0895315   -.0083468
       L21D. |   .0199657   .0207306     0.96   0.336    -.0206843    .0606157
       L22D. |   .0305804   .0207379     1.47   0.140    -.0100838    .0712446
       L23D. |  -.0322705   .0206221    -1.56   0.118    -.0727078    .0081668
       L24D. |  -.0153722   .0205154    -0.75   0.454    -.0556002    .0248558
       L25D. |  -.0352116   .0200052    -1.76   0.079    -.0744392     .004016
      _trend |   .0004949   .0002772     1.79   0.074    -.0000487    .0010386
       _cons |  -.3752705   .3596804    -1.04   0.297    -1.080557    .3300157
------------------------------------------------------------------------------

. dfgls edn, notrend
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            1.574           -2.580            -1.946            -1.624
    26            1.569           -2.580            -1.946            -1.624
    25            1.476           -2.580            -1.947            -1.624
    24            1.333           -2.580            -1.947            -1.625
    23            1.239           -2.580            -1.947            -1.625
    22            1.069           -2.580            -1.948            -1.625
    21            1.165           -2.580            -1.948            -1.626
    20            1.257           -2.580            -1.948            -1.626
    19            1.112           -2.580            -1.949            -1.626
    18            1.237           -2.580            -1.949            -1.626
    17            1.509           -2.580            -1.949            -1.627
    16            1.385           -2.580            -1.950            -1.627
    15            1.726           -2.580            -1.950            -1.627
    14            1.506           -2.580            -1.950            -1.628
    13            1.503           -2.580            -1.951            -1.628
    12            1.202           -2.580            -1.951            -1.628
    11            1.229           -2.580            -1.951            -1.628
    10            1.683           -2.580            -1.952            -1.629
    9             1.539           -2.580            -1.952            -1.629
    8             1.196           -2.580            -1.952            -1.629
    7             1.389           -2.580            -1.953            -1.630
    6             1.340           -2.580            -1.953            -1.630
    5             1.318           -2.580            -1.953            -1.630
    4             1.373           -2.580            -1.953            -1.630
    3             1.516           -2.580            -1.954            -1.631
    2             1.211           -2.580            -1.954            -1.631
    1             1.530           -2.580            -1.954            -1.631
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.663523
Min SC   =  4.381377 at lag 18 with RMSE  8.692082
Min MAIC =  4.338654 at lag 23 with RMSE  8.670986

. dfuller edn, lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)              0.975            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9940

------------------------------------------------------------------------------
       D.edn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edn |
         L1. |   .0007134   .0007315     0.98   0.329    -.0007209    .0021478
         LD. |   .2283691   .0195485    11.68   0.000      .190037    .2667011
        L2D. |   .1167189   .0200476     5.82   0.000     .0774083    .1560295
        L3D. |  -.1078763     .02017    -5.35   0.000    -.1474271   -.0683256
        L4D. |   .0395301   .0202777     1.95   0.051    -.0002319    .0792921
        L5D. |   .0230446   .0202923     1.14   0.256    -.0167458    .0628351
        L6D. |  -.0171047   .0202912    -0.84   0.399    -.0568931    .0226837
        L7D. |  -.0196877   .0202831    -0.97   0.332    -.0594603    .0200848
        L8D. |   .0812117   .0203487     3.99   0.000     .0413106    .1211127
        L9D. |   -.081443    .020391    -3.99   0.000    -.1214271   -.0414589
       L10D. |  -.0904692   .0203694    -4.44   0.000     -.130411   -.0505275
       L11D. |   .1327952   .0203943     6.51   0.000     .0928046    .1727859
       L12D. |   .0302466    .020556     1.47   0.141     -.010061    .0705542
       L13D. |  -.0716749   .0205196    -3.49   0.000    -.1119111   -.0314386
       L14D. |  -.0091751   .0206229    -0.44   0.656    -.0496139    .0312638
       L15D. |  -.0757583   .0205297    -3.69   0.000    -.1160143   -.0355023
       L16D. |   .0976315   .0205129     4.76   0.000     .0574084    .1378545
       L17D. |  -.0580426    .020549    -2.82   0.005    -.0983366   -.0177487
       L18D. |   .0703527   .0205262     3.43   0.001     .0301036    .1106019
       L19D. |   .0401518   .0206858     1.94   0.052    -.0004104     .080714
       L20D. |  -.0490803   .0207097    -2.37   0.018    -.0896893   -.0084713
       L21D. |   .0198752   .0207392     0.96   0.338    -.0207916     .060542
       L22D. |   .0304511   .0207464     1.47   0.142    -.0102298     .071132
       L23D. |  -.0324267   .0206305    -1.57   0.116    -.0728805    .0080271
       L24D. |  -.0155032   .0205238    -0.76   0.450    -.0557478    .0247413
       L25D. |  -.0353469   .0200134    -1.77   0.077    -.0745905    .0038967
             |
       _cons |   .1662075   .1934285     0.86   0.390    -.2130803    .5454953
------------------------------------------------------------------------------

. // No rechazamos H0. Hay raiz unitaria
. 
. dfgls D.edn
 
DF-GLS for D.edn                                         Number of obs =  2647
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -7.250           -3.480            -2.832            -2.545
    26           -7.781           -3.480            -2.832            -2.546
    25           -8.001           -3.480            -2.833            -2.546
    24           -8.037           -3.480            -2.833            -2.547
    23           -7.986           -3.480            -2.834            -2.547
    22           -8.024           -3.480            -2.834            -2.548
    21           -7.906           -3.480            -2.835            -2.548
    20           -8.322           -3.480            -2.835            -2.548
    19           -8.769           -3.480            -2.836            -2.549
    18           -8.700           -3.480            -2.837            -2.549
    17           -9.260           -3.480            -2.837            -2.550
    16          -10.327           -3.480            -2.838            -2.550
    15          -10.372           -3.480            -2.838            -2.551
    14          -11.947           -3.480            -2.839            -2.551
    13          -11.744           -3.480            -2.839            -2.552
    12          -12.299           -3.480            -2.840            -2.552
    11          -11.736           -3.480            -2.840            -2.553
    10          -12.383           -3.480            -2.841            -2.553
    9           -15.072           -3.480            -2.841            -2.554
    8           -15.447           -3.480            -2.842            -2.554
    7           -14.882           -3.480            -2.842            -2.555
    6           -16.818           -3.480            -2.843            -2.555
    5           -17.921           -3.480            -2.843            -2.555
    4           -19.439           -3.480            -2.844            -2.556
    3           -21.952           -3.480            -2.844            -2.556
    2           -26.279           -3.480            -2.845            -2.557
    1           -28.070           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 27 with RMSE  8.716225
Min SC   =  4.393594 at lag 17 with RMSE  8.758287
Min MAIC =  4.772603 at lag 27 with RMSE  8.716225

. dfuller D.edn, trend lags(`r(optlag)') regress // Trend es siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2647

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -9.716            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D2.edn       |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       D.edn |
         L1. |  -.7464061   .0768241    -9.72   0.000    -.8970484   -.5957639
         LD. |   -.026585   .0754548    -0.35   0.725    -.1745421     .121372
        L2D. |   .0902704    .073944     1.22   0.222    -.0547243     .235265
        L3D. |  -.0172357   .0725449    -0.24   0.812    -.1594869    .1250156
        L4D. |   .0231861   .0711845     0.33   0.745    -.1163975    .1627697
        L5D. |   .0482832    .069862     0.69   0.490    -.0887071    .1852736
        L6D. |    .028482   .0687372     0.41   0.679    -.1063028    .1632669
        L7D. |   .0085134   .0674219     0.13   0.900    -.1236922     .140719
        L8D. |   .0937839   .0658766     1.42   0.155    -.0353916    .2229595
        L9D. |   .0099568   .0645972     0.15   0.878      -.11671    .1366237
       L10D. |  -.0820011   .0631578    -1.30   0.194    -.2058454    .0418431
       L11D. |   .0513279    .061309     0.84   0.403    -.0688911    .1715469
       L12D. |   .0768292   .0597132     1.29   0.198    -.0402607     .193919
       L13D. |   .0063001   .0575753     0.11   0.913    -.1065976    .1191978
       L14D. |  -.0016829   .0556132    -0.03   0.976    -.1107332    .1073673
       L15D. |  -.0712388   .0537167    -1.33   0.185    -.1765703    .0340927
       L16D. |   .0222283   .0521845     0.43   0.670    -.0800987    .1245554
       L17D. |  -.0428538   .0502802    -0.85   0.394    -.1414469    .0557392
       L18D. |   .0326135   .0475355     0.69   0.493    -.0605975    .1258244
       L19D. |   .0762149   .0451812     1.69   0.092    -.0123795    .1648093
       L20D. |   .0237241   .0432729     0.55   0.584    -.0611285    .1085766
       L21D. |   .0433741   .0407717     1.06   0.288    -.0365741    .1233222
       L22D. |   .0760709   .0380354     2.00   0.046     .0014884    .1506535
       L23D. |   .0404425   .0353507     1.14   0.253    -.0288757    .1097608
       L24D. |   .0253964   .0323135     0.79   0.432    -.0379661     .088759
       L25D. |   .0006833   .0284508     0.02   0.981    -.0551051    .0564717
       L26D. |  -.0287333    .025356    -1.13   0.257    -.0784532    .0209865
       L27D. |  -.0415461   .0202308    -2.05   0.040     -.081216   -.0018762
      _trend |   .0004475    .000226     1.98   0.048     4.44e-06    .0008906
       _cons |  -.3447568   .3452518    -1.00   0.318    -1.021751    .3322374
------------------------------------------------------------------------------

. // Rechazamos H0; es I(1)
. 
. 
. var D.edn dem_mw_dm

Vector autoregression

Sample:  05jan2017 - 30apr2024                  Number of obs     =      2,673
Log likelihood =  -31491.33                     AIC               =   23.57002
FPE            =   5.91e+07                     HQIC              =   23.57799
Det(Sigma_ml)  =   5.86e+07                     SBIC              =   23.59206

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
D_edn                 5     8.96393   0.0571   161.7906   0.0000
dem_mw_dm             5     855.858   0.6988   6202.857   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
D_edn        |
         edn |
         LD. |   .2024212   .0192744    10.50   0.000     .1646441    .2401982
        L2D. |   .0897108   .0192951     4.65   0.000     .0518932    .1275284
             |
   dem_mw_dm |
         L1. |   -.000047   .0001957    -0.24   0.810    -.0004306    .0003365
         L2. |   .0000381   .0001956     0.19   0.846    -.0003453    .0004214
             |
       _cons |   .2448016   .1734068     1.41   0.158    -.0950694    .5846727
-------------+----------------------------------------------------------------
dem_mw_dm    |
         edn |
         LD. |  -3.896179   1.840278    -2.12   0.034    -7.503059   -.2893003
        L2D. |  -1.720977   1.842253    -0.93   0.350    -5.331725    1.889772
             |
   dem_mw_dm |
         L1. |   1.032938   .0186835    55.29   0.000      .996319    1.069557
         L2. |  -.2562617   .0186756   -13.72   0.000    -.2928652   -.2196582
             |
       _cons |   2.199598   16.55653     0.13   0.894     -30.2506     34.6498
------------------------------------------------------------------------------

. 
. graph box dem_mw_dm, over(dia, sort(1)) name(semanabox_des, replace)

. graph box dem_mw_dm, over(mes, sort(1)) name(mesbox_des, replace)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls tran
 
DF-GLS for tran                                          Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            0.205           -3.480            -2.832            -2.545
    26            0.178           -3.480            -2.832            -2.546
    25            0.344           -3.480            -2.833            -2.546
    24            0.249           -3.480            -2.833            -2.547
    23            0.349           -3.480            -2.834            -2.547
    22            0.493           -3.480            -2.834            -2.548
    21            0.298           -3.480            -2.835            -2.548
    20           -0.173           -3.480            -2.835            -2.548
    19            0.417           -3.480            -2.836            -2.549
    18            0.285           -3.480            -2.837            -2.549
    17            0.205           -3.480            -2.837            -2.550
    16            0.189           -3.480            -2.838            -2.550
    15            0.328           -3.480            -2.838            -2.551
    14            0.293           -3.480            -2.839            -2.551
    13            0.353           -3.480            -2.839            -2.552
    12            0.104           -3.480            -2.840            -2.552
    11           -0.086           -3.480            -2.840            -2.553
    10            0.220           -3.480            -2.841            -2.553
    9             0.071           -3.480            -2.841            -2.554
    8             0.230           -3.480            -2.842            -2.554
    7             0.195           -3.480            -2.842            -2.555
    6            -0.031           -3.480            -2.843            -2.555
    5            -0.101           -3.480            -2.843            -2.555
    4            -0.066           -3.480            -2.844            -2.556
    3             0.073           -3.480            -2.844            -2.556
    2             0.306           -3.480            -2.845            -2.557
    1             0.382           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 26 with RMSE  7.915365
Min SC   =  4.212917 at lag 21 with RMSE  7.954342
Min MAIC =  4.157275 at lag 26 with RMSE  7.915365

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls tran
 
DF-GLS for tran                                          Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            0.205           -3.480            -2.832            -2.545
    26            0.178           -3.480            -2.832            -2.546
    25            0.344           -3.480            -2.833            -2.546
    24            0.249           -3.480            -2.833            -2.547
    23            0.349           -3.480            -2.834            -2.547
    22            0.493           -3.480            -2.834            -2.548
    21            0.298           -3.480            -2.835            -2.548
    20           -0.173           -3.480            -2.835            -2.548
    19            0.417           -3.480            -2.836            -2.549
    18            0.285           -3.480            -2.837            -2.549
    17            0.205           -3.480            -2.837            -2.550
    16            0.189           -3.480            -2.838            -2.550
    15            0.328           -3.480            -2.838            -2.551
    14            0.293           -3.480            -2.839            -2.551
    13            0.353           -3.480            -2.839            -2.552
    12            0.104           -3.480            -2.840            -2.552
    11           -0.086           -3.480            -2.840            -2.553
    10            0.220           -3.480            -2.841            -2.553
    9             0.071           -3.480            -2.841            -2.554
    8             0.230           -3.480            -2.842            -2.554
    7             0.195           -3.480            -2.842            -2.555
    6            -0.031           -3.480            -2.843            -2.555
    5            -0.101           -3.480            -2.843            -2.555
    4            -0.066           -3.480            -2.844            -2.556
    3             0.073           -3.480            -2.844            -2.556
    2             0.306           -3.480            -2.845            -2.557
    1             0.382           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 26 with RMSE  7.915365
Min SC   =  4.212917 at lag 21 with RMSE  7.954342
Min MAIC =  4.157275 at lag 26 with RMSE  7.915365

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller tran, trend lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2649

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)              1.003            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 1.0000

------------------------------------------------------------------------------
D.tran       |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        tran |
         L1. |   .0007065   .0007046     1.00   0.316     -.000675    .0020881
         LD. |   .4244415   .0195522    21.71   0.000     .3861022    .4627809
        L2D. |  -.0022626    .021201    -0.11   0.915    -.0438349    .0393097
        L3D. |   .0500375   .0211911     2.36   0.018     .0084844    .0915906
        L4D. |   .0616131   .0212158     2.90   0.004     .0200116    .1032145
        L5D. |   .0231587   .0212625     1.09   0.276    -.0185342    .0648516
        L6D. |  -.0291164   .0212176    -1.37   0.170    -.0707213    .0124886
        L7D. |  -.0653264   .0210088    -3.11   0.002    -.1065219    -.024131
        L8D. |  -.0411551   .0210251    -1.96   0.050    -.0823826    .0000724
        L9D. |   .0608753   .0210611     2.89   0.004     .0195772    .1021733
       L10D. |  -.0728825   .0210959    -3.45   0.001    -.1142488   -.0315162
       L11D. |   .1520336   .0211555     7.19   0.000     .1105503    .1935169
       L12D. |  -.0469957   .0213604    -2.20   0.028    -.0888806   -.0051107
       L13D. |   -.108799   .0214579    -5.07   0.000    -.1508751   -.0667229
       L14D. |   .0267225   .0215943     1.24   0.216    -.0156212    .0690661
       L15D. |  -.0488789   .0215797    -2.27   0.024     -.091194   -.0065638
       L16D. |   .0530777   .0213699     2.48   0.013      .011174    .0949813
       L17D. |  -.0042474   .0213693    -0.20   0.842    -.0461499    .0376552
       L18D. |  -.0021982   .0213037    -0.10   0.918    -.0439721    .0395756
       L19D. |  -.1066986   .0213081    -5.01   0.000    -.1484809   -.0649163
       L20D. |   .2168264   .0214553    10.11   0.000     .1747554    .2588973
       L21D. |  -.1159005   .0218715    -5.30   0.000    -.1587878   -.0730132
       L22D. |  -.0773631   .0220448    -3.51   0.000    -.1205901   -.0341362
       L23D. |   .0257903   .0221065     1.17   0.243    -.0175577    .0691382
       L24D. |   .0412984   .0221009     1.87   0.062    -.0020386    .0846354
       L25D. |  -.0595609   .0221177    -2.69   0.007    -.1029309    -.016191
       L26D. |   .0584327   .0207731     2.81   0.005     .0176994     .099166
      _trend |   .0003906   .0002485     1.57   0.116    -.0000967    .0008778
       _cons |  -.3332107   .3283464    -1.01   0.310    -.9770553    .3106339
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls tran, notrend
 
DF-GLS for tran                                          Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            2.762           -2.580            -1.946            -1.624
    26            2.706           -2.580            -1.946            -1.624
    25            2.996           -2.580            -1.947            -1.624
    24            2.816           -2.580            -1.947            -1.625
    23            2.980           -2.580            -1.947            -1.625
    22            3.222           -2.580            -1.948            -1.625
    21            2.865           -2.580            -1.948            -1.626
    20            2.062           -2.580            -1.948            -1.626
    19            3.047           -2.580            -1.949            -1.626
    18            2.805           -2.580            -1.949            -1.626
    17            2.657           -2.580            -1.949            -1.627
    16            2.623           -2.580            -1.950            -1.627
    15            2.859           -2.580            -1.950            -1.627
    14            2.790           -2.580            -1.950            -1.628
    13            2.890           -2.580            -1.951            -1.628
    12            2.437           -2.580            -1.951            -1.628
    11            2.112           -2.580            -1.951            -1.628
    10            2.634           -2.580            -1.952            -1.629
    9             2.372           -2.580            -1.952            -1.629
    8             2.641           -2.580            -1.952            -1.629
    7             2.575           -2.580            -1.953            -1.630
    6             2.190           -2.580            -1.953            -1.630
    5             2.070           -2.580            -1.953            -1.630
    4             2.125           -2.580            -1.953            -1.630
    3             2.346           -2.580            -1.954            -1.631
    2             2.731           -2.580            -1.954            -1.631
    1             2.856           -2.580            -1.954            -1.631
 
Opt Lag (Ng-Perron seq t) = 26 with RMSE  7.907222
Min SC   =  4.210202 at lag 22 with RMSE   7.93174
Min MAIC =  4.162306 at lag 26 with RMSE  7.907222

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller tran, lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2649

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)              2.223            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9989

------------------------------------------------------------------------------
      D.tran |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        tran |
         L1. |   .0013119   .0005901     2.22   0.026     .0001547    .0024691
         LD. |   .4247947   .0195564    21.72   0.000     .3864471    .4631423
        L2D. |  -.0023103   .0212069    -0.11   0.913    -.0438942    .0392737
        L3D. |   .0499967   .0211971     2.36   0.018      .008432    .0915614
        L4D. |   .0615114   .0212217     2.90   0.004     .0198984    .1031243
        L5D. |   .0230555   .0212683     1.08   0.278    -.0186489    .0647599
        L6D. |  -.0291784   .0212235    -1.37   0.169     -.070795    .0124381
        L7D. |   -.065447   .0210145    -3.11   0.002    -.1066537   -.0242403
        L8D. |  -.0412452   .0210309    -1.96   0.050    -.0824841   -6.29e-06
        L9D. |   .0608474    .021067     2.89   0.004     .0195378     .102157
       L10D. |  -.0729561   .0211018    -3.46   0.001    -.1143339   -.0315783
       L11D. |   .1520602   .0211615     7.19   0.000     .1105653    .1935551
       L12D. |  -.0471297   .0213662    -2.21   0.027    -.0890261   -.0052334
       L13D. |  -.1088397   .0214639    -5.07   0.000    -.1509276   -.0667518
       L14D. |    .026728   .0216004     1.24   0.216    -.0156275    .0690834
       L15D. |  -.0488903   .0215858    -2.26   0.024    -.0912172   -.0065633
       L16D. |   .0530729   .0213759     2.48   0.013     .0111575    .0949883
       L17D. |    -.00432   .0213753    -0.20   0.840    -.0462341    .0375942
       L18D. |  -.0022697   .0213097    -0.11   0.915    -.0440552    .0395158
       L19D. |  -.1067876    .021314    -5.01   0.000    -.1485815   -.0649937
       L20D. |   .2167963   .0214613    10.10   0.000     .1747136    .2588791
       L21D. |   -.116147   .0218771    -5.31   0.000    -.1590452   -.0732488
       L22D. |  -.0775473   .0220507    -3.52   0.000    -.1207857   -.0343088
       L23D. |   .0257109   .0221126     1.16   0.245     -.017649    .0690709
       L24D. |   .0411991    .022107     1.86   0.062    -.0021498    .0845481
       L25D. |  -.0597067   .0221237    -2.70   0.007    -.1030884    -.016325
       L26D. |   .0583551   .0207788     2.81   0.005     .0176105    .0990997
             |
       _cons |   .1046873   .1738378     0.60   0.547     -.236186    .4455605
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls D.tran
 
DF-GLS for D.tran                                        Number of obs =  2647
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -5.460           -3.480            -2.832            -2.545
    26           -5.475           -3.480            -2.832            -2.546
    25           -5.579           -3.480            -2.833            -2.546
    24           -6.115           -3.480            -2.833            -2.547
    23           -6.128           -3.480            -2.834            -2.547
    22           -6.552           -3.480            -2.834            -2.548
    21           -7.129           -3.480            -2.835            -2.548
    20           -7.026           -3.480            -2.835            -2.548
    19           -6.324           -3.480            -2.836            -2.549
    18           -7.875           -3.480            -2.837            -2.549
    17           -7.887           -3.480            -2.837            -2.550
    16           -8.005           -3.480            -2.838            -2.550
    15           -8.310           -3.480            -2.838            -2.551
    14           -9.173           -3.480            -2.839            -2.551
    13           -9.533           -3.480            -2.839            -2.552
    12          -10.332           -3.480            -2.840            -2.552
    11           -9.742           -3.480            -2.840            -2.553
    10           -9.389           -3.480            -2.841            -2.553
    9           -11.475           -3.480            -2.841            -2.554
    8           -11.459           -3.480            -2.842            -2.554
    7           -13.151           -3.480            -2.842            -2.555
    6           -14.022           -3.480            -2.843            -2.555
    5           -13.786           -3.480            -2.843            -2.555
    4           -14.453           -3.480            -2.844            -2.556
    3           -16.004           -3.480            -2.844            -2.556
    2           -18.731           -3.480            -2.845            -2.557
    1           -23.668           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.004312
Min SC   =  4.237373 at lag 25 with RMSE  8.004312
Min MAIC =  4.281539 at lag 26 with RMSE  8.003692

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller D.tran, trend lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2649

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -9.888            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D2.tran      |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      D.tran |
         L1. |  -.5641386   .0570536    -9.89   0.000    -.6760133   -.4522639
         LD. |  -.0103093   .0563924    -0.18   0.855    -.1208875    .1002688
        L2D. |  -.0117036    .055323    -0.21   0.832    -.1201847    .0967776
        L3D. |   .0392348    .054067     0.73   0.468    -.0667836    .1452531
        L4D. |   .1017895   .0526952     1.93   0.054    -.0015388    .2051179
        L5D. |   .1256146    .051672     2.43   0.015     .0242927    .2269366
        L6D. |   .0968369   .0511647     1.89   0.059    -.0034904    .1971643
        L7D. |   .0323324   .0497374     0.65   0.516    -.0651962     .129861
        L8D. |  -.0079999    .048633    -0.16   0.869    -.1033629    .0873631
        L9D. |   .0536444   .0474858     1.13   0.259    -.0394691    .1467579
       L10D. |  -.0185286   .0463541    -0.40   0.689    -.1094228    .0723657
       L11D. |   .1342304   .0449201     2.99   0.003     .0461479    .2223129
       L12D. |   .0878954    .043699     2.01   0.044     .0022075    .1735834
       L13D. |  -.0203257   .0423544    -0.48   0.631    -.1033772    .0627259
       L14D. |   .0070348   .0413397     0.17   0.865     -.074027    .0880967
       L15D. |  -.0412946   .0404989    -1.02   0.308    -.1207075    .0381184
       L16D. |   .0126453   .0388027     0.33   0.745    -.0634418    .0887324
       L17D. |   .0092038   .0374286     0.25   0.806    -.0641888    .0825964
       L18D. |   .0079283   .0354552     0.22   0.823    -.0615948    .0774513
       L19D. |  -.0978394    .033614    -2.91   0.004    -.1637521   -.0319266
       L20D. |   .1200082   .0321603     3.73   0.000      .056946    .1830704
       L21D. |   .0050525   .0308228     0.16   0.870     -.055387    .0654919
       L22D. |  -.0711645   .0293515    -2.42   0.015     -.128719   -.0136101
       L23D. |  -.0442093   .0270964    -1.63   0.103    -.0973417    .0089232
       L24D. |  -.0017229    .024104    -0.07   0.943    -.0489876    .0455419
       L25D. |  -.0600957   .0207068    -2.90   0.004    -.1006991   -.0194924
      _trend |   .0005268   .0002081     2.53   0.011     .0001188    .0009347
       _cons |  -.4222478   .3157857    -1.34   0.181    -1.041462    .1969668
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. varsoc edn tran

   Selection-order criteria
   Sample:  06jan2017 - 30apr2024               Number of obs      =      2672
  +---------------------------------------------------------------------------+
  |lag |    LL      LR      df    p      FPE       AIC      HQIC      SBIC    |
  |----+----------------------------------------------------------------------|
  |  0 |   -32218                      1.0e+08   24.1168   24.1184   24.1212  |
  |  1 | -18981.3   26473    4  0.000  5096.39    14.212   14.2168   14.2253  |
  |  2 | -18719.6  523.32    4  0.000  4202.46   14.0192   14.0272   14.0412  |
  |  3 | -18700.8  37.651    4  0.000  4156.09   14.0081   14.0193   14.0389  |
  |  4 | -18666.5  68.562*   4  0.000  4062.95*  13.9854*  13.9998*  14.0251* |
  +---------------------------------------------------------------------------+
   Endogenous:  edn tran
    Exogenous:  _cons

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. vecrank edn tran , trend(rtrend) max levela lags(4) 

                       Johansen tests for cointegration                        
Trend: rtrend                                           Number of obs =    2672
Sample:  06jan2017 - 30apr2024                                   Lags =       4
-------------------------------------------------------------------------------
maximum                                      trace     5% critical  1% critical
  rank    parms       LL       eigenvalue  statistic      value        value
    0      14     -18684.624                 40.4364      25.32        30.45
    1      18     -18666.369     0.01357      3.9257*1*5  12.25        16.26
    2      20     -18664.406     0.00147
-------------------------------------------------------------------------------
maximum                                       max      5% critical  1% critical
  rank    parms       LL       eigenvalue  statistic      value        value
    0      14     -18684.624                 36.5107      18.96        23.65
    1      18     -18666.369     0.01357      3.9257      12.52        16.26
    2      20     -18664.406     0.00147
-------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. vec edn tran, trend(rtrend) rank(1) lags(4) 

Vector error-correction model

Sample:  06jan2017 - 30apr2024                  Number of obs     =      2,672
                                                AIC               =   13.98531
Log likelihood = -18666.37                      HQIC              =   13.99966
Det(Sigma_ml)  =  4008.125                      SBIC              =   14.02499

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
D_edn                 8     8.79524   0.0948   279.0288   0.0000
D_tran                8     8.34069   0.1805   586.4186   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
D_edn        |
        _ce1 |
         L1. |  -.0082927    .004992    -1.66   0.097    -.0180769    .0014915
             |
         edn |
         LD. |   .1518101   .0222236     6.83   0.000     .1082527    .1953674
        L2D. |   .0521114   .0223108     2.34   0.020     .0083831    .0958398
        L3D. |  -.1521962   .0222287    -6.85   0.000    -.1957637   -.1086287
             |
        tran |
         LD. |   .0876168   .0234235     3.74   0.000     .0417076    .1335259
        L2D. |   .0773302   .0247392     3.13   0.002     .0288423    .1258182
        L3D. |   .1178165   .0234146     5.03   0.000     .0719246    .1637083
             |
       _cons |   .2583675   .1755033     1.47   0.141    -.0856127    .6023476
-------------+----------------------------------------------------------------
D_tran       |
        _ce1 |
         L1. |   .0199137    .004734     4.21   0.000     .0106352    .0291923
             |
         edn |
         LD. |   .0283885    .021075     1.35   0.178    -.0129177    .0696947
        L2D. |  -.0132243   .0211577    -0.63   0.532    -.0546927     .028244
        L3D. |  -.0357711   .0210799    -1.70   0.090     -.077087    .0055447
             |
        tran |
         LD. |   .3762393   .0222129    16.94   0.000     .3327029    .4197758
        L2D. |   .0041773   .0234606     0.18   0.859    -.0418046    .0501593
        L3D. |   .1016663   .0222045     4.58   0.000     .0581462    .1451864
             |
       _cons |   .1075922   .1664329     0.65   0.518    -.2186103    .4337947
------------------------------------------------------------------------------

Cointegrating equations

Equation           Parms    chi2     P>chi2
-------------------------------------------
_ce1                  1   1053.546   0.0000
-------------------------------------------

Identification:  beta is exactly identified

                 Johansen normalization restriction imposed
------------------------------------------------------------------------------
        beta |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
_ce1         |
         edn |          1          .        .       .            .           .
        tran |   -.781966   .0240914   -32.46   0.000    -.8291842   -.7347478
      _trend |   -.008607   .0089784    -0.96   0.338    -.0262044    .0089904
       _cons |    1.33202          .        .       .            .           .
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop D

. 
. ipolate edn fecha, gen(edn_)
(2 missing values generated)

. ipolate tran fecha, gen(tran_)
(2 missing values generated)

. 
. drop edn

. rename edn_ edn

. 
. drop tran

. rename tran_ tran

. 
. keep in 1/2742
(2 observations deleted)

. 
. merge 1:1 fecha using tp_final.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            36
        from master                        35  (_merge==1)
        from using                          1  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. 
. keep in 1/2707
(36 observations deleted)

. 
. drop _merge

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. use tp_final.dta, clear

. * Guardo datos de mayo en otro dta
. keep if _n >= 2677
(2,676 observations deleted)

. save mayo.dta, replace
file mayo.dta saved

. 
. 
. * aca dejo solo hasta abril 2024
. use tp_final.dta, clear

. keep if _n < 2677
(31 observations deleted)

. save tp_final.dta, replace
file tp_final.dta saved

. 
. 
. *tsline edn, name(edn)
. *tsline dem_mw, name(demanda)
. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. regress dem_mw Lunes Martes Miercoles Jueves Viernes Sabado

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(6, 2669)      =     92.35
       Model |  2.0048e+09         6   334138054   Prob > F        =    0.0000
    Residual |  9.6570e+09     2,669  3618227.65   R-squared       =    0.1719
-------------+----------------------------------   Adj R-squared   =    0.1701
       Total |  1.1662e+10     2,675  4359580.53   Root MSE        =    1902.2

------------------------------------------------------------------------------
      dem_mw |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Lunes |   1824.908   137.5459    13.27   0.000       1555.2    2094.615
      Martes |   2338.842   137.5459    17.00   0.000     2069.135     2608.55
   Miercoles |   2492.462   137.6358    18.11   0.000     2222.578    2762.345
      Jueves |   2479.421   137.6358    18.01   0.000     2209.537    2749.304
     Viernes |    2325.24   137.6358    16.89   0.000     2055.357    2595.124
      Sabado |   1093.035   137.6358     7.94   0.000     823.1518    1362.919
       _cons |   13509.72   97.32317   138.81   0.000     13318.89    13700.56
------------------------------------------------------------------------------

. predict dem_mw_d , resid

. 
. 
. foreach num of numlist 1/12 {
  2.     local mes = "`num'"
  3.     gen mes`mes' = month(fecha) == `num'
  4. }

. 
. regress dem_mw_d mes2-mes12

      Source |       SS           df       MS      Number of obs   =     2,676
-------------+----------------------------------   F(11, 2664)     =    118.17
       Model |  3.1669e+09        11   287897826   Prob > F        =    0.0000
    Residual |  6.4902e+09     2,664  2436251.31   R-squared       =    0.3279
-------------+----------------------------------   Adj R-squared   =    0.3252
       Total |  9.6570e+09     2,675  3610111.99   Root MSE        =    1560.8

------------------------------------------------------------------------------
    dem_mw_d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mes2 |  -353.4386   143.6776    -2.46   0.014    -635.1694   -71.70774
        mes3 |  -1476.838   140.3102   -10.53   0.000    -1751.966   -1201.711
        mes4 |  -3217.644   141.4723   -22.74   0.000    -3495.051   -2940.238
        mes5 |  -2448.114   145.2251   -16.86   0.000    -2732.879   -2163.349
        mes6 |  -604.3941   146.5079    -4.13   0.000    -891.6748   -317.1133
        mes7 |  -285.7034   145.2251    -1.97   0.049    -570.4687   -.9380439
        mes8 |  -1458.047   145.2251   -10.04   0.000    -1742.813   -1173.282
        mes9 |  -2543.354   146.5079   -17.36   0.000    -2830.635   -2256.074
       mes10 |  -3070.889   145.2251   -21.15   0.000    -3355.654   -2786.123
       mes11 |   -2184.91   146.5079   -14.91   0.000    -2472.191   -1897.629
       mes12 |  -958.0869   145.2251    -6.60   0.000    -1242.852   -673.3216
       _cons |   1540.414   99.31448    15.51   0.000     1345.673    1735.155
------------------------------------------------------------------------------

. predict dem_mw_dm , resid

. 
. tsline dem_mw_dm

. 
. *tsline dem_mw_dm
. 
. gen dia = ""
(2,676 missing values generated)

. replace dia = "Lunes" if Lunes == 1
variable dia was str1 now str5
(383 real changes made)

. replace dia = "Martes" if Martes == 1
variable dia was str5 now str6
(383 real changes made)

. replace dia = "Miercoles" if Miercoles == 1
variable dia was str6 now str9
(382 real changes made)

. replace dia = "Jueves" if Jueves == 1
(382 real changes made)

. replace dia = "Viernes" if Viernes == 1
(382 real changes made)

. replace dia = "Sabado" if Sabado == 1
(382 real changes made)

. replace dia = "Domingo" if Domingo == 1
(382 real changes made)

. 
. *graph box dem_mw, over(dia, sort(1)) name(semanabox, replace)
. 
. 
. gen mes = ""
(2,676 missing values generated)

. replace mes = "Ene" if mes1 == 1
variable mes was str1 now str3
(247 real changes made)

. replace mes = "Feb" if mes2 == 1
(226 real changes made)

. replace mes = "Mar" if mes3 == 1
(248 real changes made)

. replace mes = "Abr" if mes4 == 1
(240 real changes made)

. replace mes = "May" if mes5 == 1
(217 real changes made)

. replace mes = "Jun" if mes6 == 1
(210 real changes made)

. replace mes = "Jul" if mes7 == 1
(217 real changes made)

. replace mes = "Ago" if mes8 == 1
(217 real changes made)

. replace mes = "Sep" if mes9 == 1
(210 real changes made)

. replace mes = "Oct" if mes10 == 1
(217 real changes made)

. replace mes = "Nov" if mes11 == 1
(210 real changes made)

. replace mes = "Dic" if mes12 == 1
(217 real changes made)

. 
. *graph box dem_mw, over(mes, sort(1)) name(mesbox, replace)
. 
. 
. 
. dfgls dem_mw_dm
 
DF-GLS for dem_mw_dm                                     Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -5.615           -3.480            -2.832            -2.545
    26           -5.784           -3.480            -2.832            -2.546
    25           -5.832           -3.480            -2.833            -2.546
    24           -6.380           -3.480            -2.833            -2.547
    23           -6.437           -3.480            -2.834            -2.547
    22           -6.737           -3.480            -2.834            -2.548
    21           -7.074           -3.480            -2.835            -2.548
    20           -7.498           -3.480            -2.835            -2.548
    19           -7.909           -3.480            -2.836            -2.549
    18           -8.017           -3.480            -2.837            -2.549
    17           -8.515           -3.480            -2.837            -2.550
    16           -8.344           -3.480            -2.838            -2.550
    15           -8.498           -3.480            -2.838            -2.551
    14           -8.566           -3.480            -2.839            -2.551
    13           -8.874           -3.480            -2.839            -2.552
    12           -9.250           -3.480            -2.840            -2.552
    11           -9.233           -3.480            -2.840            -2.553
    10           -9.311           -3.480            -2.841            -2.553
    9           -10.023           -3.480            -2.841            -2.554
    8           -10.339           -3.480            -2.842            -2.554
    7           -11.386           -3.480            -2.842            -2.555
    6           -11.802           -3.480            -2.843            -2.555
    5           -12.551           -3.480            -2.843            -2.555
    4           -13.941           -3.480            -2.844            -2.556
    3           -15.163           -3.480            -2.844            -2.556
    2           -15.944           -3.480            -2.845            -2.557
    1           -19.341           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  835.6328
Min SC   =  13.49988 at lag  2 with RMSE  850.2031
Min MAIC =  13.54814 at lag 27 with RMSE  835.4045

. dfuller dem_mw_dm, trend lags(`r(optlag)') regress // Trend es siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -6.909            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D.dem_mw_dm  |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dem_mw_dm |
         L1. |  -.1426468   .0206458    -6.91   0.000    -.1831306   -.1021631
         LD. |   .1956421   .0262349     7.46   0.000      .144199    .2470853
        L2D. |  -.1935323   .0263766    -7.34   0.000    -.2452533   -.1418112
        L3D. |  -.0659957   .0263429    -2.51   0.012    -.1176507   -.0143407
        L4D. |  -.0883438   .0261197    -3.38   0.001     -.139561   -.0371266
        L5D. |  -.1133413   .0258625    -4.38   0.000    -.1640542   -.0626283
        L6D. |  -.0786964   .0256374    -3.07   0.002     -.128968   -.0284249
        L7D. |  -.0360958   .0254487    -1.42   0.156    -.0859973    .0138058
        L8D. |  -.1050886   .0250661    -4.19   0.000      -.15424   -.0559373
        L9D. |  -.0238549   .0249899    -0.95   0.340     -.072857    .0251471
       L10D. |  -.0770318   .0247075    -3.12   0.002    -.1254799   -.0285837
       L11D. |  -.0229692   .0245315    -0.94   0.349    -.0710723    .0251338
       L12D. |   -.010476   .0242476    -0.43   0.666    -.0580224    .0370705
       L13D. |  -.0477013   .0239535    -1.99   0.047    -.0946709   -.0007316
       L14D. |  -.0489252    .023781    -2.06   0.040    -.0955565   -.0022938
       L15D. |  -.0253508   .0235786    -1.08   0.282    -.0715854    .0208837
       L16D. |  -.0512613   .0231981    -2.21   0.027    -.0967498   -.0057728
       L17D. |  -.0023473   .0229829    -0.10   0.919    -.0474138    .0427191
       L18D. |  -.0846707    .022445    -3.77   0.000    -.1286824    -.040659
       L19D. |  -.0344512   .0222158    -1.55   0.121    -.0780134    .0091109
       L20D. |  -.0658618   .0217934    -3.02   0.003    -.1085959   -.0231277
       L21D. |  -.0651609   .0212419    -3.07   0.002    -.1068136   -.0235083
       L22D. |  -.0443627   .0208118    -2.13   0.033     -.085172   -.0035535
       L23D. |  -.0563949   .0204113    -2.76   0.006    -.0964188   -.0163709
       L24D. |   .0086481   .0193671     0.45   0.655    -.0293283    .0466245
       L25D. |  -.0763109   .0193411    -3.95   0.000    -.1142364   -.0383855
      _trend |   .0727663    .023686     3.07   0.002     .0263212    .1192115
       _cons |  -97.41909   35.89906    -2.71   0.007    -167.8124   -27.02573
------------------------------------------------------------------------------

. // Rechazamos H0; no hay raiz unitaria. Integrada de orden I(0)
. 
. 
. dfgls edn
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -0.393           -3.480            -2.832            -2.545
    26           -0.393           -3.480            -2.832            -2.546
    25           -0.449           -3.480            -2.833            -2.546
    24           -0.537           -3.480            -2.833            -2.547
    23           -0.594           -3.480            -2.834            -2.547
    22           -0.703           -3.480            -2.834            -2.548
    21           -0.638           -3.480            -2.835            -2.548
    20           -0.577           -3.480            -2.835            -2.548
    19           -0.669           -3.480            -2.836            -2.549
    18           -0.587           -3.480            -2.837            -2.549
    17           -0.415           -3.480            -2.837            -2.550
    16           -0.490           -3.480            -2.838            -2.550
    15           -0.282           -3.480            -2.838            -2.551
    14           -0.413           -3.480            -2.839            -2.551
    13           -0.414           -3.480            -2.839            -2.552
    12           -0.604           -3.480            -2.840            -2.552
    11           -0.585           -3.480            -2.840            -2.553
    10           -0.302           -3.480            -2.841            -2.553
    9            -0.388           -3.480            -2.841            -2.554
    8            -0.605           -3.480            -2.842            -2.554
    7            -0.479           -3.480            -2.842            -2.555
    6            -0.509           -3.480            -2.843            -2.555
    5            -0.522           -3.480            -2.843            -2.555
    4            -0.487           -3.480            -2.844            -2.556
    3            -0.395           -3.480            -2.844            -2.556
    2            -0.589           -3.480            -2.845            -2.557
    1            -0.385           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.664239
Min SC   =  4.381299 at lag 18 with RMSE  8.691742
Min MAIC =  4.337452 at lag 25 with RMSE  8.664239

. dfuller edn, trend lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -0.252            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9906

------------------------------------------------------------------------------
D.edn        |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edn |
         L1. |  -.0002267   .0009011    -0.25   0.801    -.0019936    .0015402
         LD. |   .2280837    .019541    11.67   0.000     .1897663     .266401
        L2D. |   .1167084   .0200392     5.82   0.000     .0774141    .1560026
        L3D. |  -.1077534   .0201617    -5.34   0.000    -.1472879   -.0682188
        L4D. |   .0395291   .0202693     1.95   0.051    -.0002163    .0792745
        L5D. |   .0230895   .0202838     1.14   0.255    -.0166844    .0628634
        L6D. |  -.0170466   .0202828    -0.84   0.401    -.0568185    .0227253
        L7D. |  -.0196436   .0202747    -0.97   0.333    -.0593996    .0201124
        L8D. |   .0812646   .0203402     4.00   0.000     .0413801    .1211491
        L9D. |  -.0813058   .0203827    -3.99   0.000    -.1212735    -.041338
       L10D. |  -.0904287   .0203609    -4.44   0.000    -.1303538   -.0505036
       L11D. |    .132713   .0203859     6.51   0.000      .092739    .1726871
       L12D. |   .0303239   .0205475     1.48   0.140     -.009967    .0706149
       L13D. |  -.0715693   .0205111    -3.49   0.000     -.111789   -.0313497
       L14D. |  -.0091326   .0206144    -0.44   0.658    -.0495546    .0312895
       L15D. |  -.0757307   .0205211    -3.69   0.000      -.11597   -.0354914
       L16D. |    .097564   .0205044     4.76   0.000     .0573576    .1377703
       L17D. |  -.0579898   .0205405    -2.82   0.005     -.098267   -.0177126
       L18D. |   .0703455   .0205176     3.43   0.001     .0301131    .1105779
       L19D. |   .0402566   .0206773     1.95   0.052    -.0002889    .0808021
       L20D. |  -.0489392   .0207012    -2.36   0.018    -.0895315   -.0083468
       L21D. |   .0199657   .0207306     0.96   0.336    -.0206843    .0606157
       L22D. |   .0305804   .0207379     1.47   0.140    -.0100838    .0712446
       L23D. |  -.0322705   .0206221    -1.56   0.118    -.0727078    .0081668
       L24D. |  -.0153722   .0205154    -0.75   0.454    -.0556002    .0248558
       L25D. |  -.0352116   .0200052    -1.76   0.079    -.0744392     .004016
      _trend |   .0004949   .0002772     1.79   0.074    -.0000487    .0010386
       _cons |  -.3752705   .3596804    -1.04   0.297    -1.080557    .3300157
------------------------------------------------------------------------------

. dfgls edn, notrend
 
DF-GLS for edn                                           Number of obs =  2648
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            1.574           -2.580            -1.946            -1.624
    26            1.569           -2.580            -1.946            -1.624
    25            1.476           -2.580            -1.947            -1.624
    24            1.333           -2.580            -1.947            -1.625
    23            1.239           -2.580            -1.947            -1.625
    22            1.069           -2.580            -1.948            -1.625
    21            1.165           -2.580            -1.948            -1.626
    20            1.257           -2.580            -1.948            -1.626
    19            1.112           -2.580            -1.949            -1.626
    18            1.237           -2.580            -1.949            -1.626
    17            1.509           -2.580            -1.949            -1.627
    16            1.385           -2.580            -1.950            -1.627
    15            1.726           -2.580            -1.950            -1.627
    14            1.506           -2.580            -1.950            -1.628
    13            1.503           -2.580            -1.951            -1.628
    12            1.202           -2.580            -1.951            -1.628
    11            1.229           -2.580            -1.951            -1.628
    10            1.683           -2.580            -1.952            -1.629
    9             1.539           -2.580            -1.952            -1.629
    8             1.196           -2.580            -1.952            -1.629
    7             1.389           -2.580            -1.953            -1.630
    6             1.340           -2.580            -1.953            -1.630
    5             1.318           -2.580            -1.953            -1.630
    4             1.373           -2.580            -1.953            -1.630
    3             1.516           -2.580            -1.954            -1.631
    2             1.211           -2.580            -1.954            -1.631
    1             1.530           -2.580            -1.954            -1.631
 
Opt Lag (Ng-Perron seq t) = 25 with RMSE  8.663523
Min SC   =  4.381377 at lag 18 with RMSE  8.692082
Min MAIC =  4.338654 at lag 23 with RMSE  8.670986

. dfuller edn, lags(`r(optlag)') regress // No rechazamos H0. Hay raiz unitaria

Augmented Dickey-Fuller test for unit root         Number of obs   =      2650

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)              0.975            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9940

------------------------------------------------------------------------------
       D.edn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         edn |
         L1. |   .0007134   .0007315     0.98   0.329    -.0007209    .0021478
         LD. |   .2283691   .0195485    11.68   0.000      .190037    .2667011
        L2D. |   .1167189   .0200476     5.82   0.000     .0774083    .1560295
        L3D. |  -.1078763     .02017    -5.35   0.000    -.1474271   -.0683256
        L4D. |   .0395301   .0202777     1.95   0.051    -.0002319    .0792921
        L5D. |   .0230446   .0202923     1.14   0.256    -.0167458    .0628351
        L6D. |  -.0171047   .0202912    -0.84   0.399    -.0568931    .0226837
        L7D. |  -.0196877   .0202831    -0.97   0.332    -.0594603    .0200848
        L8D. |   .0812117   .0203487     3.99   0.000     .0413106    .1211127
        L9D. |   -.081443    .020391    -3.99   0.000    -.1214271   -.0414589
       L10D. |  -.0904692   .0203694    -4.44   0.000     -.130411   -.0505275
       L11D. |   .1327952   .0203943     6.51   0.000     .0928046    .1727859
       L12D. |   .0302466    .020556     1.47   0.141     -.010061    .0705542
       L13D. |  -.0716749   .0205196    -3.49   0.000    -.1119111   -.0314386
       L14D. |  -.0091751   .0206229    -0.44   0.656    -.0496139    .0312638
       L15D. |  -.0757583   .0205297    -3.69   0.000    -.1160143   -.0355023
       L16D. |   .0976315   .0205129     4.76   0.000     .0574084    .1378545
       L17D. |  -.0580426    .020549    -2.82   0.005    -.0983366   -.0177487
       L18D. |   .0703527   .0205262     3.43   0.001     .0301036    .1106019
       L19D. |   .0401518   .0206858     1.94   0.052    -.0004104     .080714
       L20D. |  -.0490803   .0207097    -2.37   0.018    -.0896893   -.0084713
       L21D. |   .0198752   .0207392     0.96   0.338    -.0207916     .060542
       L22D. |   .0304511   .0207464     1.47   0.142    -.0102298     .071132
       L23D. |  -.0324267   .0206305    -1.57   0.116    -.0728805    .0080271
       L24D. |  -.0155032   .0205238    -0.76   0.450    -.0557478    .0247413
       L25D. |  -.0353469   .0200134    -1.77   0.077    -.0745905    .0038967
             |
       _cons |   .1662075   .1934285     0.86   0.390    -.2130803    .5454953
------------------------------------------------------------------------------

. dfgls D.edn
 
DF-GLS for D.edn                                         Number of obs =  2647
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -7.250           -3.480            -2.832            -2.545
    26           -7.781           -3.480            -2.832            -2.546
    25           -8.001           -3.480            -2.833            -2.546
    24           -8.037           -3.480            -2.833            -2.547
    23           -7.986           -3.480            -2.834            -2.547
    22           -8.024           -3.480            -2.834            -2.548
    21           -7.906           -3.480            -2.835            -2.548
    20           -8.322           -3.480            -2.835            -2.548
    19           -8.769           -3.480            -2.836            -2.549
    18           -8.700           -3.480            -2.837            -2.549
    17           -9.260           -3.480            -2.837            -2.550
    16          -10.327           -3.480            -2.838            -2.550
    15          -10.372           -3.480            -2.838            -2.551
    14          -11.947           -3.480            -2.839            -2.551
    13          -11.744           -3.480            -2.839            -2.552
    12          -12.299           -3.480            -2.840            -2.552
    11          -11.736           -3.480            -2.840            -2.553
    10          -12.383           -3.480            -2.841            -2.553
    9           -15.072           -3.480            -2.841            -2.554
    8           -15.447           -3.480            -2.842            -2.554
    7           -14.882           -3.480            -2.842            -2.555
    6           -16.818           -3.480            -2.843            -2.555
    5           -17.921           -3.480            -2.843            -2.555
    4           -19.439           -3.480            -2.844            -2.556
    3           -21.952           -3.480            -2.844            -2.556
    2           -26.279           -3.480            -2.845            -2.557
    1           -28.070           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 27 with RMSE  8.716225
Min SC   =  4.393594 at lag 17 with RMSE  8.758287
Min MAIC =  4.772603 at lag 27 with RMSE  8.716225

. dfuller D.edn, trend lags(`r(optlag)') regress // Trend es siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2647

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -9.716            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D2.edn       |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       D.edn |
         L1. |  -.7464061   .0768241    -9.72   0.000    -.8970484   -.5957639
         LD. |   -.026585   .0754548    -0.35   0.725    -.1745421     .121372
        L2D. |   .0902704    .073944     1.22   0.222    -.0547243     .235265
        L3D. |  -.0172357   .0725449    -0.24   0.812    -.1594869    .1250156
        L4D. |   .0231861   .0711845     0.33   0.745    -.1163975    .1627697
        L5D. |   .0482832    .069862     0.69   0.490    -.0887071    .1852736
        L6D. |    .028482   .0687372     0.41   0.679    -.1063028    .1632669
        L7D. |   .0085134   .0674219     0.13   0.900    -.1236922     .140719
        L8D. |   .0937839   .0658766     1.42   0.155    -.0353916    .2229595
        L9D. |   .0099568   .0645972     0.15   0.878      -.11671    .1366237
       L10D. |  -.0820011   .0631578    -1.30   0.194    -.2058454    .0418431
       L11D. |   .0513279    .061309     0.84   0.403    -.0688911    .1715469
       L12D. |   .0768292   .0597132     1.29   0.198    -.0402607     .193919
       L13D. |   .0063001   .0575753     0.11   0.913    -.1065976    .1191978
       L14D. |  -.0016829   .0556132    -0.03   0.976    -.1107332    .1073673
       L15D. |  -.0712388   .0537167    -1.33   0.185    -.1765703    .0340927
       L16D. |   .0222283   .0521845     0.43   0.670    -.0800987    .1245554
       L17D. |  -.0428538   .0502802    -0.85   0.394    -.1414469    .0557392
       L18D. |   .0326135   .0475355     0.69   0.493    -.0605975    .1258244
       L19D. |   .0762149   .0451812     1.69   0.092    -.0123795    .1648093
       L20D. |   .0237241   .0432729     0.55   0.584    -.0611285    .1085766
       L21D. |   .0433741   .0407717     1.06   0.288    -.0365741    .1233222
       L22D. |   .0760709   .0380354     2.00   0.046     .0014884    .1506535
       L23D. |   .0404425   .0353507     1.14   0.253    -.0288757    .1097608
       L24D. |   .0253964   .0323135     0.79   0.432    -.0379661     .088759
       L25D. |   .0006833   .0284508     0.02   0.981    -.0551051    .0564717
       L26D. |  -.0287333    .025356    -1.13   0.257    -.0784532    .0209865
       L27D. |  -.0415461   .0202308    -2.05   0.040     -.081216   -.0018762
      _trend |   .0004475    .000226     1.98   0.048     4.44e-06    .0008906
       _cons |  -.3447568   .3452518    -1.00   0.318    -1.021751    .3322374
------------------------------------------------------------------------------

. // Rechazamos H0; es I(1)
. 
. 
. var D.edn dem_mw_dm

Vector autoregression

Sample:  05jan2017 - 30apr2024                  Number of obs     =      2,673
Log likelihood =  -31491.33                     AIC               =   23.57002
FPE            =   5.91e+07                     HQIC              =   23.57799
Det(Sigma_ml)  =   5.86e+07                     SBIC              =   23.59206

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
D_edn                 5     8.96393   0.0571   161.7906   0.0000
dem_mw_dm             5     855.858   0.6988   6202.857   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
D_edn        |
         edn |
         LD. |   .2024212   .0192744    10.50   0.000     .1646441    .2401982
        L2D. |   .0897108   .0192951     4.65   0.000     .0518932    .1275284
             |
   dem_mw_dm |
         L1. |   -.000047   .0001957    -0.24   0.810    -.0004306    .0003365
         L2. |   .0000381   .0001956     0.19   0.846    -.0003453    .0004214
             |
       _cons |   .2448016   .1734068     1.41   0.158    -.0950694    .5846727
-------------+----------------------------------------------------------------
dem_mw_dm    |
         edn |
         LD. |  -3.896179   1.840278    -2.12   0.034    -7.503059   -.2893003
        L2D. |  -1.720977   1.842253    -0.93   0.350    -5.331725    1.889772
             |
   dem_mw_dm |
         L1. |   1.032938   .0186835    55.29   0.000      .996319    1.069557
         L2. |  -.2562617   .0186756   -13.72   0.000    -.2928652   -.2196582
             |
       _cons |   2.199598   16.55653     0.13   0.894     -30.2506     34.6498
------------------------------------------------------------------------------

. vargranger

   Granger causality Wald tests
  +------------------------------------------------------------------+
  |          Equation           Excluded |   chi2     df Prob > chi2 |
  |--------------------------------------+---------------------------|
  |             D_edn          dem_mw_dm |  .05778     2    0.972    |
  |             D_edn                ALL |  .05778     2    0.972    |
  |--------------------------------------+---------------------------|
  |         dem_mw_dm              D.edn |  6.5555     2    0.038    |
  |         dem_mw_dm                ALL |  6.5555     2    0.038    |
  +------------------------------------------------------------------+

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-F
> INAL/base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop C

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop C

. ipolate edn fecha, gen(edn_)
(3 missing values generated)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save tp_final.dta, replace
file tp_final.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop C

. ipolate edn fecha, gen(edn_)
(3 missing values generated)

. drop edn

. rename edn_ edn

. keep in 1/2742
(3 observations deleted)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CGPA2.BA") firstrow clear

. tsset fecha
string variables not allowed in varlist;
fecha is a string variable
r(109);

end of do-file

r(109);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CGPA2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. ipolate cgpa2 fecha, gen(cgpa2_)

. drop cgpa2

. rename cgpa2_ cgpa2

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TRAN.BA") firstrow clear

. tsset fecha
variable fecha not found
r(111);

end of do-file

r(111);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. ipolate tran fecha, gen(tran_)
variable fecha not found
r(111);

end of do-file

r(111);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save Demanda.dta, replace
(note: file Demanda.dta not found)
file Demanda.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop C

. ipolate edn fecha, gen(edn_)
(3 missing values generated)

. drop edn

. rename edn_ edn

. keep in 1/2742
(3 observations deleted)

. save edn.dta, replace
(note: file edn.dta not found)
file edn.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CGPA2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cgpa2 fecha, gen(cgpa2_)

. drop cgpa2

. rename cgpa2_ cgpa2

. keep in 1/2742
(5 observations deleted)

. save cgpa2.dta, replace
(note: file cgpa2.dta not found)
file cgpa2.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TRAN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate tran fecha, gen(tran_)

. drop tran

. rename tran_ tran

. keep in 1/2742
(5 observations deleted)

. save tran.dta, replace
(note: file tran.dta not found)
file tran.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. tsset fecha
string variables not allowed in varlist;
fecha is a string variable
r(109);

end of do-file

r(109);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save Demanda.dta, replace
file Demanda.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop C

. ipolate edn fecha, gen(edn_)
(3 missing values generated)

. drop edn

. rename edn_ edn

. keep in 1/2742
(3 observations deleted)

. save edn.dta, replace
file edn.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CGPA2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cgpa2 fecha, gen(cgpa2_)

. drop cgpa2

. rename cgpa2_ cgpa2

. keep in 1/2742
(5 observations deleted)

. save cgpa2.dta, replace
file cgpa2.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TRAN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate tran fecha, gen(tran_)

. drop tran

. rename tran_ tran

. keep in 1/2742
(5 observations deleted)

. save tran.dta, replace
file tran.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. tsset fecha
string variables not allowed in varlist;
fecha is a string variable
r(109);

end of do-file

r(109);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. tsset fecha
string variables not allowed in varlist;
fecha is a string variable
r(109);

end of do-file

r(109);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CGPA2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cgpa2 fecha, gen(cgpa2_)

. drop cgpa2

. rename cgpa2_ cgpa2

. keep in 1/2742
(5 observations deleted)

. save cgpa2.dta, replace
file cgpa2.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop C

. ipolate edn fecha, gen(edn_)
(3 missing values generated)

. drop edn

. rename edn_ edn

. keep in 1/2742
(3 observations deleted)

. save edn.dta, replace
file edn.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CGPA2.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cgpa2 fecha, gen(cgpa2_)

. drop cgpa2

. rename cgpa2_ cgpa2

. keep in 1/2742
(5 observations deleted)

. save cgpa2.dta, replace
file cgpa2.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TRAN.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate tran fecha, gen(tran_)

. drop tran

. rename tran_ tran

. keep in 1/2742
(5 observations deleted)

. save tran.dta, replace
file tran.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. tsset fecha
string variables not allowed in varlist;
fecha is a string variable
r(109);

end of do-file

r(109);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsset fecha
        time variable:  fecha, 02jan2017 00:00:00 to 11jul2024 00:00:00
                        but with gaps
                delta:  .001 seconds

. format fecha %td

. tsfill
attempt to use too much memory
    You just attempted to use more memory than this Stata can currently accommodate.  The maximum is 1600g bytes.  That
    maximum is probably more than your computer can provide.  You can, however, increase the maximum by increasing
    segmentsize, which is currently 32m; see help memory.  Double segment size, and you double the maximum.
r(909);

end of do-file

r(909);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsset fecha
        time variable:  fecha, 02jan2017 00:00:00 to 11jul2024 00:00:00
                        but with gaps
                delta:  .001 seconds

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. format fecha %td

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. format fecha %td

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. format fecha %td

. tsfill
time variable not set, use tsset varname ...
r(111);

end of do-file

r(111);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsset fecha
        time variable:  fecha, 02jan2017 to 11jul2024, but with gaps
                delta:  1 day

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. format fecha %td

. tsfill

. ipolate txar fecha, gen(txar_)

. drop txar

. rename txar_ txar

. keep in 1/2742
(6 observations deleted)

. save txar.dta, replace
(note: file txar.dta not found)
file txar.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CAPX.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate capx fecha, gen(capx_)

. drop capx

. rename capx_ capx

. keep in 1/2742
(5 observations deleted)

. save capx.dta, replace
(note: file capx.dta not found)
file capx.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CARC.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate carc fecha, gen(carc_)

. drop carc

. rename carc_ carc

. keep in 1/2742
(5 observations deleted)

. save carc.dta, replace
(note: file carc.dta not found)
file carc.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DOME.BA") firstrow clear

. tsset fecha
variable fecha not found
r(111);

end of do-file

r(111);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DOME.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DOME.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DOME.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 02jan2017 to 10jul2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate dome fecha, gen(dome_)

. drop dome

. rename dome_ dome

. keep in 1/2742
(5 observations deleted)

. save dome.dta, replace
(note: file dome.dta not found)
file dome.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DGCU2.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DGCU2.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DGCU2.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DGCU2.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DGCU2.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CEPU.BA") firstrow clear
worksheet CEPU.BA not found
r(601);

end of do-file

r(601);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CEPU2.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CEPU2.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CEPU2.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CEPU2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cepu fecha, gen(cepu_)

. drop cepu

. rename cepu_ cepu

. keep in 1/2742
(6 observations deleted)

. save cepu.dta, replace
(note: file cepu.dta not found)
file cepu.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CECO2.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate ceco fecha, gen(ceco_)

. drop ceco

. rename ceco_ ceco

. keep in 1/2742
(6 observations deleted)

. save ceco.dta, replace
(note: file ceco.dta not found)
file ceco.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("YPFD.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("YPFD.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate ypf fecha, gen(ypf_)

. drop ypf

. rename ypf_ ypf

. keep in 1/2742
(6 observations deleted)

. save ypf.dta, replace
(note: file ypf.dta not found)
file ypf.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TGNO4.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate tgno fecha, gen(tgno_)

. drop tgno

. rename tgno_ tgno

. keep in 1/2742
(6 observations deleted)

. save tgno.dta, replace
(note: file tgno.dta not found)
file tgno.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("METR.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate metr fecha, gen(metr_)

. drop metr

. rename metr_ metr

. keep in 1/2742
(6 observations deleted)

. save metr.dta, replace
(note: file metr.dta not found)
file metr.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("ALUA.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("ALUA.BA") firstrow clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save Demanda.dta, replace
file Demanda.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop C

. ipolate edn fecha, gen(edn_)
(3 missing values generated)

. drop edn

. rename edn_ edn

. keep in 1/2742
(3 observations deleted)

. save edn.dta, replace
file edn.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CGPA2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cgpa2 fecha, gen(cgpa2_)

. drop cgpa2

. rename cgpa2_ cgpa2

. keep in 1/2742
(5 observations deleted)

. save cgpa2.dta, replace
file cgpa2.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TRAN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate tran fecha, gen(tran_)

. drop tran

. rename tran_ tran

. keep in 1/2742
(5 observations deleted)

. save tran.dta, replace
file tran.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate txar fecha, gen(txar_)

. drop txar

. rename txar_ txar

. keep in 1/2742
(6 observations deleted)

. save txar.dta, replace
file txar.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CAPX.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate capx fecha, gen(capx_)

. drop capx

. rename capx_ capx

. keep in 1/2742
(5 observations deleted)

. save capx.dta, replace
file capx.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CARC.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate carc fecha, gen(carc_)

. drop carc

. rename carc_ carc

. keep in 1/2742
(5 observations deleted)

. save carc.dta, replace
file carc.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DOME.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 02jan2017 to 10jul2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate dome fecha, gen(dome_)

. drop dome

. rename dome_ dome

. keep in 1/2742
(5 observations deleted)

. save dome.dta, replace
file dome.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DGCU2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 02jan2017 to 10jul2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate dgcu fecha, gen(dgcu_)

. drop dgcu

. rename dgcu_ dgcu

. keep in 1/2742
(5 observations deleted)

. save dgcu.dta, replace
(note: file dgcu.dta not found)
file dgcu.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CEPU2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cepu fecha, gen(cepu_)

. drop cepu

. rename cepu_ cepu

. keep in 1/2742
(6 observations deleted)

. save cepu.dta, replace
file cepu.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CECO2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate ceco fecha, gen(ceco_)

. drop ceco

. rename ceco_ ceco

. keep in 1/2742
(6 observations deleted)

. save ceco.dta, replace
file ceco.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TGNO4.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate tgno fecha, gen(tgno_)

. drop tgno

. rename tgno_ tgno

. keep in 1/2742
(6 observations deleted)

. save tgno.dta, replace
file tgno.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("METR.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate metr fecha, gen(metr_)

. drop metr

. rename metr_ metr

. keep in 1/2742
(6 observations deleted)

. save metr.dta, replace
file metr.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("GBAN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate gban fecha, gen(gban_)

. drop gban

. rename gban_ gban

. keep in 1/2742
(6 observations deleted)

. save gban.dta, replace
(note: file gban.dta not found)
file gban.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("ALUA.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate alua fecha, gen(alua_)

. drop alua

. rename alua_ alua

. keep in 1/2742
(6 observations deleted)

. save alua.dta, replace
(note: file alua.dta not found)
file alua.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save Demanda.dta, replace
file Demanda.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop C

. ipolate edn fecha, gen(edn_)
(3 missing values generated)

. drop edn

. rename edn_ edn

. keep in 1/2742
(3 observations deleted)

. save edn.dta, replace
file edn.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CGPA2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cgpa2 fecha, gen(cgpa2_)

. drop cgpa2

. rename cgpa2_ cgpa2

. keep in 1/2742
(5 observations deleted)

. save cgpa2.dta, replace
file cgpa2.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. use Demanda.dta, clear

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. merge 1:1 fecha using edn.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            36
        from master                         1  (_merge==1)
        from using                         35  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. merge 1:1 fecha using cgpa2.dta
variable _merge already defined
r(110);

end of do-file

r(110);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. use Demanda.dta, clear

. merge 1:1 fecha using edn.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            36
        from master                         1  (_merge==1)
        from using                         35  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using cgpa2.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using tran.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using txar.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using capx.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using carc.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using dome.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using dgcu.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using cepu.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using ceco.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using tgno.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using metr.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using gban.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using alua.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,742  (_merge==3)
    -----------------------------------------

. drop _merge

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. drop C D E F G H

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save Demanda.dta, replace
file Demanda.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop C

. ipolate edn fecha, gen(edn_)
(3 missing values generated)

. drop edn

. rename edn_ edn

. keep in 1/2707
(38 observations deleted)

. save edn.dta, replace
file edn.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CGPA2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cgpa2 fecha, gen(cgpa2_)

. drop cgpa2

. rename cgpa2_ cgpa2

. keep in 1/2707
(40 observations deleted)

. save cgpa2.dta, replace
file cgpa2.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TRAN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate tran fecha, gen(tran_)

. drop tran

. rename tran_ tran

. keep in 1/2707
(40 observations deleted)

. save tran.dta, replace
file tran.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate txar fecha, gen(txar_)

. drop txar

. rename txar_ txar

. keep in 1/2707
(41 observations deleted)

. save txar.dta, replace
file txar.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CAPX.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate capx fecha, gen(capx_)

. drop capx

. rename capx_ capx

. keep in 1/2707
(40 observations deleted)

. save capx.dta, replace
file capx.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CARC.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate carc fecha, gen(carc_)

. drop carc

. rename carc_ carc

. keep in 1/2707
(40 observations deleted)

. save carc.dta, replace
file carc.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DOME.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 02jan2017 to 10jul2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate dome fecha, gen(dome_)

. drop dome

. rename dome_ dome

. keep in 1/2707
(40 observations deleted)

. save dome.dta, replace
file dome.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DGCU2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 02jan2017 to 10jul2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate dgcu fecha, gen(dgcu_)

. drop dgcu

. rename dgcu_ dgcu

. keep in 1/2707
(40 observations deleted)

. save dgcu.dta, replace
file dgcu.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CEPU2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cepu fecha, gen(cepu_)

. drop cepu

. rename cepu_ cepu

. keep in 1/2707
(41 observations deleted)

. save cepu.dta, replace
file cepu.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CECO2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate ceco fecha, gen(ceco_)

. drop ceco

. rename ceco_ ceco

. keep in 1/2707
(41 observations deleted)

. save ceco.dta, replace
file ceco.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TGNO4.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate tgno fecha, gen(tgno_)

. drop tgno

. rename tgno_ tgno

. keep in 1/2707
(41 observations deleted)

. save tgno.dta, replace
file tgno.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("METR.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate metr fecha, gen(metr_)

. drop metr

. rename metr_ metr

. keep in 1/2707
(41 observations deleted)

. save metr.dta, replace
file metr.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("GBAN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate gban fecha, gen(gban_)

. drop gban

. rename gban_ gban

. keep in 1/2707
(41 observations deleted)

. save gban.dta, replace
file gban.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("ALUA.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate alua fecha, gen(alua_)

. drop alua

. rename alua_ alua

. keep in 1/2707
(41 observations deleted)

. save alua.dta, replace
file alua.dta saved

. 
. 
. use Demanda.dta, clear

. merge 1:1 fecha using edn.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using cgpa2.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using tran.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using txar.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using capx.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using carc.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using dome.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using dgcu.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using cepu.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using ceco.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using tgno.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using metr.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using gban.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using alua.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop C D E F G H

. 
. keep 2/2708
2 invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. cd "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL"
/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("Demanda") firstrow clear

. tsset fecha
        time variable:  fecha, 1/1/2017 to 5/31/2024
                delta:  1 day

. format fecha %td

. 
. save Demanda.dta, replace
(note: file Demanda.dta not found)
file Demanda.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("EDN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/5/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. drop C

. ipolate edn fecha, gen(edn_)
(3 missing values generated)

. drop edn

. rename edn_ edn

. keep in 1/2707
(38 observations deleted)

. save edn.dta, replace
(note: file edn.dta not found)
file edn.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CGPA2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cgpa2 fecha, gen(cgpa2_)

. drop cgpa2

. rename cgpa2_ cgpa2

. keep in 1/2707
(40 observations deleted)

. save cgpa2.dta, replace
(note: file cgpa2.dta not found)
file cgpa2.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TRAN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate tran fecha, gen(tran_)

. drop tran

. rename tran_ tran

. keep in 1/2707
(40 observations deleted)

. save tran.dta, replace
(note: file tran.dta not found)
file tran.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TXAR.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate txar fecha, gen(txar_)

. drop txar

. rename txar_ txar

. keep in 1/2707
(41 observations deleted)

. save txar.dta, replace
(note: file txar.dta not found)
file txar.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CAPX.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate capx fecha, gen(capx_)

. drop capx

. rename capx_ capx

. keep in 1/2707
(40 observations deleted)

. save capx.dta, replace
(note: file capx.dta not found)
file capx.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CARC.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/10/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate carc fecha, gen(carc_)

. drop carc

. rename carc_ carc

. keep in 1/2707
(40 observations deleted)

. save carc.dta, replace
(note: file carc.dta not found)
file carc.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DOME.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 02jan2017 to 10jul2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate dome fecha, gen(dome_)

. drop dome

. rename dome_ dome

. keep in 1/2707
(40 observations deleted)

. save dome.dta, replace
(note: file dome.dta not found)
file dome.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("DGCU2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 02jan2017 to 10jul2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate dgcu fecha, gen(dgcu_)

. drop dgcu

. rename dgcu_ dgcu

. keep in 1/2707
(40 observations deleted)

. save dgcu.dta, replace
(note: file dgcu.dta not found)
file dgcu.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CEPU2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate cepu fecha, gen(cepu_)

. drop cepu

. rename cepu_ cepu

. keep in 1/2707
(41 observations deleted)

. save cepu.dta, replace
(note: file cepu.dta not found)
file cepu.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("CECO2.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate ceco fecha, gen(ceco_)

. drop ceco

. rename ceco_ ceco

. keep in 1/2707
(41 observations deleted)

. save ceco.dta, replace
(note: file ceco.dta not found)
file ceco.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("TGNO4.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate tgno fecha, gen(tgno_)

. drop tgno

. rename tgno_ tgno

. keep in 1/2707
(41 observations deleted)

. save tgno.dta, replace
(note: file tgno.dta not found)
file tgno.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("METR.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate metr fecha, gen(metr_)

. drop metr

. rename metr_ metr

. keep in 1/2707
(41 observations deleted)

. save metr.dta, replace
(note: file metr.dta not found)
file metr.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("GBAN.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate gban fecha, gen(gban_)

. drop gban

. rename gban_ gban

. keep in 1/2707
(41 observations deleted)

. save gban.dta, replace
(note: file gban.dta not found)
file gban.dta saved

. 
. import excel "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL/
> base_tp_final.xlsx", sheet("ALUA.BA") firstrow clear

. tsset fecha
        time variable:  fecha, 1/2/2017 to 7/11/2024, but with gaps
                delta:  1 day

. format fecha %td

. tsfill

. ipolate alua fecha, gen(alua_)

. drop alua

. rename alua_ alua

. keep in 1/2707
(41 observations deleted)

. save alua.dta, replace
(note: file alua.dta not found)
file alua.dta saved

. 
. 
. use Demanda.dta, clear

. merge 1:1 fecha using edn.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using cgpa2.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using tran.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using txar.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using capx.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using carc.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using dome.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using dgcu.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using cepu.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using ceco.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using tgno.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using metr.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using gban.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 fecha using alua.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,707  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. drop C D E F G H

. 
. keep in 2/2708
(1 observation deleted)

. 
. save tp_final.dta, replace
(note: file tp_final.dta not found)
file tp_final.dta saved

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. cd "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL"
/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. clear all

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. cd "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL"
/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL

. clear all

. use tp_final.dta

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls cgpa2
 
DF-GLS for cgpa2                                         Number of obs =  2679
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            0.200           -3.480            -2.832            -2.545
    26            0.135           -3.480            -2.832            -2.546
    25           -0.122           -3.480            -2.833            -2.546
    24            0.156           -3.480            -2.833            -2.547
    23           -0.209           -3.480            -2.834            -2.547
    22           -0.440           -3.480            -2.834            -2.548
    21           -0.344           -3.480            -2.835            -2.548
    20           -0.312           -3.480            -2.836            -2.549
    19           -0.027           -3.480            -2.836            -2.549
    18           -0.011           -3.480            -2.837            -2.549
    17            0.052           -3.480            -2.837            -2.550
    16            0.079           -3.480            -2.838            -2.550
    15            0.004           -3.480            -2.838            -2.551
    14            0.189           -3.480            -2.839            -2.551
    13           -0.095           -3.480            -2.839            -2.552
    12           -0.195           -3.480            -2.840            -2.552
    11           -0.203           -3.480            -2.840            -2.553
    10           -0.227           -3.480            -2.841            -2.553
    9            -0.122           -3.480            -2.841            -2.554
    8            -0.025           -3.480            -2.842            -2.554
    7             0.242           -3.480            -2.842            -2.554
    6             0.109           -3.480            -2.843            -2.555
    5            -0.111           -3.480            -2.843            -2.555
    4            -0.216           -3.480            -2.844            -2.556
    3            -0.540           -3.480            -2.844            -2.556
    2            -0.333           -3.480            -2.845            -2.557
    1            -0.409           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 26 with RMSE  20.87021
Min SC   =  6.156196 at lag 26 with RMSE  20.87021
Min MAIC =   6.09607 at lag 26 with RMSE  20.87021

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller cgpa2, trend lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2680

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)              0.985            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 1.0000

------------------------------------------------------------------------------
D.cgpa2      |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       cgpa2 |
         L1. |   .0011744   .0011917     0.99   0.324    -.0011624    .0035111
         LD. |   .2599039   .0194121    13.39   0.000     .2218395    .2979683
        L2D. |  -.0554819    .019953    -2.78   0.005     -.094607   -.0163569
        L3D. |   .0940189   .0203243     4.63   0.000     .0541658     .133872
        L4D. |  -.0700825   .0217296    -3.23   0.001    -.1126912   -.0274738
        L5D. |  -.0425908   .0218536    -1.95   0.051    -.0854427     .000261
        L6D. |  -.0189643   .0219276    -0.86   0.387    -.0619613    .0240327
        L7D. |   -.125036   .0218709    -5.72   0.000    -.1679218   -.0821501
        L8D. |   .1205244   .0220956     5.45   0.000     .0771981    .1638508
        L9D. |   .0241736   .0222189     1.09   0.277    -.0193944    .0677416
       L10D. |  -.0059328   .0222148    -0.27   0.789     -.049493    .0376273
       L11D. |   .0294977   .0222111     1.33   0.184    -.0140552    .0730505
       L12D. |   -.040124   .0221332    -1.81   0.070    -.0835242    .0032761
       L13D. |   .0155214   .0220141     0.71   0.481    -.0276451    .0586879
       L14D. |   -.139457   .0220185    -6.33   0.000    -.1826322   -.0962819
       L15D. |   .0952776   .0221834     4.30   0.000     .0517792    .1387761
       L16D. |  -.0078819   .0223159    -0.35   0.724    -.0516402    .0358763
       L17D. |  -.0450936   .0223265    -2.02   0.044    -.0888726   -.0013145
       L18D. |   .0532194   .0223462     2.38   0.017     .0094018    .0970371
       L19D. |   -.052061   .0222324    -2.34   0.019    -.0956556   -.0084663
       L20D. |   .1035994   .0221516     4.68   0.000     .0601633    .1470355
       L21D. |   .0195045   .0222251     0.88   0.380    -.0240757    .0630848
       L22D. |   .0257903   .0222321     1.16   0.246    -.0178036    .0693842
       L23D. |  -.0243722   .0221157    -1.10   0.271     -.067738    .0189935
       L24D. |    -.19521    .021967    -8.89   0.000    -.2382841   -.1521359
       L25D. |   .1375078   .0222139     6.19   0.000     .0939494    .1810662
       L26D. |  -.1062008   .0212231    -5.00   0.000    -.1478163   -.0645853
      _trend |   .0009988   .0006303     1.58   0.113    -.0002371    .0022346
       _cons |  -.8562807   .8619141    -0.99   0.321    -2.546373    .8338115
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls cgpa2, notrend
 
DF-GLS for cgpa2                                         Number of obs =  2679
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            2.735           -2.580            -1.946            -1.624
    26            2.609           -2.580            -1.946            -1.624
    25            2.154           -2.580            -1.947            -1.624
    24            2.628           -2.580            -1.947            -1.625
    23            1.991           -2.580            -1.947            -1.625
    22            1.612           -2.580            -1.948            -1.625
    21            1.761           -2.580            -1.948            -1.626
    20            1.808           -2.580            -1.948            -1.626
    19            2.280           -2.580            -1.949            -1.626
    18            2.302           -2.580            -1.949            -1.626
    17            2.406           -2.580            -1.949            -1.627
    16            2.448           -2.580            -1.950            -1.627
    15            2.312           -2.580            -1.950            -1.627
    14            2.631           -2.580            -1.950            -1.628
    13            2.132           -2.580            -1.951            -1.628
    12            1.963           -2.580            -1.951            -1.628
    11            1.946           -2.580            -1.951            -1.628
    10            1.903           -2.580            -1.952            -1.629
    9             2.072           -2.580            -1.952            -1.629
    8             2.230           -2.580            -1.952            -1.629
    7             2.694           -2.580            -1.953            -1.630
    6             2.455           -2.580            -1.953            -1.630
    5             2.079           -2.580            -1.953            -1.630
    4             1.902           -2.580            -1.953            -1.630
    3             1.392           -2.580            -1.954            -1.631
    2             1.697           -2.580            -1.954            -1.631
    1             1.575           -2.580            -1.954            -1.631
 
Opt Lag (Ng-Perron seq t) = 26 with RMSE  20.85041
Min SC   =  6.154298 at lag 26 with RMSE  20.85041
Min MAIC =  6.100415 at lag 26 with RMSE  20.85041

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller cgpa2, lags(`r(optlag)') regress // No rechazamos H0. Hay raiz unitaria

Augmented Dickey-Fuller test for unit root         Number of obs   =      2680

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)              2.156            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9988

------------------------------------------------------------------------------
     D.cgpa2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       cgpa2 |
         L1. |   .0021777   .0010099     2.16   0.031     .0001974    .0041579
         LD. |   .2598321   .0194176    13.38   0.000      .221757    .2979072
        L2D. |  -.0557915   .0199577    -2.80   0.005    -.0949257   -.0166572
        L3D. |   .0936478   .0203288     4.61   0.000      .053786    .1335097
        L4D. |  -.0703368   .0217352    -3.24   0.001    -.1129565   -.0277171
        L5D. |  -.0428291   .0218593    -1.96   0.050    -.0856922    .0000339
        L6D. |  -.0191196   .0219337    -0.87   0.383    -.0621284    .0238892
        L7D. |  -.1252141   .0218769    -5.72   0.000    -.1681116   -.0823166
        L8D. |   .1205315   .0221019     5.45   0.000     .0771928    .1638701
        L9D. |   .0240374    .022225     1.08   0.280    -.0195427    .0676175
       L10D. |   -.006081    .022221    -0.27   0.784    -.0496532    .0374912
       L11D. |   .0293636   .0222173     1.32   0.186    -.0142013    .0729286
       L12D. |  -.0403094   .0221392    -1.82   0.069    -.0837212    .0031025
       L13D. |   .0153903   .0220202     0.70   0.485    -.0277882    .0585688
       L14D. |  -.1396155   .0220245    -6.34   0.000    -.1828025   -.0964285
       L15D. |   .0952586   .0221897     4.29   0.000     .0517478    .1387694
       L16D. |  -.0080356    .022322    -0.36   0.719    -.0518059    .0357347
       L17D. |  -.0452219   .0223327    -2.02   0.043    -.0890131   -.0014306
       L18D. |   .0531441   .0223525     2.38   0.017      .009314    .0969741
       L19D. |  -.0522167   .0222385    -2.35   0.019    -.0958234   -.0086101
       L20D. |   .1034958   .0221578     4.67   0.000     .0600475    .1469441
       L21D. |   .0193131   .0222311     0.87   0.385    -.0242789    .0629051
       L22D. |   .0255696    .022238     1.15   0.250    -.0180359    .0691751
       L23D. |  -.0246054   .0221215    -1.11   0.266    -.0679825    .0187718
       L24D. |  -.1954358   .0219728    -8.89   0.000    -.2385213   -.1523503
       L25D. |   .1374366   .0222202     6.19   0.000     .0938659    .1810073
       L26D. |    -.10643   .0212287    -5.01   0.000    -.1480564   -.0648035
             |
       _cons |   .3146447   .4438908     0.71   0.478    -.5557625    1.185052
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls D.cgpa2
 
DF-GLS for D.cgpa2                                       Number of obs =  2678
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -9.283           -3.480            -2.832            -2.545
    26           -8.990           -3.480            -2.832            -2.546
    25           -9.032           -3.480            -2.833            -2.546
    24           -8.421           -3.480            -2.833            -2.547
    23           -9.580           -3.480            -2.834            -2.547
    22           -8.539           -3.480            -2.834            -2.548
    21           -7.970           -3.480            -2.835            -2.548
    20           -8.474           -3.480            -2.836            -2.549
    19           -8.803           -3.480            -2.836            -2.549
    18          -10.185           -3.480            -2.837            -2.549
    17          -10.615           -3.480            -2.837            -2.550
    16          -11.323           -3.480            -2.838            -2.550
    15          -11.929           -3.480            -2.838            -2.551
    14          -12.080           -3.480            -2.839            -2.551
    13          -13.710           -3.480            -2.839            -2.552
    12          -12.764           -3.480            -2.840            -2.552
    11          -12.796           -3.480            -2.840            -2.553
    10          -13.372           -3.480            -2.841            -2.553
    9           -13.916           -3.480            -2.841            -2.554
    8           -15.444           -3.480            -2.842            -2.554
    7           -17.243           -3.480            -2.842            -2.554
    6           -21.362           -3.480            -2.843            -2.555
    5           -22.598           -3.480            -2.843            -2.555
    4           -23.176           -3.480            -2.844            -2.556
    3           -25.200           -3.480            -2.844            -2.556
    2           -25.245           -3.480            -2.845            -2.557
    1           -31.834           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 27 with RMSE   20.9828
Min SC   =  6.166331 at lag 25 with RMSE  21.00689
Min MAIC =  6.803173 at lag 21 with RMSE  21.43798

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller D.edn, trend lags(`r(optlag)') regress

Augmented Dickey-Fuller test for unit root         Number of obs   =      2678

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -10.122            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D2.edn       |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       D.edn |
         L1. |  -.7910502   .0781492   -10.12   0.000    -.9442899   -.6378106
         LD. |   .0350113   .0764571     0.46   0.647    -.1149103    .1849329
        L2D. |    .134531   .0747574     1.80   0.072    -.0120579    .2811199
        L3D. |   .0344121     .07316     0.47   0.638    -.1090444    .1778686
        L4D. |   .0705884   .0716015     0.99   0.324    -.0698121    .2109889
        L5D. |   .1020543   .0700417     1.46   0.145    -.0352878    .2393963
        L6D. |   .0947594    .068563     1.38   0.167     -.039683    .2292018
        L7D. |   .0450114   .0670203     0.67   0.502    -.0864061    .1764288
        L8D. |   .1118676   .0654429     1.71   0.087    -.0164568     .240192
        L9D. |   .0515229   .0640568     0.80   0.421    -.0740835    .1771292
       L10D. |  -.0423521   .0625011    -0.68   0.498    -.1649081    .0802038
       L11D. |   .0914569   .0605317     1.51   0.131    -.0272373    .2101511
       L12D. |   .1092549   .0588504     1.86   0.063    -.0061426    .2246523
       L13D. |   .0387781    .056751     0.68   0.494    -.0725028    .1500589
       L14D. |   .0469607   .0548067     0.86   0.392    -.0605076     .154429
       L15D. |   .0064799   .0528169     0.12   0.902    -.0970868    .1100465
       L16D. |   .0740296   .0511531     1.45   0.148    -.0262744    .1743337
       L17D. |  -.0071185   .0492946    -0.14   0.885    -.1037784    .0895414
       L18D. |   .0698127   .0464408     1.50   0.133    -.0212512    .1608767
       L19D. |   .1000644   .0441621     2.27   0.024     .0134686    .1866602
       L20D. |   .0483032   .0422862     1.14   0.253    -.0346141    .1312206
       L21D. |   .0382967   .0397677     0.96   0.336    -.0396823    .1162756
       L22D. |   .0459088   .0372891     1.23   0.218    -.0272098    .1190275
       L23D. |   .0238986   .0346607     0.69   0.491    -.0440661    .0918634
       L24D. |   .0191512   .0316649     0.60   0.545    -.0429392    .0812416
       L25D. |  -.0102185   .0282311    -0.36   0.717    -.0655757    .0451386
       L26D. |  -.0358268   .0251737    -1.42   0.155     -.085189    .0135354
       L27D. |  -.0685205   .0199383    -3.44   0.001    -.1076168   -.0294243
      _trend |   .0004914   .0002303     2.13   0.033     .0000398     .000943
       _cons |  -.3808392   .3546489    -1.07   0.283    -1.076256    .3145777
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller D.cgpa2, trend lags(`r(optlag)') regress // Trend es siginificativo
option lags() incorrectly specified
r(198);

end of do-file

r(198);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls cgpa2
 
DF-GLS for cgpa2                                         Number of obs =  2679
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            0.200           -3.480            -2.832            -2.545
    26            0.135           -3.480            -2.832            -2.546
    25           -0.122           -3.480            -2.833            -2.546
    24            0.156           -3.480            -2.833            -2.547
    23           -0.209           -3.480            -2.834            -2.547
    22           -0.440           -3.480            -2.834            -2.548
    21           -0.344           -3.480            -2.835            -2.548
    20           -0.312           -3.480            -2.836            -2.549
    19           -0.027           -3.480            -2.836            -2.549
    18           -0.011           -3.480            -2.837            -2.549
    17            0.052           -3.480            -2.837            -2.550
    16            0.079           -3.480            -2.838            -2.550
    15            0.004           -3.480            -2.838            -2.551
    14            0.189           -3.480            -2.839            -2.551
    13           -0.095           -3.480            -2.839            -2.552
    12           -0.195           -3.480            -2.840            -2.552
    11           -0.203           -3.480            -2.840            -2.553
    10           -0.227           -3.480            -2.841            -2.553
    9            -0.122           -3.480            -2.841            -2.554
    8            -0.025           -3.480            -2.842            -2.554
    7             0.242           -3.480            -2.842            -2.554
    6             0.109           -3.480            -2.843            -2.555
    5            -0.111           -3.480            -2.843            -2.555
    4            -0.216           -3.480            -2.844            -2.556
    3            -0.540           -3.480            -2.844            -2.556
    2            -0.333           -3.480            -2.845            -2.557
    1            -0.409           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 26 with RMSE  20.87021
Min SC   =  6.156196 at lag 26 with RMSE  20.87021
Min MAIC =   6.09607 at lag 26 with RMSE  20.87021

. dfuller cgpa2, trend lags(`r(optlag)') regress // Trend es no siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2680

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)              0.985            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 1.0000

------------------------------------------------------------------------------
D.cgpa2      |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       cgpa2 |
         L1. |   .0011744   .0011917     0.99   0.324    -.0011624    .0035111
         LD. |   .2599039   .0194121    13.39   0.000     .2218395    .2979683
        L2D. |  -.0554819    .019953    -2.78   0.005     -.094607   -.0163569
        L3D. |   .0940189   .0203243     4.63   0.000     .0541658     .133872
        L4D. |  -.0700825   .0217296    -3.23   0.001    -.1126912   -.0274738
        L5D. |  -.0425908   .0218536    -1.95   0.051    -.0854427     .000261
        L6D. |  -.0189643   .0219276    -0.86   0.387    -.0619613    .0240327
        L7D. |   -.125036   .0218709    -5.72   0.000    -.1679218   -.0821501
        L8D. |   .1205244   .0220956     5.45   0.000     .0771981    .1638508
        L9D. |   .0241736   .0222189     1.09   0.277    -.0193944    .0677416
       L10D. |  -.0059328   .0222148    -0.27   0.789     -.049493    .0376273
       L11D. |   .0294977   .0222111     1.33   0.184    -.0140552    .0730505
       L12D. |   -.040124   .0221332    -1.81   0.070    -.0835242    .0032761
       L13D. |   .0155214   .0220141     0.71   0.481    -.0276451    .0586879
       L14D. |   -.139457   .0220185    -6.33   0.000    -.1826322   -.0962819
       L15D. |   .0952776   .0221834     4.30   0.000     .0517792    .1387761
       L16D. |  -.0078819   .0223159    -0.35   0.724    -.0516402    .0358763
       L17D. |  -.0450936   .0223265    -2.02   0.044    -.0888726   -.0013145
       L18D. |   .0532194   .0223462     2.38   0.017     .0094018    .0970371
       L19D. |   -.052061   .0222324    -2.34   0.019    -.0956556   -.0084663
       L20D. |   .1035994   .0221516     4.68   0.000     .0601633    .1470355
       L21D. |   .0195045   .0222251     0.88   0.380    -.0240757    .0630848
       L22D. |   .0257903   .0222321     1.16   0.246    -.0178036    .0693842
       L23D. |  -.0243722   .0221157    -1.10   0.271     -.067738    .0189935
       L24D. |    -.19521    .021967    -8.89   0.000    -.2382841   -.1521359
       L25D. |   .1375078   .0222139     6.19   0.000     .0939494    .1810662
       L26D. |  -.1062008   .0212231    -5.00   0.000    -.1478163   -.0645853
      _trend |   .0009988   .0006303     1.58   0.113    -.0002371    .0022346
       _cons |  -.8562807   .8619141    -0.99   0.321    -2.546373    .8338115
------------------------------------------------------------------------------

. dfgls cgpa2, notrend
 
DF-GLS for cgpa2                                         Number of obs =  2679
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27            2.735           -2.580            -1.946            -1.624
    26            2.609           -2.580            -1.946            -1.624
    25            2.154           -2.580            -1.947            -1.624
    24            2.628           -2.580            -1.947            -1.625
    23            1.991           -2.580            -1.947            -1.625
    22            1.612           -2.580            -1.948            -1.625
    21            1.761           -2.580            -1.948            -1.626
    20            1.808           -2.580            -1.948            -1.626
    19            2.280           -2.580            -1.949            -1.626
    18            2.302           -2.580            -1.949            -1.626
    17            2.406           -2.580            -1.949            -1.627
    16            2.448           -2.580            -1.950            -1.627
    15            2.312           -2.580            -1.950            -1.627
    14            2.631           -2.580            -1.950            -1.628
    13            2.132           -2.580            -1.951            -1.628
    12            1.963           -2.580            -1.951            -1.628
    11            1.946           -2.580            -1.951            -1.628
    10            1.903           -2.580            -1.952            -1.629
    9             2.072           -2.580            -1.952            -1.629
    8             2.230           -2.580            -1.952            -1.629
    7             2.694           -2.580            -1.953            -1.630
    6             2.455           -2.580            -1.953            -1.630
    5             2.079           -2.580            -1.953            -1.630
    4             1.902           -2.580            -1.953            -1.630
    3             1.392           -2.580            -1.954            -1.631
    2             1.697           -2.580            -1.954            -1.631
    1             1.575           -2.580            -1.954            -1.631
 
Opt Lag (Ng-Perron seq t) = 26 with RMSE  20.85041
Min SC   =  6.154298 at lag 26 with RMSE  20.85041
Min MAIC =  6.100415 at lag 26 with RMSE  20.85041

. dfuller cgpa2, lags(`r(optlag)') regress // No rechazamos H0. Hay raiz unitaria

Augmented Dickey-Fuller test for unit root         Number of obs   =      2680

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)              2.156            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.9988

------------------------------------------------------------------------------
     D.cgpa2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       cgpa2 |
         L1. |   .0021777   .0010099     2.16   0.031     .0001974    .0041579
         LD. |   .2598321   .0194176    13.38   0.000      .221757    .2979072
        L2D. |  -.0557915   .0199577    -2.80   0.005    -.0949257   -.0166572
        L3D. |   .0936478   .0203288     4.61   0.000      .053786    .1335097
        L4D. |  -.0703368   .0217352    -3.24   0.001    -.1129565   -.0277171
        L5D. |  -.0428291   .0218593    -1.96   0.050    -.0856922    .0000339
        L6D. |  -.0191196   .0219337    -0.87   0.383    -.0621284    .0238892
        L7D. |  -.1252141   .0218769    -5.72   0.000    -.1681116   -.0823166
        L8D. |   .1205315   .0221019     5.45   0.000     .0771928    .1638701
        L9D. |   .0240374    .022225     1.08   0.280    -.0195427    .0676175
       L10D. |   -.006081    .022221    -0.27   0.784    -.0496532    .0374912
       L11D. |   .0293636   .0222173     1.32   0.186    -.0142013    .0729286
       L12D. |  -.0403094   .0221392    -1.82   0.069    -.0837212    .0031025
       L13D. |   .0153903   .0220202     0.70   0.485    -.0277882    .0585688
       L14D. |  -.1396155   .0220245    -6.34   0.000    -.1828025   -.0964285
       L15D. |   .0952586   .0221897     4.29   0.000     .0517478    .1387694
       L16D. |  -.0080356    .022322    -0.36   0.719    -.0518059    .0357347
       L17D. |  -.0452219   .0223327    -2.02   0.043    -.0890131   -.0014306
       L18D. |   .0531441   .0223525     2.38   0.017      .009314    .0969741
       L19D. |  -.0522167   .0222385    -2.35   0.019    -.0958234   -.0086101
       L20D. |   .1034958   .0221578     4.67   0.000     .0600475    .1469441
       L21D. |   .0193131   .0222311     0.87   0.385    -.0242789    .0629051
       L22D. |   .0255696    .022238     1.15   0.250    -.0180359    .0691751
       L23D. |  -.0246054   .0221215    -1.11   0.266    -.0679825    .0187718
       L24D. |  -.1954358   .0219728    -8.89   0.000    -.2385213   -.1523503
       L25D. |   .1374366   .0222202     6.19   0.000     .0938659    .1810073
       L26D. |    -.10643   .0212287    -5.01   0.000    -.1480564   -.0648035
             |
       _cons |   .3146447   .4438908     0.71   0.478    -.5557625    1.185052
------------------------------------------------------------------------------

. dfgls D.cgpa2
 
DF-GLS for D.cgpa2                                       Number of obs =  2678
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -9.283           -3.480            -2.832            -2.545
    26           -8.990           -3.480            -2.832            -2.546
    25           -9.032           -3.480            -2.833            -2.546
    24           -8.421           -3.480            -2.833            -2.547
    23           -9.580           -3.480            -2.834            -2.547
    22           -8.539           -3.480            -2.834            -2.548
    21           -7.970           -3.480            -2.835            -2.548
    20           -8.474           -3.480            -2.836            -2.549
    19           -8.803           -3.480            -2.836            -2.549
    18          -10.185           -3.480            -2.837            -2.549
    17          -10.615           -3.480            -2.837            -2.550
    16          -11.323           -3.480            -2.838            -2.550
    15          -11.929           -3.480            -2.838            -2.551
    14          -12.080           -3.480            -2.839            -2.551
    13          -13.710           -3.480            -2.839            -2.552
    12          -12.764           -3.480            -2.840            -2.552
    11          -12.796           -3.480            -2.840            -2.553
    10          -13.372           -3.480            -2.841            -2.553
    9           -13.916           -3.480            -2.841            -2.554
    8           -15.444           -3.480            -2.842            -2.554
    7           -17.243           -3.480            -2.842            -2.554
    6           -21.362           -3.480            -2.843            -2.555
    5           -22.598           -3.480            -2.843            -2.555
    4           -23.176           -3.480            -2.844            -2.556
    3           -25.200           -3.480            -2.844            -2.556
    2           -25.245           -3.480            -2.845            -2.557
    1           -31.834           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 27 with RMSE   20.9828
Min SC   =  6.166331 at lag 25 with RMSE  21.00689
Min MAIC =  6.803173 at lag 21 with RMSE  21.43798

. dfuller D.cgpa2, trend lags(`r(optlag)') regress // Trend es siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2678

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -11.617            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
D2.cgpa2     |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     D.cgpa2 |
         L1. |  -1.003334   .0863663   -11.62   0.000    -1.172686   -.8339814
         LD. |   .2608861   .0844589     3.09   0.002      .095274    .4264981
        L2D. |   .2040933   .0826269     2.47   0.014     .0420734    .3661131
        L3D. |   .3045065   .0814807     3.74   0.000     .1447341    .4642788
        L4D. |    .221473   .0793187     2.79   0.005     .0659402    .3770058
        L5D. |   .1788946   .0779623     2.29   0.022     .0260214    .3317678
        L6D. |   .1614565   .0765918     2.11   0.035     .0112706    .3116424
        L7D. |   .0431003   .0752299     0.57   0.567     -.104415    .1906157
        L8D. |   .1690938   .0736319     2.30   0.022      .024712    .3134757
        L9D. |   .1932236   .0716358     2.70   0.007     .0527559    .3336914
       L10D. |   .1906022   .0697878     2.73   0.006     .0537581    .3274463
       L11D. |   .2186686   .0676562     3.23   0.001     .0860042    .3513331
       L12D. |   .1815544   .0656403     2.77   0.006     .0528429    .3102659
       L13D. |   .2016307   .0636113     3.17   0.002     .0768978    .3263635
       L14D. |   .0553265   .0609426     0.91   0.364    -.0641735    .1748264
       L15D. |   .1497725   .0587615     2.55   0.011     .0345494    .2649956
       L16D. |   .1434424   .0566833     2.53   0.011     .0322945    .2545904
       L17D. |   .1005791   .0545097     1.85   0.065    -.0063068     .207465
       L18D. |   .1558132   .0521628     2.99   0.003     .0535293     .258097
       L19D. |    .108888    .049651     2.19   0.028     .0115293    .2062467
       L20D. |   .2194575   .0469579     4.67   0.000     .1273797    .3115354
       L21D. |   .2322928    .043123     5.39   0.000     .1477346     .316851
       L22D. |   .2568159    .039881     6.44   0.000     .1786148     .335017
       L23D. |   .2306529   .0367508     6.28   0.000     .1585898    .3027161
       L24D. |   .0328456   .0332189     0.99   0.323     -.032292    .0979833
       L25D. |    .177182   .0303013     5.85   0.000     .1177653    .2365987
       L26D. |   .0743585   .0254998     2.92   0.004     .0243569    .1243601
       L27D. |   .0690288   .0213509     3.23   0.001     .0271627    .1108949
      _trend |    .001438   .0005348     2.69   0.007     .0003893    .0024866
       _cons |  -1.189105   .8259899    -1.44   0.150    -2.808755     .430546
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfgls base2ALUAR
 
DF-GLS for base2ALUAR                                    Number of obs =  2679
Maxlag = 27 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    27           -3.668           -3.480            -2.832            -2.545
    26           -3.801           -3.480            -2.832            -2.546
    25           -3.722           -3.480            -2.833            -2.546
    24           -3.779           -3.480            -2.833            -2.547
    23           -3.760           -3.480            -2.834            -2.547
    22           -3.950           -3.480            -2.834            -2.548
    21           -3.900           -3.480            -2.835            -2.548
    20           -4.143           -3.480            -2.836            -2.549
    19           -4.155           -3.480            -2.836            -2.549
    18           -4.424           -3.480            -2.837            -2.549
    17           -4.481           -3.480            -2.837            -2.550
    16           -4.712           -3.480            -2.838            -2.550
    15           -4.887           -3.480            -2.838            -2.551
    14           -5.049           -3.480            -2.839            -2.551
    13           -5.313           -3.480            -2.839            -2.552
    12           -5.485           -3.480            -2.840            -2.552
    11           -5.679           -3.480            -2.840            -2.553
    10           -5.846           -3.480            -2.841            -2.553
    9            -5.840           -3.480            -2.841            -2.554
    8            -5.856           -3.480            -2.842            -2.554
    7            -6.189           -3.480            -2.842            -2.554
    6            -6.643           -3.480            -2.843            -2.555
    5            -6.579           -3.480            -2.843            -2.555
    4            -6.998           -3.480            -2.844            -2.556
    3            -7.684           -3.480            -2.844            -2.556
    2            -8.331           -3.480            -2.845            -2.557
    1            -9.434           -3.480            -2.845            -2.557
 
Opt Lag (Ng-Perron seq t) = 23 with RMSE   28.9665
Min SC   =  6.769784 at lag  4 with RMSE  29.29821
Min MAIC =  6.764481 at lag 23 with RMSE   28.9665

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. dfuller base2ALUAR, trend lags(`r(optlag)') regress // Trend es siginificativo

Augmented Dickey-Fuller test for unit root         Number of obs   =      2683

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.226            -3.960            -3.410            -3.120
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0041

------------------------------------------------------------------------------
D.base2ALUAR |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  base2ALUAR |
         L1. |  -.0409192   .0096825    -4.23   0.000    -.0599053   -.0219332
         LD. |   -.051413   .0209073    -2.46   0.014    -.0924093   -.0104167
        L2D. |  -.1513049   .0209262    -7.23   0.000    -.1923383   -.1102715
        L3D. |  -.1038533   .0210355    -4.94   0.000     -.145101   -.0626057
        L4D. |  -.1132176   .0211093    -5.36   0.000      -.15461   -.0718252
        L5D. |  -.0825606   .0211134    -3.91   0.000    -.1239611   -.0411602
        L6D. |  -.0145649   .0211341    -0.69   0.491    -.0560059    .0268761
        L7D. |  -.0850723     .02104    -4.04   0.000    -.1263287   -.0438159
        L8D. |  -.0671052   .0210235    -3.19   0.001    -.1083293   -.0258812
        L9D. |  -.0242216   .0209906    -1.15   0.249    -.0653811    .0169379
       L10D. |  -.0211766   .0208752    -1.01   0.310    -.0621099    .0197566
       L11D. |   -.047774   .0207994    -2.30   0.022    -.0885586   -.0069893
       L12D. |  -.0559949   .0207237    -2.70   0.007    -.0966311   -.0153587
       L13D. |  -.0469775   .0206713    -2.27   0.023     -.087511    -.006444
       L14D. |  -.0652627   .0206486    -3.16   0.002    -.1057517   -.0247737
       L15D. |  -.0443135   .0206433    -2.15   0.032    -.0847921   -.0038349
       L16D. |  -.0478013   .0205424    -2.33   0.020    -.0880819   -.0075207
       L17D. |  -.0557803   .0204046    -2.73   0.006    -.0957908   -.0157698
       L18D. |  -.0184347   .0203987    -0.90   0.366    -.0584338    .0215643
       L19D. |  -.0630816   .0202497    -3.12   0.002    -.1027884   -.0233748
       L20D. |   -.003407   .0200491    -0.17   0.865    -.0427205    .0359064
       L21D. |  -.0543367   .0198379    -2.74   0.006     -.093236   -.0154374
       L22D. |   .0133121   .0194979     0.68   0.495    -.0249204    .0515447
       L23D. |  -.0389922   .0194106    -2.01   0.045    -.0770536   -.0009307
      _trend |   .0003083   .0007251     0.43   0.671    -.0011135      .00173
       _cons |   12.41131   3.167209     3.92   0.000     6.200864    18.62175
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsline ase2ALUAR
variable ase2ALUAR not found
r(111);

end of do-file

r(111);

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. tsline base2ALUAR

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. cd "/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL"
/Users/federicolopez/Library/CloudStorage/OneDrive-Personal/Documents/UDESA/07/PRONOSTICOS-FINANCIEROS/TP-FINAL

. clear all

. use tp_final.dta

. 
. gen Lunes = (dow(fecha) == 1)

. gen Martes = (dow(fecha) == 2)

. gen Miercoles = (dow(fecha) == 3)

. gen Jueves = (dow(fecha) == 4)

. gen Viernes = (dow(fecha) == 5)

. gen Sabado = (dow(fecha) == 6)

. gen Domingo = (dow(fecha) == 0)

. 
. gen dia = ""
(2,707 missing values generated)

. replace dia = "Lunes" if Lunes == 1
variable dia was str1 now str5
(387 real changes made)

. replace dia = "Martes" if Martes == 1
variable dia was str5 now str6
(387 real changes made)

. replace dia = "Miercoles" if Miercoles == 1
variable dia was str6 now str9
(387 real changes made)

. replace dia = "Jueves" if Jueves == 1
(387 real changes made)

. replace dia = "Viernes" if Viernes == 1
(387 real changes made)

. replace dia = "Sabado" if Sabado == 1
(386 real changes made)

. replace dia = "Domingo" if Domingo == 1
(386 real changes made)

. 
. foreach num of numlist 1/12 {
  2.     local mes = "`num'"
  3.     gen mes`mes' = month(fecha) == `num'
  4. }

. 
. gen mes = ""
(2,707 missing values generated)

. replace mes = "Ene" if mes1 == 1
variable mes was str1 now str3
(247 real changes made)

. replace mes = "Feb" if mes2 == 1
(226 real changes made)

. replace mes = "Mar" if mes3 == 1
(248 real changes made)

. replace mes = "Abr" if mes4 == 1
(240 real changes made)

. replace mes = "May" if mes5 == 1
(248 real changes made)

. replace mes = "Jun" if mes6 == 1
(210 real changes made)

. replace mes = "Jul" if mes7 == 1
(217 real changes made)

. replace mes = "Ago" if mes8 == 1
(217 real changes made)

. replace mes = "Sep" if mes9 == 1
(210 real changes made)

. replace mes = "Oct" if mes10 == 1
(217 real changes made)

. replace mes = "Nov" if mes11 == 1
(210 real changes made)

. replace mes = "Dic" if mes12 == 1
(217 real changes made)

. 
end of do-file

. do "/var/folders/fm/4w6xdvfn5lx37kg5cbrn4jnc0000gn/T//SD24740.000000"

. graph box base2ALUAR, over(dia, sort(1)) name(semanabox, replace)

. 
end of do-file

. save "tp_final.dta", replace
file tp_final.dta saved

. exit
